[
  {
    "ID": "1",
    "Rank": "THƯỢNG XĂM",
    "Original": "開天開地作良縁\n吉利良時万物厡\n若得此簽非小可\n人行忠正帝皇宣",
    "Transliteration": "Khai thiên khai địa tác lương duyên\nCát lợi lương thời vạn vật nguyên\nNhược đắc thử xăm phi tiểu khả\nNhân hành trung chính đế hoàng tuyên.",
    "Translation": "Đất trời tự thuở hông hoang ấy\nNgày tháng tốt lành vạn vật xoay\nNgười được xăm này là hiếm thấy\nVua liền ban thưởng việc thẳng ngay",
    "Comment": "Điềm lành mau đến, Cuối năm giờ tốt. Quan âm giáng bút. Báo trước người hay",
    "Divination": "Bàn cổ sơ khai. Mọi việc điều tốt",
    "Reference": "Chung Ly thành đạo (鍾離成道)",
    "reference_translated": "Chung Ly thành đạo (鍾離成道)",
    "reference_detail": "Chung Ly Quyền, họ Chung Ly, tên Quyền, tự Vân Phòng, hiệu Chánh Dương, người huyện Hàm Dương, Tây An, Thiểm Tây thời Đông Hán. Chung Ly Quyền vốn là đại tướng nhà Hán, trong cuộc chinh phạt Tây Khương, bị trưởng quan Lương Dực đố kỵ, chỉ được cấp ba vạn binh lính già yếu, tàn tật. Vừa đến nơi đã bị quân Tây Khương đánh úp, binh sĩ bỏ chạy tán loạn. Chung Ly Quyền lạc đường đến một sơn cốc, giữa đường gặp một Hồ tăng, dẫn ông đến một thôn nhỏ nói: “Đây là chỗ ở của Đông Hoa Tiên Sinh.” Rồi cáo biệt đi. Một lát sau, bỗng nghe có người nói: “Đây chắc là do cái miệng nhiều chuyện của tên Hồ nhân mắt biếc kia.” Thấy một người khoác áo da hươu trắng, chống gậy lê màu xanh, hỏi Chung Ly Quyền: “Người đến có phải là Hán Đại Tướng Quân Chung Ly Quyền không?” Chung Ly Quyền đại kinh, biết đã gặp dị nhân, liền thành tâm học đạo. Chung Ly Quyền sau này gặp Hoa Dương Chân Nhân, rồi lại gặp Tiên Vương Huyền Phủ, học được “Trường Sinh Quyết”. Cuối cùng cư trú tại Tử Kim Tứ Hạo Phong trên núi Không Động, đắc được “Ngọc Hạp Bí Quyết”, tu thành chân tiên, cũng được Toàn Chân Giáo tôn làm một trong Bắc Ngũ Tổ.",
    "Explanation": "Gia đạo cầu phúc, Tự thân có tài, Thu đông đại lợi, Buôn bán hôn sự thành công,Người đi tới, điền vụ lục súc tốt. Tìm người gặp, Kiện tụng thành, Vật thất đông nam Bệnh thuyên giảm, Phong thủy cát."
  },
  {
    "ID": "2",
    "Rank": "TRUNG XĂM",
    "Original": "鯨魚未變守江河\n不可升騰更望高\n異日崢嶸身變化\n許君一躍跳龍門\nChữ Hán Việt\nKình ngư vị biến thủ giang hà\nBất khả thăng đằng cánh vượt cao\nDị nhật tranh vanh thân biến hóa\nHứa quân nhất diệu khiếu long môn\nDịch\nTung tăng bơi lội ở ven sông\nchớ ngó trời cao với biển đông\nĐợi ngày tỏa rạng thân thay xác\nvượt được long môn mới hóa rồng\nLời bàn\nPhải cố nhẫn nhịn, Không nên nóng vội. Khi\nthời cơ tới, Công danh sáng tươi\nĐiềm Quẻ Ứng\n\n\nKình ngư chưa biến, Mọi sự nhẫn nhịn chờ thời\nTích Cổ : Tô Tần chưa làm quan\nGiải\nGia đạo bất an, Tự thân mãn nguyện, Cầu tài\nbất lợi, Hôn sự khó thành, người đi bình an\nĐiền vụ lục súc bất lợi, Tìm người thấy, Kiện\ntụng hòa, Thất vật đông nam, bệnh cầu khấn,\nphong thủy cát",
    "Transliteration": "Kình ngư vị biến thủ giang hà\nBất khả thăng đằng cánh vượt cao\nDị nhật tranh vanh thân biến hóa\nHứa quân nhất diệu khiếu long môn",
    "Translation": "Tung tăng bơi lội ở ven sông\nchớ ngó trời cao với biển đông\nĐợi ngày tỏa rạng thân thay xác\nvượt được long môn mới hóa rồng",
    "Comment": "Phải cố nhẫn nhịn, Không nên nóng vội. Khi thời cơ tới, Công danh sáng tươi",
    "Divination": "Kình ngư chưa biến, Mọi sự nhẫn nhịn chờ thời",
    "Reference": "Tô Tần thi rớt (蘇秦不第)",
    "reference_translated": "Tô Tần chưa làm quan (蘇秦不第)",
    "reference_detail": "Thời Chiến Quốc, Tô Tần, người Lạc Dương, bái Quỷ Cốc Tử làm thầy. Tô Tần từng du thuyết Tần Vương, dâng thư đạt mười hai lần, Tần Vương đều không tiếp nhận lời ông. Khi về nhà, áo da rách nát, tiền bạc cạn kiệt, tiều tụy về đến cửa, vợ cũng không thèm để ý, chị dâu cũng không nấu cơm cho ăn. Tô Tần hổ thẹn phẫn nộ, được “Thái Công Âm Phù” (sách binh pháp), phát phẫn khổ đọc. Khi buồn ngủ lười biếng, liền dùng dùi đâm vào đùi, đau mà tiếp tục đọc. Sau này dùng học thuyết Hợp Tung, liên kết sáu nước đối kháng Tần. Ông thuyết phục được Triệu Vương, trở thành tể tướng của sáu nước.",
    "Explanation": "Gia đạo bất an, Tự thân mãn nguyện, Cầu tài bất lợi, Hôn sự khó thành, người đi bình an Điền vụ lục súc bất lợi, Tìm người thấy, Kiện tụng hòa, Thất vật đông nam, bệnh cầu khấn, phong thủy cát"
  },
  {
    "ID": "3",
    "Rank": "HẠ XĂM",
    "Original": "臨風冒雨去還郷\n正是其身似燕兒\n銜得泥来欲作壘\n到頭壘壊復須泥",
    "Transliteration": "Lâm phong mạo vũ khứ hoàn hương\ncánh thị kỳ thân tự yến nhi\nHàm đắc nê lai dục tác lũy\nđáo đầu hủy hoại phục tu nê",
    "Translation": "Chim én nhỏ bay trong gió bão\nTha bùn về xây tổ nên cao\nXảy đâu một trận mưa rào\nTổ kia tan rã công lao còn gì",
    "Comment": "Sớm tối lo nghĩ, Trăm phương ngàn kế, Nhưng có ngờ đâu, Hao tâm uổng phí",
    "Divination": "Yến tử hàm nê, Mọi việc lao tâm uổng phí",
    "Reference": "Đổng Vĩnh táng phụ (董永葬父)",
    "reference_translated": "Đổng Vĩnh táng phụ (董永葬父)",
    "reference_detail": "Đổng Vĩnh thời nhà Hán, người Thiên Thặng. Gia cảnh bần hàn, mất mẹ từ nhỏ, một mình phụng dưỡng cha. Cha mất, Đổng Vĩnh không tiền mai táng, liền vay người một vạn tiền để lo việc tang lễ cho cha. Sau này không tiền trả, liền bán thân làm nô bộc. Mỗi ngày phải lấy một gánh củi, gánh bốn gánh nước, cuốc sáu bảy mẫu ruộng, vất vả khó bề chịu đựng. (Câu chuyện này ví von: nỗ lực cày cuốc, bản thân lại chẳng còn gì.)",
    "Explanation": "Gia đạo tiền hung hậu cát, Tự thân phòng bị, Cầu tài tốt, Giao dịch thành, hôn nhân xấu Người đi tốt, Điền vụ lục súc có lợi, Kiện tụng có lý,Tìm người gặp, Di dời an Thất vật gặp, Bệnh thuyên giảm, phong thủy cát"
  },
  {
    "ID": "4",
    "Rank": "THƯỢNG XĂM",
    "Original": "千年古镜復重光\n女再求夫男再婚\n自此門庭重改換\n更添福祿在兒孫",
    "Transliteration": "Thiên niên cổ kính phục trùng viên\nNữ tái cầu phu nam tái hôn\nTự thử môn đình trùng cải hoán\nCánh thêm phúc lộc tại nhi tôn",
    "Translation": "Gương xưa đã vở lại liền tròn\nTrai cô gái góa hẹn nước non\nCửa nhà cao rông thêm vui vẻ\nPhúc lộc lưu truyền tới cháu con",
    "Comment": "Đãi cát tìm vàng, Qua bao gian khó, Tuy nhiều lao tâm, Tựu trung hữu ích",
    "Divination": "Cổ kính trùng viên, Mọi sự lao tâm, có quí nhân giúp",
    "Reference": "Ngọc Liên hội Thập Bằng(玉蓮會十朋)",
    "reference_translated": "Ngọc Liên hội ngộ Thập Bằng (玉蓮會十朋)",
    "reference_detail": "Thời nhà Tống, Tiền Ngọc Liên và Vương Thập Bằng kết hôn. Thập Bằng lên kinh ứng thí, phú hộ Tôn Nhữ Quyền ép Ngọc Liên tái giá với mình. Tiền Ngọc Liên từ chối lời cầu hôn của phú hộ Tôn Nhữ Quyền, thà gả cho thư sinh nghèo Vương Thập Bằng ở Ôn Châu với sính lễ “Kinh Thoa” (trâm cài tóc bằng gai). Sau này Vương Thập Bằng đỗ trạng nguyên, vì từ chối Vạn Sĩ Thừa Tướng ép hôn, bị phái đi nhậm chức Thiêm Phán ở vùng hẻo lánh Triều Dương. Tôn Nhữ Quyền lén lút sửa đổi thư nhà của Vương Thập Bằng thành “hưu thư” (thư bỏ vợ), lừa Ngọc Liên mắc bẫy; mẹ kế của Tiền Ngọc Liên cũng ép cô tái giá, Ngọc Liên không chịu, khi nhảy sông tự vẫn, được An Phủ Phúc Kiến Tiền Tái Hòa cứu, nhận làm con gái nuôi. Ngọc Liên tưởng Thập Bằng đã mất, năm năm sau, Vương Thập Bằng làm Thái Thú ở Cát An, một hôm tại đạo quán thiết lễ cúng tế tưởng nhớ người vợ quá cố, đúng lúc Ngọc Liên đến đạo quán Cát An thắp hương, Vương và Tiền cuối cùng cũng đoàn tụ.",
    "Explanation": "Gia đạo bất lợi, Tự thân được tài, thu đông thịnh vượng, Giao dịch được tốt Hôn nhân thành, Người đi tới, Tìm người thấy, Điền vụ khả quan Kiện tụng bất lợi, Di dời thủ cựu, Thất vật chậm thấy, Bệnh cầu phúc, Phong thủy cát"
  },
  {
    "ID": "5",
    "Rank": "TRUNG XĂM",
    "Original": "鐡錐草地要求泉\n努カ求之得最難\n無意俄然遇知已\n相逢携手上靑天",
    "Transliteration": "Thiết chùy thảo địa yếu cầu tuyền\nNổ lực cầu chi đắc tối nan\nVô ý nga nhiên ngộ tri kỷ\nTương phùng huề thủ thượng thanh thiên",
    "Translation": "Tìm nguồn suối ngọt ở nơi sâu\nChùy sắt có mà đào được đâu\nBỗng nhiên gặp được người tri kỷ\nDắt dìu dạo bước cảnh tiên đào",
    "Comment": "Tâm nguyện muốn làm, Hướng tây khả cầu, nếu không động thủ, có mà được đâu",
    "Divination": "Chùy địa cầu tuyền, mọi sự trước khó sau dễ",
    "Reference": "Lưu Thần gặp tiên (劉晨遇仙)",
    "reference_translated": "Lưu Thần gặp tiên (劉晨遇仙)",
    "reference_detail": "Thời Đông Hán, Lưu Thần và Nguyễn Triệu hai người vào núi hái thuốc, gặp hai tiên nữ. Hai người kết hôn với tiên nữ, nửa năm sau hai người về nhà, nhưng không ngờ khi về đến nhà, nhân gian đã trôi qua một trăm năm. Không ai nhận ra hai người họ, hai người liền trở lại núi tìm tiên nữ, nhưng cuối cùng vẫn không tìm thấy.",
    "Explanation": "Gia đạo cầu phúc, Tự thân có tài,Giao dịch hôn nhân hợp, Người đi trễ, Tìm người gặp Điền vụ nên sớm, Lục suc tổn, Kiện tụng hòa, Di dời cát, Tìm vật mất, Bệnh khó, Phong thủy cát"
  },
  {
    "ID": "6",
    "Rank": "TRUNG XĂM",
    "Original": "投身岩下銅鳥居\n須是還他大丈夫\n拾得營謀誰可得\n通行天地此人無",
    "Transliteration": "Đầu thân nham hạ điểu đồng cư\nTu thi hoàn tha đại trượng phu\nThập đắc doanh mưu thùy khả đắc\nThông hành thiên địa thử nhân vô",
    "Translation": "Chim đông dựng tổ mõn non cao\nTrông đó rỏ ràng vẫn thanh tao\nĐây được doanh mưu người chẳng được\nCon đường rộng mở bước đi mau",
    "Comment": "Cuộc sống không giàu, Thân tự thanh cao, Tới thời lợi lạc, Quyền vẫn như nhau",
    "Divination": "Đông điểu đầu nham, Việc chi cũng thuận cát",
    "Reference": "Tiết Nhân Quý gặp chủ (仁貴遇主)",
    "reference_translated": "Nhân Quý gặp chủ (仁貴遇主)",
    "reference_detail": "Triều Đường, Tiết Lễ (614-683), tự Nhân Quý, người Long Môn, Giáng Châu (nay Hà Tân, Sơn Tây). Tiết Nhân Quý ba lần tòng quân, chỉ đảm nhiệm chức binh sĩ coi sóc việc bếp núc. Đường Thái Tông (Lý Thế Dân) bị Cái Tô truy sát, trong lúc nguy cấp, được Nhân Quý cứu thoát. Lập tức được Đường Thái Tông phong làm Nguyên soái, dẫn binh đông chinh, lập nhiều chiến công hiển hách.",
    "Explanation": "Gia đạo bất lợi, Tự thân cầu tài cát, giao dịch khó thành, hôn nhân tốt, người đi tới Điền vụ sớm tốt, Di dời cát, Vật thất gặp, Bệnh vần giảm, Kiện tụng đúng lý , Phong thủy an"
  },
  {
    "ID": "7",
    "Rank": "HẠ XĂM",
    "Original": "奔波阻隔重重險\n帶水拖泥去度山\n更望他方求用事\n千郷萬里未回還",
    "Transliteration": "Bôn ba trở cách trùng trùng hiểm\nĐới thủy đà nê khứ độ san\nCánh dụng tha phương cầu dụng sự\nThiên hương vạn lý vị hồi hoàn",
    "Translation": "Trước mặt non cao lớp lớp dầy\nDây dưa không quyết bước sao đây\nĐất khách muốn mưu làm việc lớn\nQuê cũ nghìn xa chẳng thể quay",
    "Comment": "Yên thân thời được, Tiến bộ là khó, giử yên như cũ, đừng ngó cao thêm",
    "Divination": "Đà nê đới thủy, Việc theo cũ là tốt",
    "Reference": "Tô Nương chạy nạn",
    "reference_translated": "Thu Nương tẩu nạn (秋娘走難)",
    "reference_detail": "Đỗ Thu, người Kim Lăng, đời Đường. Năm mười lăm tuổi, trở thành thiếp của Lý Kì (phản thần nhà Đường). Năm Nguyên Hòa thứ hai (807), Lý Kì chính thức khởi binh tạo phản. Sau khi Lý Kì thất bại, Đỗ Thu được nạp nhập cung. Sau đó được Đường Hiến Tông sủng hạnh, trở thành tần phi. Năm Nguyên Hòa thứ mười lăm (820), Đường Mục Tông tức vị, bổ nhiệm bà làm Phó Mẫu cho con trai là Lý Thấu (nhũ mẫu chuyên chăm sóc con cái hoàng tộc). Sau đó Lý Thấu bị phế chức Chương Vương, Đỗ Thu được ban thưởng về cố hương. Khi Đỗ Mục đi qua Kim Lăng, thấy cảnh bà tuổi già, nghèo khó...",
    "Explanation": "Gia đạo bất lợi, Bản thân thuận lợi, Cầu tài thu đông cát, Giao dịch trung bình, Hôn nhân chớ dội, Người đi trở ngại, Điền vụ lục súc bất lợi, Tìm người khó, Kiện tụng thua, Di dời cát, Thất vật khó tìm, Bệnh làm phúc, Phong thủy bất lợi"
  },
  {
    "ID": "8",
    "Rank": "THƯỢNG XĂM",
    "Original": "荗林松栢正興旺\n雨雪莫為總風霜\n異日忽然成大用\n功成名就材楝樑",
    "Transliteration": "Mậu lâm tòng bá chính hưng vương\nVũ tuyết mạc vi tổng phong sương\nDị nhật hốt nhiên thành đại dụng\nCông thành danh tựu tài đống lương",
    "Translation": "Rừng sâu tùng bách mọc xanh rì\nMưa bão tuyết sương có xá chi\nMai kia cao lớn cây ngay thẳng\nRường cột thành danh đã đến kỳ",
    "Comment": "Trên lộ hanh thông, Suốt đời ra công, Bội thu thành quả, Gia đạo hưng long",
    "Divination": "Tòng bá tươi tốt, Việc chi có quí nhân phò hộ",
    "Reference": "Diệu Năng ngộ tiên",
    "reference_translated": "Phạm Văn Chính Công cắt rau vạch cháo (范文正公斷虀畫粥)",
    "reference_detail": "Danh thần đời Tống là Phạm Trọng Yêm, thuở nhỏ gia cảnh bần hàn, đọc sách tại tăng xá Trường Bạch Sơn. Mỗi ngày ông dùng hai thăng kê (hạt kê) nấu cháo, qua đêm đông đặc lại, dùng dao cắt thành bốn miếng. Sáng tối ăn hai miếng, lại cắt thêm ít dưa muối để ăn kèm.",
    "Explanation": "Gia đạo tốt, Tự thân thuận lợi, Cầu tài trung bình, Giao dịch vượng, Hôn nhân thành, Điền vụ lợi, Lục súc tổn, Người đi có tin, Tìm người có, Kiện tụng hữu lý, Di dời cát, Thất vật có, Bệnh an khương, Phong thủy cát"
  },
  {
    "ID": "9",
    "Rank": "THƯỢNG XĂM",
    "Original": "煩君勿作私心事\n此意徧宜說問公\nㄧ片明心光皎潔\n宛如皎月正天心",
    "Transliteration": "Phiền quân vật tác tư tâm sự\nThử ý thiên nghi thuyết vấn công\nNhất phiến minh tâm quang kiểu khiết\nUyển như kiểu nguyệt chính thiên tâm",
    "Translation": "Đừng có làm chi việc trái lòng\nDâng ý này lên hỏi thánh ông\nTấm lòng son sắt người người tỏ\nVí giữa trời cao trăng sáng trong",
    "Comment": "Trong lòng chính trực, Thuận lý thuận tình, Thánh vô tư ngữ, sau cũng phân minh",
    "Divination": "Kiểu nguyệt đương thông, mọi chuyện quang minh thông suốt",
    "Reference": "Khổng Minh điểm tướng",
    "reference_translated": "Khổng Minh điểm tướng (孔明點將)",
    "reference_detail": "Thời Tam Quốc, Gia Cát Lượng (181-234), tự Khổng Minh, người Dương Đô, Lang Gia (nay là huyện Nghi Nam, Sơn Đông). Gia Cát Lượng sau khi được Lưu Bị ba lần đến lều tranh mời ra làm quan, liền đồng ý phò tá. Bấy giờ Tào Tháo đã bình định Hà Bắc, quyết tâm nam chinh, bèn phái Hạ Hầu Đôn làm chủ tướng, Vu Cấm, Lý Điển làm phó tướng, dẫn mười vạn quân thẳng tiến Tân Dã. Bấy giờ Gia Cát Lượng tuy đã có kế sách lui địch, song Quan Vũ, Trương Phi lại khinh thường lời của ông. Gia Cát Lượng bất đắc dĩ, bèn mượn lệnh kiếm của Lưu Bị để uy phục hai người, sai mỗi người dẫn một nghìn binh mã, mai phục tại Dư Sơn, An Lâm. Đợi khi Hạ Hầu Đôn dẫn quân đi qua, liền dùng phục binh và hỏa công đánh úp. Ngoài ra, phái Triệu Vân dẫn tàn binh yếu kém, đảm nhiệm tiên phong giao chiến với Hạ Hầu Đôn, rồi giả vờ thua chạy, dụ Hạ Hầu Đôn vào đường rừng hẹp. Lại sai Quan Bình, Chu Thương, Lưu Phong tiềm nhập phía sau quân Tào, phóng hỏa đốt vật tư, gây hoảng loạn cho quân Tào. Sau khi giao chiến, mọi việc đều diễn ra như Gia Cát Lượng đã an bài. Khi Hạ Hầu Đôn và Vu Cấm dẫn quân truy kích, Lý Điển ở phía sau cấp báo cho Hạ Hầu Đôn ở phía trước cần đề phòng hỏa công của địch. Tuy nhiên đã quá muộn, quân Tào bị kẹt trong đường hẹp, lại ở nơi cây cối chằng chịt, lửa bốc cháy không thể cứu vãn, thương vong vô cùng thảm khốc. Hạ Hầu Đôn cùng các tướng lĩnh phải bại tẩu về Hứa Đô.",
    "Explanation": "Gia đạo cát, Tự thân thuận, Cầu tài trung bình, Giao dịch vượng, Hôn nhân thành, Người đi động, Điền vụ lợi, Lục suc tổn, Tìm người có, Kiện tụng hữu lý, Di dời cát, Thất vật cầu phúc, Bệnh được an, Phong thủy cát."
  },
  {
    "ID": "10",
    "Rank": "TRUNG XĂM",
    "Original": "石藏無價玉和珍\n只管他鄉外客尋\n宛似持燈更觅火\n不如收拾枉勞心",
    "Transliteration": "Thạch tàng vô giá ngọc hòa trân\nChỉ quản tha hương ngoại khách tầm\nUyển tự trì đăng canh mịch hỏa\nBất như thu thập uổng lao tâm",
    "Translation": "Đá kia ẩn ngọc quí bên trong\nTìm chi xứ lạ mãi mênh mông\nVí tựa cầm đèn chờ lửa tới\nsắp đặc đúng rồi khỏi ngóng trông",
    "Comment": "Nhân duyên hội ngộ, Việc chi không thành, lòng suy nghĩ kỹ, mới gặp chân lý",
    "Divination": "Cầm đèn chờ lửa, mọi việc đợi thời mới thành",
    "Reference": "Bàng Quyên xem trận",
    "reference_translated": "Bàng Quyên xem trận (龐涓觀陣)",
    "reference_detail": "Thời Chiến Quốc, Tôn Tẫn người nước Tề, Bàng Quyên người nước Ngụy. Cả hai cùng bái Quỷ Cốc Tử làm thầy. Tôn Tẫn học giỏi hơn Bàng Quyên. Bàng Quyên làm tướng quân nước Ngụy. Khi đấu trí với Tôn Tẫn, Bàng Quyên thua nên đố kỵ Tôn Tẫn. Bèn dùng kế chặt cụt hai chân Tôn Tẫn. Sau này Tôn Tẫn giả vờ điên loạn mới thoát thân được. Tề Uy Vương dùng Tôn Tẫn làm quân sư, dẫn binh đánh nước Ngụy. Bàng Quyên đến doanh trại Tôn Tẫn để xem xét binh trận. Tôn Tẫn dùng phương pháp giả vờ giảm binh, nhưng thực chất lại bí mật tăng thêm binh sĩ, lừa gạt Bàng Quyên. Bàng Quyên đuổi đến Mã Lăng Đạo, bị phục binh dùng cung nỏ bắn chết.",
    "Explanation": "Gia đạo thiếu lợi, Tự thân an, Cầu tài giao dịch khó, Hôn nhân hợp, Người đi động, Kiện tụng thua, Điền vụ thu tốt, Lục súc khó nuôi, Tìm người thấy, Di dời an, Vật thất khó tìm, Bệnh thuyên giảm, Phong thủy trung bình"
  },
  {
    "ID": "11",
    "Rank": "THƯỢNG XĂM",
    "Original": "欲求勝事可非常\n争奈親姻日暫忙\n到頭更必成鹿箭\n貴人指引貴人鄉",
    "Transliteration": "Dục cầu thắng sự khả phi thường\nTranh nại thân nhân nhật tạm mang\nĐáo đầu cánh tất thành lộc tiển\nQúi nhân chỉ dẫn quí nhân hương",
    "Translation": "Ham muốn tranh chi việc thắng thua\nNhân duyên mợi sự chớ tranh đua\nCó ngày hưu nhỏ nên tên ngắm\nQúi nhân dẫn giúp đến quê xưa",
    "Comment": "Việc có may rủi, Sau lại an nhiên, Như muốn hành sự, sẽ gặp quí nhân",
    "Divination": "Trong họa có Phúc, Mọi sự được cát lợi",
    "Reference": "Tiến cử Khương Duy",
    "reference_translated": "Tiến cử Khương Duy (書薦姜維(書獻姜維))",
    "reference_detail": "Khương Duy (năm 202 - 264), tự Bá Ước, người Ký huyện, quận Thiên Thủy, Lương Châu (nay thuộc huyện Cam Cốc, thành phố Thiên Thủy, tỉnh Cam Túc). Thời Tam Quốc, Khổng Minh dẫn binh sáu lần xuất Kỳ Sơn, tiến đánh Tào Ngụy. Khi Khổng Minh bệnh nặng nguy kịch, bèn trao hai mươi bốn thiên binh thư cho Đại tướng quân Khương Duy, mong chàng có thể kế thừa di chí.",
    "Explanation": "Gia đạo đại cát, Tự thân thuận lợi, Cầu tài có, Giao dịch thành, Hôn nhân hợp, Tìm người có, Người đi trễ, Điền vụ lục súc trung bình, Kiện tụng có lý, Di dời vượng, Thất vật Hướng đông, Bệnh khó, Phong thủy cát."
  },
  {
    "ID": "12",
    "Rank": "THƯỢNG XĂM",
    "Original": "否去泰來咫尺間\n暫交君子出于山\n若逢虎兔佳音信\n立志忙中事即閑",
    "Transliteration": "Bỉ khứ thái lai chỉ xích gian\nTạm giao quân tử xuất vu san\nNhược phùng hổ thố giai âm tín\nLập chí mang trung sự tức nhàn",
    "Translation": "Khổ cực sáng tươi cách tất gang\nTạm đưa người quí vượt đồi ngang\nGặp được mẹo dần tin được tốt\nLập thân trong gắp hóa thư nhàn",
    "Comment": "Đổi bố lấy tơ, Buộc hai chân người. Muốn thấy phân minh, Trong tai có phúc",
    "Divination": "Họa trung hữu phúc, Mọi việc tiền hung hậu cát",
    "Reference": "Võ Cát gặp thầy",
    "reference_translated": "Võ Cát gặp thầy (武吉遇師)",
    "reference_detail": "Võ Cát vốn là tiều phu. Khi Khương Tử Nha câu cá tại Bàn Khê, hai người tương ngộ. Võ Cát thấy Tử Nha dùng câu thẳng, bèn cười lớn. Tử Nha xem tướng Võ Cát, đoán rằng: “Ngươi hôm nay vào thành sẽ đánh chết người.” Võ Cát nghe xong tức giận bỏ đi, gánh củi vào thành. Sau khi vào thành, Võ Cát va chạm người, vô tình đánh chết thừa tướng của Văn Vương. Văn Vương vẽ đất làm lao, giam giữ Võ Cát. Võ Cát sau được tạm thời phóng thích, để chăm sóc lão mẫu đến thu sau sẽ chịu tử hình. Lão mẫu bảo chàng tìm Khương Tử Nha cầu cứu. Thái Công thu chàng làm đồ đệ, dạy chàng binh pháp, lại lệnh chàng đào hố thi chú hóa giải tiên thiên mệnh vận. Thu sau không thấy Võ Cát đến chịu hình, Văn Vương suy diễn tiên thiên số, tưởng Võ Cát đã sợ tội tự vẫn. Sau Văn Vương gặp Võ Cát, Võ Cát dẫn Văn Vương đến yết kiến Khương Thái Công. Thái Công được phong làm Võ Đức tướng quân. Sư đồ hai người cùng hết lòng phò tá Văn Vương.",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài có, Giao dịch cẩn thận, Hôn nhân thành, Người đi trễ, Điền vụ lợi, Lục súc cẩn thận, Tìm người có tin, Kiện tụng tốt, Di dời theo cũ, Thất vật có, Phong thủy cát"
  },
  {
    "ID": "13",
    "Rank": "TRUNG XĂM",
    "Original": "自小生於富貴家\n眼前萬物總奢華\n蒙君賜紫金角帶\n四海清名定可夸",
    "Transliteration": "Tự tiểu sinh ư phú quí gia\nNhãn tiền vạn vật tổng xa hoa\nMông quân thí thử kim giác đới\nTứ hải thanh danh định khả khoa",
    "Translation": "Tự nhỏ sinh ra tại nhà giàu\nTrước mắt xa hoa quí xiết bao\nChờ ngày ban thưởng vòng đai ngọc\nThanh thơm bốn biển hãy khoe mau",
    "Comment": "Tù nhân được thả, Bệnh tức an nhiên, Qua được long môn, Danh truyền khắp xứ",
    "Divination": "Cửa rồng được thông, Mọi sự đại cát",
    "Reference": "La Thông bái sư",
    "reference_translated": "La Thông bái soái (羅通拜帥)",
    "reference_detail": "Đại Đường triều tổng động viên muốn bình định Bắc Phiên, Đường Thái Tông quyết định ngự giá thân chinh, nhưng bị vây khốn tại Mộc Dương Thành. Bèn do Trình Giảo Kim về Trung Nguyên cầu cứu binh, chẳng may bị binh sĩ Bắc Phiên bắt giữ. Trình Giảo Kim khéo ăn khéo nói, công chúa Đồ Lô của Bắc Phiên bèn đồng ý cho chàng về Trung Nguyên chiêu mộ cứu binh. Trong cuộc thi võ tuyển chọn đại tướng tảo Bắc, La Thông mười bảy tuổi đoạt giải nhất, được phong soái chinh Bắc.",
    "Explanation": "Gia đạo tự thân cầu phúc, Cầu tài thu đông cát, giao dịch cẩn thận, Hôn nhân hợp, Tìm người thấy, Kiện tụng hữu lý, Người đi cầu bảo, Điền vụ lục súc trung bình, Di dời y cựu, Thất vật hướng đông, Bệnh an, Phong thủy cát."
  },
  {
    "ID": "14",
    "Rank": "TRUNG XĂM",
    "Original": "宛如仙鶴出凡籠\n脫得籠凡路路通\n南北東西無阻隔\n任君直上九霄宫",
    "Transliteration": "Uyển như tiên hạc xuất phàm lung\nThoát đắc lung phàm lộ lộ thông\nNam bắc đông tây vô trở cách\nNhậm quân trực thượng cữu tiêu cung",
    "Translation": "Chim hạc giờ đây đã xổ lồng\nLượn bay tung cánh khắp tây đông\nThênh thang trời rộng đâu ngăn trở\nThẳng đường lên đến cữu tiêu cung",
    "Comment": "Tùy ý chẳng lo, Lộ đã hanh thông, Tùy tâm tự tại, Ung dung thanh nhàn",
    "Divination": "Tiên hạc rời lồng, Mọi việc trước khó sau dể",
    "Reference": "Tử Nha từ quan",
    "reference_translated": "Tử Nha từ quan (子牙棄官)",
    "reference_detail": "Khương Tử Nha khi làm tướng số, nhận ra một phụ nhân do Ngọc Thạch Tỳ Bà Tinh biến thành, vì thế bắt nàng không buông, thậm chí dùng nghiên mực đánh nàng. Tể tướng của Trụ Vương là Tỷ Can đi ngang qua, hỏi rõ sự tình nguyên ủy, rồi dẫn Khương Tử Nha đi yết kiến Trụ Vương. Khương Tử Nha trước mặt Trụ Vương dùng Tam Muội Chân Hỏa thiêu Tỳ Bà Tinh hiện nguyên hình. Trụ Vương phong ông làm Hạ Đại Phu. Đắc Kỷ vì báo thù cho Ngọc Thạch Tỳ Bà Tinh, muốn Trụ Vương lệnh Khương Tử Nha xây Lộc Đài. Khương Tử Nha quở trách Trụ Vương, Trụ Vương hạ lệnh giết ông. Khương Tử Nha mượn thủy độn trốn thoát. Về nhà, Khương Tử Nha nói với Mã thị về việc đi Tây Kỳ, Mã thị muốn ly hôn với ông. Thế là, Khương Tử Nha một mình đến Tây Kỳ (kinh đô của Chu Văn Vương). Đến Tây Kỳ, Khương Tử Nha ẩn cư tại khe Bàn Khê câu cá, gặp Chu Văn Vương thiết tha cầu hiền. Dưới sự thành ý thỉnh cầu của Văn Vương, Khương Tử Nha được bái làm thầy, phụ tá Văn Vương.",
    "Explanation": "Gia đạo bất an, Tự thân như nguyện,Cầu tài giao dịch hợp, Người đi gặp, Điền vụ lợi Lục súc tổn, Tìm người trở, Kiện tụng hòa, Di dời cát, Vật thất đông nam, Bệnh thuyên dứt, Phong thủy cát"
  },
  {
    "ID": "15",
    "Rank": "TRUNG XĂM",
    "Original": "行人烈日氣難吞\n忽有事灾勿近前\n鳥破林巢無所宿\n可尋深稳睡安身",
    "Transliteration": "Hành nhân liệt nhật khí nan thôn\nHốt hữu sự tai vật cận tiền\nĐiểu phá lâm sào vô sở túc\nKhả tầm thâm thụy ổn an thân",
    "Translation": "Trời trưa nắng nóng khó người đi\nRơi tổ rừng khô chim ở gì\nTìm nơi an giấc an thân lấy\nSự việc chẳng lành bước tới chi",
    "Comment": "Nếu bị người oán, Lúc nào minh oan, Hảo ngọt chớ tin, Thủ cựu chờ thời",
    "Divination": "Chim tổ rừng sâu, Mọi sự sau như tâm nguyện",
    "Reference": "Tô Tần tỏ chí",
    "reference_translated": "Tô Tần đắc chí (蘇秦得志)",
    "reference_detail": "Thời Chiến Quốc. Tô Tần, người Lạc Dương. Bái Quỷ Cốc Tử làm thầy. Du thuyết Tần Vương, dâng thư mười hai lần, không được chấp nhận. Áo da rách nát, tiền bạc cạn kiệt. Tiều tụy trở về nhà. Về nhà, vợ không để ý đến chàng, chị dâu không nấu cơm. Tô Tần vừa xấu hổ vừa phẫn nộ. Đoạt được sách “Thái Công Âm Phù”, ông phát phẫn khổ đọc. Khi buồn ngủ mệt mỏi thì dùng dùi sắt đâm vào đùi, đau mà tiếp tục đọc. Sau đó, với học thuyết Hợp Tung, ông liên kết sáu nước chống lại Tần. Ông thuyết phục được Triệu Vương, làm tể tướng sáu nước.",
    "Explanation": "Gia đạo tiên hung hậu cát, Tự thân cần phòng, Cầu tài cát, Giao dịch thành, Hôn nhân trở, Người đi thuận, Điền vụ lợi, Lục súc vượng, Tìm người gặp, Kiện tụng có lý, Bệnh như ý nguyện, Vật thất khó tìm, Phong thủy cát."
  },
  {
    "ID": "16",
    "Rank": "TRUNG XĂM",
    "Original": "愁眉思慮暫時開\n啟出雲霄喜自來\n宛如糞土中藏玉\n良工善舉出塵埃",
    "Transliteration": "Sầu mi tư lự tạm thời khai\nKhải xuất vân tiêu hỷ tự lai\nUyển như phấn thổ trung tàng ngọc\nLương công thiện cử xuất trần ai",
    "Translation": "Từ đây bỏ dứt mọi ưu phiền\nSắc màu vui vẻ đến liên miên\nNhư đất bùn kia chôn ngọc quí\nQua tay thợ khéo mãi lưu truyền",
    "Comment": "Chổ được không mất, Trong mất hữu ích, Tiểu nhân gặp ác, Quân tử thuận cát",
    "Divination": "Âm dương hòa hợp, Mọi mưu tính điều tốt",
    "Reference": "Diệp Mộng Hùng chầu vua",
    "reference_translated": "Diệp Mộng Hùng chầu Hoàng Đế (葉夢熊朝帝)",
    "reference_detail": "Diệp Mộng Hùng (1531-1597), tự Nam Triệu, hiệu Long Đường, sau đổi Long Đàm, lại hiệu Hoa Vân. Người Vạn Thạch Phường, phủ thành Huệ Châu (nay thuộc khu Huệ Thành, thị Huệ Châu) đời Minh. Năm Gia Tĩnh thứ 44 (1565) đỗ Tiến sĩ, thụ chức Tri huyện Phúc Thanh. Từng nhậm chức Hộ Bộ Chủ sự, sau đổi làm Sơn Tây Đạo Giám sát Ngự sử.\nVạn Lịch năm thứ 20 (1592), tổng binh Ninh Hạ Bột Bái (thủ lĩnh bộ tộc Thát Đát Mông Cổ) sát hại Tuần phủ Đảng Hinh, liên tiếp chiếm giữ 47 đồn lũy ở Hà Tây. Binh bộ Thượng thư Ngụy Học Tăng công Ninh Hạ lâu ngày không hạ được, Mộng Hùng thay đốc binh phấn chiến, công phá thành trì, Bột Bái tự thiêu mà chết. Mộng Hùng lập công mà không kiêu căng, nhường công cho Học Tăng cùng các tướng sĩ dũng cảm chiến đấu. Nhờ đó, Ngụy Học Tăng được phục chức. Cuối đời, ông năm lần xin từ chức về quê, trở về Huệ Châu xây dựng Hồi Long Tự.\nDiệp Mộng Hùng thuở ban đầu xuất thân văn quan, nổi tiếng liêm khiết tài năng. Cựu sử chí xưng ông “Khiêm năng đệ nhất”, “tẩy trừ thói tham nhũng, diệt trừ phản loạn”, để lại tiếng tốt. Ông trung dũng hơn người, dám đảm đương việc, nhiều trí mưu, giỏi pháo chiến. Nửa cuối đời, ông lấy võ công ghi vào “Minh Sử”, được coi là anh hùng dân tộc.",
    "Explanation": "Gia đạo bất lợi, Tự thân thu đông cát, Cầu tài Giao dịch Hôn sự thành. Người đi tới, Điền vụ cầu bảo, Lục súc bình, Tìm người thấy, Kiện tụng bất lợi, Di dời thủ cựu, Vật thất trở, Bệnh làm phúc, Phong thủy an."
  },
  {
    "ID": "17",
    "Rank": "TRUNG XĂM",
    "Original": "莫聽閑言說是非\n晨昏只好念阿彌\n若将狂話為真實\n畫餅如何止得饑",
    "Transliteration": "Mạc thính nhàn ngôn thuyết thị phi\nThần hôn chỉ hảo khấn Thần Tiên\nNhược tương cuồng thoại vi chân thật\nHọa bỉnh như hà chỉ đắc cơ",
    "Translation": "Nên lo sớm tối khấn Thần Tiên\nBỏ hết ngoài tai chuyện thị phi\nNếu lời điên dảo cho là thật\nNhư ăn bánh vẽ có no gì ?.",
    "Comment": "Tâm trung bất định, Siêng đọc kinh văn, Ví như bánh vẽ, Ăn có được chăng",
    "Divination": "Họa bỉnh sung cơ, mọi việc hư nhiều thật ít.",
    "Reference": "Tào Tháo thoại mai chỉ khát",
    "reference_translated": "Tào Tháo vẽ mơ đỡ khát (曹操話梅止渴)",
    "reference_detail": "Thời Tam Quốc, Tào Tháo lĩnh binh, gặp mùa khô hạn thiếu nước, binh sĩ khát khô cổ. Tào Tháo bèn lừa rằng phía trước có một rừng mơ, đến đó có thể ăn mơ giải khát.\n(Thành ngữ “Vọng mai chỉ khát” – trông mơ giải khát – xuất phát từ điển tích này. Đồng nghĩa với “Họa bính sung cơ” – vẽ bánh chống đói.). (Hoặc giống với con cá gỗ xứ Nghệ)",
    "Explanation": "Gia đạo cầu phúc, Tự thân cầu tài, Giao dịch thuận lợi, Hôn nhân trở, Điền vụ nên sớm Lục súc bất lợi, Người đi trễ, Tìm người gặp, Kiện tụng hòa, Vật thất không thấy, Di dời thủ cựu, Bệnh hoàn nguyện, Phong thủy cát."
  },
  {
    "ID": "18",
    "Rank": "THƯỢNG XĂM",
    "Original": "金鳥墜西兔東升\n日夜循環至古今\n僧道得知無不利\n工商農士各從心",
    "Transliteration": "Kim điểu trụy tây thố đông thăng\nNhật dạ tuần hoàn chí cổ kim\nTăng đạo đắc tri vô bất lợi\nCông thương nông sĩ các tùng tâm",
    "Translation": "Xưa nay nhật nguyệt mãi tuần hoàn\nĐã báo tin vui vạn việc toàn\nCác giới tùy tâm mưu nghiệp lớn\nNgày ngày tâm ý mãi hân hoan",
    "Comment": "Trong lòng yên ổn, Việc làm có công. Như tên trên cung, Bay thẳng lên không",
    "Divination": "Âm dương tiêu trường, Mọi việc toại ý",
    "Reference": "Tào Quốc Cựu thành tiên",
    "reference_translated": "Tào Quốc Cữu thành tiên (曹國舅為仙)",
    "reference_detail": "Tào Quốc Cữu, người Từ Châu, tương truyền là đại quốc cữu thời Tống Nhân Tông, tên Tào Dật, còn gọi là Tào Cảnh Hưu.\nTào Quốc Cữu có một người em tên Tào Nhị. Tào Nhị ỷ thế hoàng quyền, làm đủ mọi điều ác, chiếm đoạt ruộng đất, cướp đoạt vợ con người khác, kết giao với những kẻ bất pháp, ra vào xun xoe. Tào Quốc Cữu rất chướng mắt, khuyên nhủ bằng lời lẽ tốt đẹp không nghe, bèn dùng hình phạt để răn dạy, từ đó hai anh em kết oán thù.\nTào Quốc Cữu nói: “Đạo lý thiên hạ, tích thiện giả xương, tích ác giả vong, đây là chân lý không thể thay đổi. Gia tộc họ Tào ta xưa kia tích âm công mới có phú quý ngày nay. Nay đệ ta tích ác đến cực điểm, dẫu có thoát được hình phạt của triều đình, cũng không thoát khỏi tai họa ngầm do trời giáng xuống. Một khi đại họa ập đến, nhà tan thân mất, lúc đó có muốn chạy cũng không thoát, ta vì đó mà hổ thẹn, cũng vì đó mà sợ hãi.” Thế là, ông đem hết gia tài cứu tế người nghèo, không còn quản chuyện của em trai nữa. Sau đó, từ biệt gia đình bè bạn, khoác áo đạo bào, vào thâm sơn, tu tâm luyện tính.\nMột ngày nọ, ông tình cờ gặp Hán Chung Ly và Lã Động Tân, thấy Tào Quốc Cữu đối đáp lưu loát, rất vui mừng, truyền cho ông “Hoàn Chân Bí Chỉ”, lệnh ông tinh tấn tu luyện. Chẳng bao lâu, được Chung Ly Quyền và Lã Động Tân dẫn vào tiên ban.",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài thuận, Giao dịch thành, Hôn nhân hợp, Người đi cát, Tìm người có, Điền vụ sớm, Lục súc bất lợi, Kiện tụng hữu lý, Vật thất chậm có, Di dời cát, Bệnh khấn vái, Phong thủy đại cát"
  },
  {
    "ID": "19",
    "Rank": "TRUNG XĂM",
    "Original": "急水灘頭放船歸\n風波作浪欲何為\n若要安然求稳静\n等待静安度此危",
    "Transliteration": "Cấp thủy than đầu phóng thuyền qui\nPhong ba tố lãng dục hà vi\nNhược yếu an nhiên cầu ổn tịnh\nĐẳng đải lãng an độ thử nguy",
    "Translation": "Bãi cạn thuyền về sóng lớp cao\nGió dông gềnh đá biết thế nào\nĐợi ngày yên lặng qua cơn hiểm\nXuôi về quê cũ thẳng đường mau",
    "Comment": "Thuyền gặp nước xiết, Chổ hiểm đợi thời. Mưu tính việc gì, Có thể thực thi",
    "Divination": "Thuyền gặp bãi cạn, Mọi việc giử cũ đợi thời",
    "Reference": "Quách Tử Nghi phong vương",
    "reference_translated": "Tử Nghi phong vương (子儀封王)",
    "reference_detail": "Quách Tử Nghi (697-781), còn gọi Quách Lệnh Công, người Trịnh Huyện, Hoa Châu (nay là Hoa Huyện, Thiểm Tây), là danh tướng đời Đường.\nThiên Bảo năm thứ 14 (755), khi An Sử chi loạn nổ ra, ông được phong Sóc Phương Tiết độ sứ (Linh Vũ, nay ở phía tây Linh Vũ, Ninh Hạ), phụng chiếu thảo phạt, liên kết quân Sóc Phương của Lý Quang Bật chia binh tiến vào Hà Bắc, hội sư Thường Sơn (nay là Chính Định, Hà Bắc), đánh bại Sử Tư Minh, thu phục Hà Bắc. Lúc này, Quách Tử Nghi kiến nghị Hoàng đế bắc tiến chiếm Phạm Dương, thẳng vào hang ổ phản quân, để giảm bớt vây hãm Đồng Quan, nhưng Huyền Tông không cho phép. Từ đó gieo mầm cho cục diện phiên trấn cát cứ cuối Đường, cũng trở thành nguyên nhân xa của sự diệt vong nhà Đường.\nThiên Bảo năm thứ 15 (756) cùng liên quân Hồi Hột bình định Hà Khúc, mùa xuân năm sau thu phục Hà Đông (nay là Vĩnh Tế, Sơn Tây), Phùng Dực (nay là Đại Lệ, Thiểm Tây), và tiến công Đồng Quan, đại bại Thôi Càn Hữu, quân Đường chết và bị thương hơn vạn người. Thôi Càn Hữu thối thủ Bồ Tân. An Lộc Sơn bị con trai An Khánh Tự sát hại.\nChí Đức năm thứ 2 (757), phụng chiếu dẫn binh đến Phượng Tường, trên đường ở Bạch Cừ Lưu Vận Kiều (nay ở đông nam Tam Nguyên) đánh bại 5000 kỵ binh sắt của Lý Quy Nhân. Tháng Năm, cùng An Thủ Trung, Lý Quy Nhân giao chiến ở Thanh Cừ (nay ở phía tây Tây An) thất lợi, lui về giữ Võ Công (nay ở tây bắc Võ Công). Tháng Chín, cùng nguyên soái Quảng Bình Vương Lý Thúc suất 15 vạn quân Đường và Hồi Hột hợp binh, tái chiến với An Thủ Trung, Lý Quy Nhân ở phía bắc chùa Hương Tích (nay ở tây nam Trường An Huyện), quân Hồi Hột vòng ra phía sau địch, tiền hậu giáp kích, giết 6 vạn quân địch. Trương Thông Nho chạy về Thiểm Quận, cuối cùng thu phục kinh đô Trường An (nay là Tây An), uy nghi quân Đường một lần nữa lại hiển hiện ở Trường An.\nSau đó, quân Đường thừa thắng đông tiến, tại Tân Điếm (nay ở tây nam Tam Môn Hiệp Thị, Hà Nam) đại bại 15 vạn quân của Nghiêm Trang, Trương Thông Nho và các tướng khác, buộc An Khánh Tự vượt Hoàng Hà, rút về Tương Châu. Đông Quận Lạc Dương được phục hồi. Nhờ công lao, ông được gia chức Tư Đồ, phong Đại Quốc Công.\nSử Tư Minh từ Phạm Dương dẫn quân cứu An Khánh Tự, hai bên đại chiến ở bờ bắc sông An Dương (nay ở phía bắc An Dương), bày trận giao chiến, chém giết khó phân thắng bại. Cuối cùng, quân Đường gồm chín tiết độ sứ, xưng là 60 vạn người, bị tan rã (Trận Nghiệp Thành). Người chỉ huy chính trong trận này là hoạn quan Ngư Triều Ân, ông ta không có tài lãnh đạo, và đổ lỗi thất bại cho Quách Tử Nghi. Quách Tử Nghi bị triệu về Trường An, bãi bỏ binh quyền, giữ chức quan nhàn rỗi.\nBảo Ứng nguyên niên (762), quân binh Thái Nguyên (nay ở tây nam Thái Nguyên), Giáng Châu (nay là Tân Giáng, Sơn Tây) nổi loạn, triều đình kinh sợ, phong Tử Nghi làm Phần Dương Vương, ra trấn Giáng Châu. Lại bị hoạn quan Trình Nguyên Chấn ly gián, lại bị tước bỏ binh quyền.\n(Trọng điểm câu chuyện này: Quách Tử Nghi tài năng xuất chúng và phẩm hạnh cao đẹp, gặp phải Huyền Tông và một số kẻ tiểu nhân, khiến công lao hiển hách bị giảm sút nhiều.)",
    "Explanation": "Gia đạo, Tự thân làm phúc. Cầu tài Giao dịch chưa thành, Hôn nhân chưa tựu, Người đi tới, Điền vụ cát, Lục súc tổn, Tìm người khó, Kiện dung hòa, Di dời thủ cựu, Vật thất khó tìm, Bệnh cầu phúc, Phong thủy cát."
  },
  {
    "ID": "20",
    "Rank": "TRUNG XĂM",
    "Original": "當春久雨喜開晴\n兔玉鳥金漸漸明\n舊事散消新事遂\n看看ㄧ跳過龍亭\nĐương xuân cữu vũ hỷ khai tinh\nNgọc thố điểu kim tiệm tiệm sinh\nCựu sự tán tiêu tân sự toại\nKhán khan nhất khiếu quá long đình\nDịch\nĐương xuân mưa dứt cảnh vui tươi\nTrời tỏ trăng trong dần sáng ngời\nChuyện cũ qua đitin mới đến\nNhư cá hóa rồng toại ý người\nLời Bàn\nThần Thánh hộ trì, Vượt khỏi tai nguy, Bình\nsinh toại chí, Sau sẽ vinh quy\nĐiềm quẻ ứng\nCữu vũ sơ tình, Mọi việc sau như ý\nTích Cổ : Khương thái Công ngộ Văn Vương\n\n\nGiải\nGia đạo trung bình, Tự thân cầu phúc, Cầu tài\nchưa có, Giao dịch đợi thời,\nHôn nhân tùy ý, Điền vụ lục súc trở, Tìm người\ntrễ, Vật thất có, Bệnh cầu bảo",
    "Transliteration": "",
    "Translation": "Đương xuân mưa dứt cảnh vui tươi\nTrời tỏ trăng trong dần sáng ngời\nChuyện cũ qua đitin mới đến\nNhư cá hóa rồng toại ý người",
    "Comment": "Thần Thánh hộ trì, Vượt khỏi tai nguy, Bình sinh toại chí, Sau sẽ vinh quy",
    "Divination": "Cữu vũ sơ tình, Mọi việc sau như ý",
    "Reference": "Khương Thái Công ngộ Văn Vương",
    "reference_translated": "Khương Thái Công ngộ Văn Vương (姜太公遇文王)",
    "reference_detail": "Thời Chu triều. Khương Thượng, tự Tử Nha. Người Cấp (người Hứa Châu, Đông Hải). Đạo hiệu Phi Hùng, tổ tiên ông được phong ở Lã (địa danh) nên ông còn có tên là Lã Vọng.\nTránh loạn thế của Trụ Vương nhà Thương, ông ở bên bờ biển Đông Hải, câu cá tại Bàn Khê (sông Vị Thủy). Lưỡi câu thẳng, tâm ý ông không ở việc câu cá, mà muốn làm tể tướng cho minh quân.\nChu Văn Vương nghe nói ông hiền minh, mời ông làm thầy (Tể tướng). (Khi ấy, ông đã 80 tuổi). Sau Chu Võ Vương thảo phạt Trụ Vương, diệt nhà Thương, lập nhà Chu. Võ Vương xưng ông là Thượng Phụ. Phong con trai ông là Đinh Công làm Tề hầu.\n(Trọng điểm câu chuyện này: Khương Thái Công kiên nhẫn câu cá ở sông Vị Thủy, cuối cùng thoát khỏi cảnh khốn cùng, được Văn Vương trọng dụng.)",
    "Explanation": "Gia đạo trung bình, Tự thân cầu phúc, Cầu tài chưa có, Giao dịch đợi thời, Hôn nhân tùy ý, Điền vụ lục súc trở, Tìm người trễ, Vật thất có, Bệnh cầu bảo"
  },
  {
    "ID": "21",
    "Rank": "THƯỢNG XĂM",
    "Original": "陰陽道合總由天\n女嫁男婚喜自然\n但見龍蛇相會合\n熊羆入夢樂團圓",
    "Transliteration": "Âm dương đạo hợp tổng do thiên\nNữ giá nam hôn hỷ tự nhiên\nĐản kiến long xà tương hội họp\nHùng bi nhập mộng lạc đoàn viên",
    "Translation": "Âm dương trời định mối duyên nồng\nTrai thời cưới vợ gái theo chồng\nNhư thể rồng mây tương hội họp\nNằm mơ thấy gấu cả nhà vui",
    "Comment": "Mưu vọng tùy tâm, Hôn nhân hòa hợp. Tài lộc tiến tới, Càng lợi điền viên Điềm qủe ứng Âm dương đạo hợp, Mọi việc đại cát Tích Cổ : Lý Đán long phụng phối hợp Giải Gia đạo an, Tự thân lợi, Cầu tài có, Giao dịch thành, Hôn nhân hợp, Người đi tới, Điền vụ lục súc hưng vượng, Tìm người thấy, Kiện tụng có lý, Di dời xương thịnh, Vật thất có, Bệnh thuốc tốt, Phong thủy cát",
    "Divination": "Âm dương đạo hợp, mọi việc đại cát",
    "Reference": "Lý Đán long phụng phối hợp",
    "reference_translated": "Lý Đán Long Phụng Phối Hợp (李旦龍鳳配合)",
    "reference_detail": "Lý Đán, tức Đường Duệ Tông, khi Võ Tắc Thiên đăng cơ, bị giáng làm thứ dân, lưu lạc hương dã. Ngẫu nhiên gặp gỡ Hồ Phụng Kiều, kết thành phu thê. Dân gian truyền thuyết, nhị nhân thủ trung giai hữu bán phương ấn, xuất tự thai đái, kinh “Đấu ấn” chứng minh khả hợp nhất, do thị kết vi phu phụ.",
    "Explanation": "Gia đạo an, Tự thân lợi, Cầu tài có, Giao dịch thành, Hôn nhân hợp, Người đi tới, Điền vụ lục súc hưng vượng, Tìm người thấy, Kiện tụng có lý, Di dời xương thịnh, Vật thất có, Bệnh thuốc tốt, Phong thủy cát"
  },
  {
    "ID": "22",
    "Rank": "TRUNG XĂM",
    "Original": "旱時田里皆枯槁\n謝天甘雨落淋淋\n草木果花皆潤澤\n始知ㄧ雨直千金",
    "Transliteration": "Hạn thời điền lý giai cô cảo\nTạ thiên cam vũ lạc lâm lâm\nThảo mộc quả hoa giai nhuận trạch\nThủy tri nhất vũ trực thiên kim",
    "Translation": "Hạn lâu vườn ruộng quá khô khan\nTrời ban mưa lớn sấm rền vang\nHoa lá cỏ cây xanh sắc thắm\nMưa rơi đúng lúc đáng ngàn vàng",
    "Comment": "Ruộng vườn bội thu, Vận mệnh đã tới. Bệnh gặp thuốc hay, Người đi đến đích",
    "Divination": "Hạn gặp mưa rào, Gặp khó có người giúp",
    "Reference": "Lục Lang được cứu",
    "reference_translated": "Lục Lang được cứu (六郎逢救)",
    "reference_detail": "Dương Diên Chiêu, tức Dương Lục Lang, là lục tử của Dương Nghiệp. Dương Nghiệp thống suất tam quân, bị quân phiên vây khốn, đầu tráng Lý Lăng bia nhi tử. Dương Thất Lang cầu viện bị tiễn xạ tử, Lục Lang triệt thoái chí Hồ Lô Cốc. Đắc Ngũ Đài Sơn hòa thượng (tức Dương Ngũ Lang) tương cứu, thoát ly hiểm cảnh.",
    "Explanation": "Gia đạo cầu an, Tự thân an, Cầu tài đại cát, Giao dịch trở, Hôn nhân hợp, Người đi trở ngại, Điền vụ lục súc lợi, Tìm người khó, Kiện tụng thua, Di dời y cựu, Vật thất hướng tây, Bệnh thuyên giảm, Phong thủy an cát."
  },
  {
    "ID": "23",
    "Rank": "TRUNG XĂM",
    "Original": "桂仙欲扳入蟾宮\n豈慮天門不任君\n忽遇一般音信好\n皆笑人人領頂花",
    "Transliteration": "Quế tiên dục bản nhập thiềm cung\nKhỉ lự thiên môn bất nhậm quân\nHốt ngộ nhất ban âm tín hảo\nGiai tiếu nhân nhân lĩnh đỉnh hoa",
    "Translation": "Ước mơ quẻ quế quảng hàn cung\nCửa trời diệu vợi nghĩ mông lung\nBỗng có tin vui liền báo đến\nLẵng hoa tươi đẹp thưởng trùng trùng",
    "Comment": "Thương mại đại lợi, Làm việc khỏi nguy. Bệnh khỏi Kiện thắng, Việc chi cũng được",
    "Divination": "Thủ bản tiên quế, Mọi việc có quí nhân giúp",
    "Reference": "Hoài Đức cầu thân",
    "reference_translated": "Hoài Đức cầu thân (懷德招親)",
    "reference_detail": "Cao Hoài Đức, tự Tàng Dụng, người Chân Định Thường Sơn. Tại “Trần Kiều binh biến”, Cao Hoài Đức ủng hộ Triệu Khuông Dận vi hoàng đế, toại thăng Điện Tiền Phó Đô Điểm Kiểm. Cao Hoài Đức hựu thú Tống Thái Tổ Triệu Khuông Dận chi muội vi thê. (Triệu Khuông Dận hữu nhị muội, nhất dĩ yểu thệ, truy phong Trần Quốc Trưởng Công Chúa; nhất tằng dữ Mễ Phúc Đức kết hôn, phu vong quả cư, Triệu Khuông Dận phong vi Yến Quốc Trưởng Công Chúa). Quan phong Phò Mã Đô Úy.",
    "Explanation": "Gia đạo thiếu an, Tự thân làm phúc, Cầu tài toại ý, Giao dịch hợp, Hôn nhân trở, Người đi nguy, Điền vụ lục súc bất lợi, Tìm người khó, Kiện tụng thua, Di dời thiếu cát lợi, Bệnh an, Phong thủy tựu cát."
  },
  {
    "ID": "24",
    "Rank": "HẠ XĂM",
    "Original": "不成論理不成家\n水性痴人似落花\n若問君思須得力\n到頭方見事如麻",
    "Transliteration": "Bất thành luận lý bất thành gia\nThủy tính si nhân tự lạc hoa\nNhược vấn quân ân tu đắc lực\nĐáo đầu phương kiến sự như ma",
    "Translation": "Người đần bơi nước tựa hoa rơi\nCửa nhà chẳng thiết chạy muôn nơi\nNếu người có ý trao luân lý\nTừ đây thêm khó rối tơi bời",
    "Comment": "Đừng nói phải trái, Cần nên kỷ lưởng. Lòng ngay lẽ thẳng, mới khỏi tai nguy",
    "Divination": "Người khùng cản lối, Mọi việc nên chờ thời",
    "Reference": "Ân Giao ngộ sư",
    "reference_translated": "Ân Giao ngộ sư (殷郊遇師)",
    "reference_detail": "Ân Giao, là Thương Trụ Vương chi tử, bái Quảng Thành Tử vi sư. Tam niên hậu, học đắc pháp thuật, hạ sơn thì tằng hướng Quảng Thành Tử tuyên thệ, bất bang Trụ Vương can phôi sự, vãng đầu kháo Văn Vương. Bán đồ thụ nhân xúi giục hồi gia hiệp trợ Trụ Vương. Sư phụ vãng khuyên, sư đồ đại đả xuất thủ. Hậu lai Khương Tử Nha dữ Nhiên Đăng Đạo Nhân, bả Ân Giao giáp ư lưỡng sơn chi gian, bị Quảng Thành Tử sạn tử. Hồi ứng kì sở phát chi thệ ngôn.",
    "Explanation": "Gia đạo bất an, Tự thân nguy hiểm, Cầu tài trở, Giao dịch khó, Hôn nhân đợi thời, Diền vụ lục súc đa tai, Người đi khó, tìm người trở ngại, Kiện tụng thua, Di dời cát, Bệnh cầu thần, Vật thất khó tìm, Phong thủy xấu."
  },
  {
    "ID": "25",
    "Rank": "THƯỢNG XĂM",
    "Original": "過了憂危事幾重\n從今在立永無空\n寛心自有寛心計\n得遇高人立大功",
    "Transliteration": "Quá liễu ưu nguy sự kỷ trùng\nTùng kim tái lập vĩnh vô không\nKhoan tâm tự hữu khoan tâm kế\nĐắc ngộ cao nhân lập đại công",
    "Translation": "Qua rồi ngày tháng âu lo ấy\nTái lập tiền đồ phát tự đây\nAn dạ rộng đường toan tính kế\nGặp được cao nhân sự nghiệp đầy",
    "Comment": "Việc kiện hữu lý, Bệnh được an toàn. Ra vào mưu tính, Giếng cũ nước tràn",
    "Divination": "Giếng cũ đầy nước, Việc quí nhân giúp mới thành",
    "Reference": "Diêu Sùng diệt châu chấu",
    "reference_translated": "Diêu Sùng diệt châu chấu (姚崇治蝗)",
    "reference_detail": "Diêu Sùng (649-721), tên thật là Nguyên Sùng, người Thiểm Châu, từng giữ các chức vụ như Hạ quan Thị lang, Xuân quan Thượng thư, Tử Vi lệnh, Trung thư lệnh, Tể tướng triều Đường. Năm Khai Nguyên thứ tư (716), vùng Sơn Đông (chỉ chung vùng lưu vực sông Hoàng Hà phía đông Hoa Sơn) nạn châu chấu thành tai họa, người dân bị tư tưởng mê tín trói buộc, không dám bắt giết, mà lập bàn thờ cúng tế, thắp hương, bái lạy bên ruộng, ngồi nhìn hoa màu bị châu chấu nuốt chửng. Trăm quan đều cho rằng: \"Châu chấu là thiên tai, sao có thể dùng sức người mà chế ngự!\", việc nên diệt trừ hay không diệt trừ, lúc bấy giờ sự đấu tranh giữa hai quan niệm khác nhau diễn ra vô cùng quyết liệt. Diêu Sùng nói: \"Chỉ cần đồng lòng hiệp lực thì có thể trừ sạch. Ông nói: Châu chấu sợ người nên dễ xua đuổi. Hoa màu có chủ nên người cứu hộ nhất định sẽ dốc sức; châu chấu biết bay, đêm thấy lửa tất sẽ bay đến; đặt lửa trên ruộng, cạnh lửa đào hố, vừa đốt vừa chôn, chắc chắn sẽ diệt sạch.\" Huyền Tông nói: \"Châu chấu là thiên tai, là do đức chính không tu sửa mà ra, ngươi yêu cầu bắt giết, chẳng phải là làm trái đạo sao?\" Diêu Sùng lại nói: \"Việc bắt giết châu chấu, người xưa đã làm trước, bệ hạ thực hiện theo sau, yên nông trừ hại là việc đại sự của quốc gia, xin bệ hạ nghiêm túc cân nhắc.\" Huyền Tông bị thuyết phục. Nhưng bấy giờ cả trong lẫn ngoài triều đình đều nói châu chấu không thể bắt giết. Huyền Tông nói: \"Ta cùng Tể tướng thảo luận, đã định xong việc bắt châu chấu, ai còn phản đối sẽ bị xử tử ngay.\" Thế là phái Ngự sử chia các ngả đốc thúc, chỉ huy người dân đốt và chôn châu chấu. Kết quả mang lại hiệu quả rõ rệt, toàn quốc bắt được 9 triệu thạch châu chấu, thành công ngăn chặn nạn châu chấu, năm đó nông nghiệp đạt được mùa màng khá tốt.",
    "Explanation": "Gia đạo trung bình, Tự thân cầu tài, Giao dịch trở ngại, Hôn nhân hòa hợp, Kiện tụng hữu lý,Người đi, tìm người trở, Điền vụ lục súc bất lợi, Di dời xấu, Vật thất khó tìm, Bệnh cầu phúc, Phong thủy bất an"
  },
  {
    "ID": "26",
    "Rank": "TRUNG XĂM",
    "Original": "上下傳來事轉虚\n天邊接得ㄧ封書\n書中許我功名遂\n直到終時亦是虚",
    "Transliteration": "Thượng hạ truyền lai sự chuyễn hư\nThiên biên tiếp đắc nhất phong thư\nThư trung hứa ngã công danh toại\nTrực đáo trung thời diệc thị hư",
    "Translation": "Sau trước có tin tới rất nhanh\nMột phong thư viết rỏ rành rành\nHứa rằng mai được công danh toại\nLời kia cuối lại chỉ hư danh",
    "Comment": "Trên dưới phiền lòng, Cầu nhàn bất nhàn. Muốn có công danh, An thân thủ phận",
    "Divination": "Hư danh, Việc hư nhiều thật ít, Thủ phận là tốt",
    "Reference": "Chung Ly đắc đạo",
    "reference_translated": "Chung Quỳ đắc đạo (鍾馗得道)",
    "reference_detail": "Chung Quỳ, họ Chung tên Quỳ, tự Chính Nam, người Trung Nam Sơn. Đời Đường Đức Tông, Chung Quỳ tham gia khoa cử, xem đề xong liền nhất khí hạ bút, hoàn thành văn chương nộp lên. Quan chủ khảo bấy giờ là Thị lang Lại bộ Hàn Dũ, phó chủ khảo là Đại học sĩ Lục Chi. Hai người xem quyển của Chung Quỳ, không khỏi sáng mắt, đồng thanh khen rằng: “Kỳ tài, kỳ tài! Văn chương này chữ chữ châu ngọc, có thể nối Lý Thái Bạch, Đỗ Tử Mỹ sau này!” Bèn chấm Chung Quỳ đỗ đầu. Đức Tông Hoàng đế nghe Hàn Dũ tấu bẩm, nói Tân khoa Trạng nguyên Chung Quỳ tài hoa xuất chúng, liền triệu kiến Chung Quỳ trên Kim điện. Đức Tông vừa trông thấy tướng mạo ông xấu xí, lập tức trong lòng không vui nói: “Triều ta kén sĩ, toàn do thân, ngôn, thư, phán, người xấu xí như thế này, làm sao có thể chấm làm Kim khoa Trạng nguyên?” Hàn Dũ vội vàng quỳ tấu: “Người hơn kém, không hề ở tướng mạo, Thánh chủ há chẳng nghe Yến Anh cao ba thước mà làm tướng nước Tề, Chu Xương nói lắp mà phò Hán, Khổng Tử lấy tướng mạo mà nhận người, sai lầm Tử Vũ, vạn mong Bệ hạ tam tư.” Đức Tông Hoàng đế trầm ngâm chốc lát nói: “Lời của Hàn Ái khanh tuy có lý, nhưng triều ta thời Thái Tông Đế, từng có mỹ đàm Mười tám Học sĩ đăng Doanh Châu, người này làm Trạng nguyên, e rằng thế nhân cười Trẫm không biết nhận nhân tài vậy.” Tể tướng Lô Khải lòng dạ hẹp hòi, ghen ghét hiền tài, nghe lời Hoàng thượng, vội quỳ tấu: “Kim khoa Trạng nguyên cần nội ngoại kiêm tu, khoa thi này ba trăm người, há thiếu gì người, sao không chọn người khác?” Chung Quỳ thấy người này hồ đồ như vậy, không khỏi giận tóc đứng ngược, chỉ Lô Khải mắng lớn: “Hôn quan như thế này ở triều, há chẳng làm lầm nước?” Nói đoạn, vung quyền đánh Lô Khải. Đức Tông thấy vậy, đại nộ nói: “Cử tử lớn mật, dám đại náo Kim điện, mau mau bắt lấy!” Chung Quỳ trong cơn thịnh nộ, thuận tay rút bảo kiếm nơi thắt lưng của tướng đứng hầu, lớn tiếng than: “Mèo thất thế khó học hổ, vẹt xơ xác chẳng bằng gà.” Nói đoạn, tự vẫn mà chết. Đức Tông thấy Chung Quỳ một cơn giận dữ lại tự vẫn mà chết, rất đỗi kinh ngạc, để lung lạc lòng dân, Ngài hạ chiếu ban táng Chung Quỳ theo quan chức Trạng nguyên, lại phong Chung Quỳ làm Thần Trừ ma, để diệt trừ tà ma nhân gian.",
    "Explanation": "Gia đạo cầu phúc, Tự thân an, Cầu tài trở, Giao dịch hôn nhân bất thành, Người đi có, Điền vụ trung bình, Lục súc nuôi tốt, Tìm người hướng tây, Kiện tụng thua, Di dời thủ cựu, Vật thất khó tìm, Bệnh cầu khấn, Phong thủy cát"
  },
  {
    "ID": "27",
    "Rank": "TRUNG XĂM",
    "Original": "ㄧ謀ㄧ用ㄧ番書\n不敢為前慮後思\n時到貴人相助力\n如山墻立可安居",
    "Transliteration": "Nhất mưu nhất dụng nhất phiên thư\nBất cãm vi tiền lự hậu tư\nThời đáo quí nhân tương trợ lực\nNhư sơn tường lập khả an cư",
    "Translation": "Một quyển sách dầy nghĩ dụng mưu\nKhông dám tiến hành bởi rối mù\nThời tới quí nhân ra giúp sức\nVựa tường núi chắc dễ an cư",
    "Comment": "Đổi cũ thành mới, Hoa lạnh gặp xuân. Trước thì trì trệ, Nay được thanh tâm",
    "Divination": "Nhà tốt tường vững, Việc phải ổn thân mà làm, mới không nguy hiểm",
    "Reference": "Lưu Cơ can chủ (劉基諫主)",
    "reference_translated": "Lưu Bá Ôn can chủ (劉基諫主)",
    "reference_detail": "Đời Minh, Lưu Cơ, tự Bá Ôn, thụy hiệu Văn Thành, người Thanh Điền, Chiết Giang (nay là huyện Văn Thành). Đọc thông kinh sử, giỏi làm thơ văn. Cũng rất tinh thông thiên văn binh pháp, giúp Chu Nguyên Chương thống nhất thiên hạ. Bấy giờ Chu Nguyên Chương tuyển chọn binh lính, dẫn quân đến An Phong, muốn giải vây thành An Phong đang bị bao vây. Lưu Cơ vội vàng đến can ngăn, phán đoán chuyến đi này ắt bại. Quả nhiên đúng như Lưu Cơ dự liệu, Chu Nguyên Chương bị vây khốn. Các tướng quân Từ Đạt và Thường Ngộ Xuân đến cứu, Chu Nguyên Chương mới thoát hiểm.",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài có, giao dịch khó, Hôn nhân trở, Người đi trễ, Tìm người khó Điền vụ được, Lục súc lợi, Kiện tụng hòa, Di dời cát, Vật thất khó tìm, Bệnh thuyên giảm, Phong thủy y cựu đại cát."
  },
  {
    "ID": "28",
    "Rank": "HẠ XĂM",
    "Original": "東邊月上正嬋娟\n頃刻雲遮亦暗暈\n或有圓時還有缺\n更言非者亦閑言",
    "Transliteration": "Đông biên nguyệt thượng chính thuyền quyên\nKhoảnh khắc vân già diệc ám hôn\nHoạt hữu viên thời hoàn hữu khuyết\nCánh ngôn phi giả diệc nhàn ngôn",
    "Translation": "Trăng lên trong sáng ở phương đông\nBỗng mây che khuất tối mênh mông\nTrăng có khi tròn rồi lại khuyết\nNói lời sai trái cũng bằng không",
    "Comment": "Trăng bị mây che, Không nên nghi hoặt. Chờ lúc mây tan, Tức thì sáng tỏ",
    "Divination": "Trăng bị mây che, Mọi việc mịch mờ chưa định",
    "Reference": "Lý Hậu tìm Bao Công",
    "reference_translated": "Bao Công tìm Lý Hậu (包公尋李后)",
    "reference_detail": "Vào đời Tống Chân Tông, Lý Hậu (Lý nương nương) là cung nữ trong hậu cung, được Tống Chân Tông sủng ái mà thăng làm Uyển Nghi, rồi mang long thai. Nhưng lúc đó Lưu Đức Phi, tức là Lưu Hoàng Hậu sau này, nảy sinh ác niệm, mua chuộc thái giám Quách Hòe, đem con của Lý nương nương đổi thành con mèo lột da, cướp đoạt con trai của bà rồi tâu với Hoàng đế là con ruột của mình. Tống Chân Tông một cơn giận dữ liền đánh Lý nương nương vào lãnh cung. Đức Phi thăng làm Hoàng Hậu sau đó toan giết Lý nương nương, Lý nương nương thoát khỏi cung. Một ngày nọ, Lý nương nương lưu lạc đường phố, gặp Khâm sai đại nhân Bao Chửng đang tuần tra địa phương, bèn kể về thân thế của mình, là sinh mẫu của đương kim Hoàng đế Tống Nhân Tông. Bao Chửng biết được chuyện này, liền đưa Lý nương nương về kinh, tâu lên Tống Nhân Tông và điều tra làm rõ sự việc. Cuối cùng, mẹ con nhận nhau. Lưu Thái Hậu và Tổng quản thái giám Quách Hòe cúi đầu nhận tội.",
    "Explanation": "Gia đạo bất an, Tự thân cầu khấn, Cầu tài trở, Giao dịch cát, Người đi trễ, Điền vụ lục súc bất lợi, Hôn nhân không hợp, Tìm người khó, Kiện tụng thua, Di dời y cựu, Vật thất hướng tây, Bệnh khó, Phong thủy thay đổi."
  },
  {
    "ID": "29",
    "Rank": "TRUNG XĂM",
    "Original": "寳劍出匣耀光明\n在匣己然不惹塵\n今得貴人携出現\n有威有勢衆人欽",
    "Transliteration": "Bảo kiếm xuất hạp diệu quang minh\nTại hạp dĩ nhiên bất nhạ trần\nKim đắc quí nhân đề xuất hiện\nHữu uy hữu thế chúng nhân khâm",
    "Translation": "Kiếm trong tráp đâu ai biết quí\nTuốt ra ngoài tỏa sáng uy nghi\nNay được cao nhân thi triển tốt\nAnh hùng trên thế có ai bì",
    "Comment": "Kiếm ra khởi tráp, Hào quang vạn lý. Qúi nhân chỉ dẫn, Xinh đẹp vô cùng",
    "Divination": "Bảo kiếm ra tráp, Mọi việc có uy thế",
    "Reference": "Triệu Tử Long cứu A Đẩu",
    "reference_translated": "Triệu Tử Long cứu A Đẩu (趙子龍救阿斗)",
    "reference_detail": "Thời Tam Quốc, Triệu Vân, tự Tử Long, người Thường Sơn. Ban đầu nương tựa Viên Thiệu, sau theo Lưu Bị, Tiên Chủ Tây Thục. Bấy giờ Tào Tháo muốn hạ Giang Nam, trước tiên tấn công Tiên Chủ Lưu Bị ở Tân Dã, Tiên Chủ chạy đến Phàn Thành. Lại bị đánh bại ở Đương Dương, gia quyến ly tán, Triệu Vân gặp Mị phu nhân (phu nhân của Lưu Bị) dưới bức tường đổ. Phu nhân giao con trai A Đẩu (con của Lưu Bị tức Lưu Thiện) cho Triệu Vân, Triệu Vân đưa ngựa cho phu nhân, phu nhân không chịu nhận, bèn nhảy giếng tự vẫn. Triệu Vân khóc lóc chôn cất phu nhân xong, ôm A Đẩu, phá vòng vây mà ra.",
    "Explanation": "Gia đạo cầu phúc, Tự thân cát, Cầu tài lợi, Giao dịch thành, Hôn nhân các, Người đi trễ, Điền vụ có, Lục súc tổn, Tìm người thấy, Kiện tụng hòa, Di dời hưng vượng, Vật thất hướng nam, Bệnh như nguyện, Phong thủy cát."
  },
  {
    "ID": "30",
    "Rank": "TRUNG XĂM",
    "Original": "勸君切勿向他求\n似鶴飛來暗箭頭\n惹去採薪蛇在草\n恐遭毒口也憂愁",
    "Transliteration": "Khuyến quân thiết vật hướng tha cầu\nTự hạc phi lai ám tiễn đầu\nNhạ khứ thải tân xà tại thảo\nKhủng tao độc khẩu dã ưu sầu",
    "Translation": "Khuyên ai đừng nghĩ tới mà hay\nNhư thân chim hạc cản tên bay\nRắn ẩn lối đi khi nhặc cũi\nChạm rồi nọc độc sẽ bi ai",
    "Comment": "Cắn răng ngậm miệng, Đừng nghĩ việc chi. Làm trái lương tâm, Tự hại đến mình",
    "Divination": "An phận thủ kỷ, Mọi việc cẩn thận phòng bị",
    "Reference": "Kỳ Bàn đại hội (棋盤大會)",
    "reference_translated": "Kỳ Bàn đại hội (棋盤大會)",
    "reference_detail": "Đường Thái Tông ngự giá chinh Tây, bị vây khốn tại Tỏa Dương Thành, Trình Giảo Kim về kinh cầu viện binh. Tiết Đinh Sơn phụng mệnh đảm nhiệm Nhị Lộ Nguyên Soái, đến cứu giá hộ chủ, bình định Tây Liêu. Đoàn người ngựa ra khỏi Ngọc Môn Quan, đến Kỳ Bàn Sơn. Bị hàng ngàn lâu la trên núi vây khốn, Sơn đại vương Đậu Nhất Hổ không địch lại Đường tướng La Thông, may nhờ muội muội y là Đậu Tiên Đồng vốn là đệ tử của Hoàng Hoa Thánh Mẫu, tinh thông võ nghệ, tay cầm Khổn Tiên Thằng, phản lại trói La Thông, Tiết Đinh Sơn tự mình suất lĩnh tinh binh cũng bị vây khốn. Đậu Tiên Đồng thấy Tiết Đinh Sơn tuấn mỹ, muốn kết duyên cầm sắt, Tiết Đinh Sơn không thuận theo, Đậu Tiên Đồng nổi giận muốn đẩy ra chém đầu, may nhờ Trình Giảo Kim kịp thời đến giải nguy, rồi tác thành hôn sự của hai người. Sau đó Đậu Nhất Hổ cũng dẫn huynh đệ Kỳ Bàn Sơn quy thuận nhà Đường, giúp nhà Đường công phá Tây Liêu.",
    "Explanation": "Gia đạo an, Tự thân bình, Cầu tài đợi thời, Giao dịch trễ, Hôn nhân chậm hứa, Người đi tìm người trở, Lục giáp lo, Lục súc điền vụ bất lợi, Di dời thủ cựu, Vật thất khó tìm, Bệnh khó, Phong thủy đại cát."
  },
  {
    "ID": "31",
    "Rank": "TRUNG XĂM",
    "Original": "清静無憂坐處閒\n泣下身心不用忙\n飽后吃茶時坐卧\n必定不招怨與嘆",
    "Transliteration": "Thanh tịnh vô ưu tọa xứ nhàn\nKhất hạ thân tâm bất dụng mang\nBảo hậu ngật trà thời tọa ngọa\nTất định bất chiêu oán dử than",
    "Translation": "Cơm nước đủ đầy cứ thảnh thơi\nNằm ngồi mặc ý mãi vui tươi\nOán hận họa tai nên khéo tránh\nAn ổn thân tâm hãy đợi thời",
    "Comment": "Thủ Cựu an tâm, Khấn hỏi tiên thần, Đợi khi thời tới, Sự việc ngẩu nhiên",
    "Divination": "Thủ cựu an nhiên, Mọi việc đợi thời, sau mới tốt tươi",
    "Reference": "Sư Thánh Ấn hội Đông pha",
    "reference_translated": "Phật Ấn hội Đông Pha (佛印會東坡)",
    "reference_detail": "Có một dạo, Tô Đông Pha học thiền có chỗ thấu triệt, tự giác cảnh giới siêu nhiên, không khỏi vui mừng khôn xiết. Chẳng nén nổi xúc cảm, bèn trải giấy vung bút, viết một bài thơ:\n“Kê thủ thiên trung thiên,\nHào quang chiếu đại thiên;\nBát phong xuy bất động,\nĐoan tọa tử kim liên.”\n(Bát phong là chỉ: lợi, suy, hủy, dự, xưng, ky, khổ, lạc. Ý nói, không bị tám trạng thái này làm phiền nhiễu, gọi là “bát phong xuy bất động”.)\nViết xong, Đông Pha liền sai đầy tớ vượt sông đưa thư đến cho Thiền sư Phật Ấn ở Kim Sơn Tự.\nThiền sư Phật Ấn xem xong, phê lên hai chữ “phóng thí” (đánh rắm), rồi lại giao cho đầy tớ mang về.\nĐông Pha xem xong tức giận hậm hực, bèn lên thuyền vượt sông đến Kim Sơn Tự tìm Phật Ấn phân trần.\nKhi Đông Pha đến cổng Kim Sơn Tự, Phật Ấn đã đợi sẵn ở đó.\nTô Đông Pha mở lời trách vấn Phật Ấn: “Thơ ta viết, vì sao ngươi lại bảo là phóng thí!”\nPhật Ấn đáp: “Chẳng phải ngài đã ‘bát phong xuy bất động’ ư? Sao lại bị ‘nhất thí đả quá giang’ (một tiếng rắm đánh bay qua sông) thế kia!”\nLúc này, Đông Pha giật mình nhận ra đạo hạnh mình còn kém, hổ thẹn rời đi.\n(Câu chuyện này ví von “hỏa hầu chưa tới” - công phu chưa đạt.)",
    "Explanation": "Gia tộc cầu bảo, Tự thân an, Cầu tài đợi thời, Giao dịch nên chậm, Hôn nhân hợp, Người đi tới, Kiện tụng hòa, Điền vụ thu tốt, Lục súc ổn, Tìm người khó, Di dời cát, Vật thất khó, Bệnh thuyên giảm, Phong thủy cát."
  },
  {
    "ID": "32",
    "Rank": "TRUNG XĂM",
    "Original": "前程査察定無疑\n石中藏玉有誰知\nㄧ朝良匠分明剖\n始覺安然碧玉期",
    "Transliteration": "Tiền trình tra sát định vô nghi\nThạch trung tàng ngọc hữu thùy tri\nNhất triêu lương tượng phân minh phẩu\nThủy giác an nhiên bích ngọc kỳ",
    "Translation": "Đường tới dò tra chẳng ngại nghi\nĐá dấu ngọc kia ai biết gì\nMột sớm thợ tài phân cắt đúng\nNgọc bích lộ dần quí xiết chi",
    "Comment": "Của quí trong đá, Người khác sao hay. Tới khi rõ ràng, Đúng thì mới quý",
    "Divination": "Cắt đá tìm ngọc, mọi việc đều thành công",
    "Reference": "Lưu Bị cầu hiền",
    "reference_translated": "Lưu Bị Cầu Hiền (Tam Cố Thảo Lư) (劉備求賢（三顧草廬、)",
    "reference_detail": "Thời Tam Quốc. Gia Cát Lượng ẩn cư trong thảo lư tại Long Trung. Lưu Bị lòng cầu hiền thiết tha, bèn đích thân đến viếng thăm, ba lần đi mới gặp được Gia Cát Lượng (sử gọi là “Tam cố thảo lư”). Lưu Bị liền bảo những người khác tránh ra, rồi hỏi Gia Cát Lượng: “Hán thất suy vi, gian thần thoán đoạt mệnh trời, chúa thượng lâm cảnh khốn cùng. Cô không tự lượng đức tài, muốn thi hành đại nghĩa trong thiên hạ, nhưng trí thuật nông cạn, nên gặp nhiều khó khăn, đến nỗi như ngày nay. Tuy nhiên chí lớn chưa nguôi, tiên sinh nghĩ kế sách nào sẽ được thi hành?”\nThế là Gia Cát Lượng bèn trình bày kế sách chia ba thiên hạ, phân tích rằng Tào Tháo không thể lấy, Tôn Quyền có thể làm viện trợ; lại tường thuật việc thứ sử hai châu Kinh, Ích nhu nhược, có cơ hội chiếm lấy, hơn nữa chỉ khi có được hai châu này mới có thể tranh thắng thiên hạ; lại còn kể cho Lưu Bị về chiến lược đánh Trung Nguyên. (Bài luận thuyết này hậu thế gọi là “Long Trung Đối”). Lưu Bị nghe xong hết lời khen ngợi, như nhặt được báu vật, hết lòng mời Gia Cát Lượng xuất sơn giúp đỡ, thế là Gia Cát Lượng trở thành quân sư của Lưu Bị.",
    "Explanation": "Gia đạo trung bình, Tự thân an, Cầu tài lao lực, Giao dịch trở, Hôn nhân thành, Người đi dò, Điền vụ muộn thu, Lục súc vượng, Tìm người thấy, Kiện tụng khó, Di dời cải ý, Vật thất phương tây, Bệnh khó an, Phong thủy thay hướng tốt."
  },
  {
    "ID": "33",
    "Rank": "TRUNG XĂM",
    "Original": "内藏無價寳和珍\n得玉何須外界尋\n不如等待高人識\n寛心猶且更寛心",
    "Transliteration": "Nội tàng vô giá bảo hòa trân\nĐắc ngọc hà tu ngoại giới tầm\nBất như đẳng đải cao nhân thức\nKhoan tâm do thả cánh khoan tâm",
    "Translation": "Trân châu vô giá giử bên trong\nĐược ngọc cần gì phải ngóng mông\nChi bằng đợi được cao nhân giúp\nLòng yên thanh thảng lại an lòng",
    "Comment": "Trong chứa vàng ngọc, Không cần ngoại tìm. Gặp quí nhân chỉ, Chẳng cần lao tâm",
    "Divination": "Giử ngọc còn tìm ngoài, Mọi việc đợi thời sau cát lợi",
    "Reference": "Giảo Kim mời Nhân quí",
    "reference_translated": "Giảo Kim mời Nhân Quý (咬金聘仁貴)",
    "reference_detail": "Trình Giảo Kim là công thần khai quốc nhà Đường. Một ngày nọ, Tiết Nhân Quý đang ngủ trưa trên núi, bỗng phát hiện Giảo Kim đi ngang qua bị hổ đuổi. Nhân Quý đuổi kịp, đánh bị thương con hổ, cứu được Giảo Kim.\nGiảo Kim mến mộ võ công của Nhân Quý, bèn tặng ông một mũi lệnh tiễn vàng, bảo ông đi tòng quân.\nTiết Nhân Quý sau này trở thành đại tướng nhà Đường.",
    "Explanation": "Gia đạo cầu bảo, Tự thân an, Cầu tài phải đợi, Giao dịch trễ, Hôn nhân thành, Người đi trở, Điền vụ trung bình, Lục súc vượng, Tìm người tốn công, Kiện tụng nhẫn nhịn, Di dời cát, Vật thất phương bắc, Bệnh gặp lương y, Phong thủy sửa đổi."
  },
  {
    "ID": "34",
    "Rank": "TRUNG XĂM",
    "Original": "行藏出入禮儀恭\n言必忠良信必聰\n心不了然且静撤\n光明红日正當中",
    "Transliteration": "Hành tàng xuất nhập lễ nghi cung\nNgôn tất trung lương tín tất thông\nTâm bất liễu nhiên thả tịnh triệt\nQuang minh hồng nhật chính đương trung",
    "Translation": "Ra đường lễ nghĩa nhớ mang theo\nLời nói thẳng ngay chữ tín gieo\nPhải biết lui êm khi chẳng rỏ\nChờ khi tường tỏ mới qua đèo",
    "Comment": "Trong lòng vô sự, Nước thu trong vắt, Không cần nghi hoặc, Sự tự nhiên thành",
    "Divination": "Hồng nhật đương không, Mọi việc toại ý",
    "Reference": "Đào viên kết nghĩa",
    "reference_translated": "Kết nghĩa vườn đào (桃園結義)",
    "reference_detail": "Cuối Đông Hán, thiên hạ đại loạn, giặc Khăn Vàng nổi dậy khắp nơi.\nLưu Bị, Quan Vũ và Trương Phi ba vị nhân sĩ chí khí, vì lý tưởng chung cùng gây dựng sự nghiệp lớn, ý hợp tâm đầu, lời nói hành động tương trợ, bèn chọn một mùa hoa đào nở rộ, trong vườn đào (nay thuộc trấn Tùng Lâm Điếm, thành phố Trác Châu, tỉnh Hà Bắc), cùng nâng rượu kết nghĩa, thề với trời rằng có khổ cùng chịu, có nạn cùng gánh, có phúc cùng hưởng, cùng nhau thực hiện lý tưởng tốt đẹp phục hưng nhà Hán. Ba người kết làm anh em nghĩa khí, lúc đó chính là tháng Ba, hoa đào nở rộ, tục gọi là “Đào Viên Tam Kết Nghĩa”.",
    "Explanation": "Gia đạo cát, Tự thân an, Cầu tài hư ảo,Giao dịch hôn nhân hợp, Người đi trở, Điền vụ bất lợi, Lục súc suy, Tìm người lâu gặp, Kiện tụng thua, Di dời y cựu, Vật thất khó tìm, Bệnh thuyên giảm, Phong thủy đại cát"
  },
  {
    "ID": "35",
    "Rank": "TRUNG XĂM",
    "Original": "衣冠重整舊家風\n道是無窮却有功\n掃去當途荆棘刺\n三人若議再和同",
    "Transliteration": "Y quan trùng chỉnh cựu gia phong\nĐạo thị vô cùng khước hữu công\nTảo Khứ đương đồ kinh cức thích\nTam nhân nhược nghị tái hòa đồng",
    "Translation": "Chỉnh trang áo mão giử gia phong\nLời phải tới cùng chẳng uổng công\nQuét sạch chông gai đường bước tới\nBa người tái họp ý tương đồng",
    "Comment": "Không cần lo ngại, Tự có thời tốt, Nếu hỏi đường đi, Trước mặt sẽ tốt",
    "Divination": "Trùng chỉnh y quan, Mọi việc trước khó sau dể",
    "Reference": "Đường Tăng thỉnh kinh",
    "reference_translated": "Đường Tăng thỉnh kinh (唐僧取經)",
    "reference_detail": "Đường Đại Cao Tăng Huyền Trang (602–664), tục danh Trần Vĩ, sinh tại huyện Cấu Thị, Lạc Châu (nay thuộc nam huyện Yển Sư, tỉnh Hà Nam). Mười ba tuổi xuất gia, pháp hiệu Huyền Trang. Đời gọi là Đường Tam Tạng.\nNăm Trinh Quán thứ ba (629, có thuyết là Trinh Quán nguyên niên) Tây hành, đến Thiên Trúc (Ấn Độ) thỉnh kinh, một mình dấn hiểm, trải qua muôn vàn gian khổ, bốn năm mới đến nơi.\nNăm Trinh Quán thứ mười bảy, sư chính thức từ biệt vua Đông quy. Qua con đường phía nam tỉnh Tân Cương hiện nay, Vu Điền, Lâu Lan mà về nước, đi về tổng cộng mười bảy năm, hành trình năm vạn dặm. Vào tháng Giêng năm Trinh Quán thứ mười chín về đến Trường An, vua sắc lệnh Lương Quốc Công Phòng Huyền Linh cùng các văn võ bá quan tổ chức đón tiếp long trọng.\nTổng cộng thỉnh về 520 hạp 657 bộ kinh Phật nguyên điển tiếng Phạn.\nVà dịch sang tiếng Trung.\nSau khi sư về, được Thái Tông, Cao Tông kính trọng, cung dưỡng trong cung, ban hiệu “Tam Tạng Pháp Sư”.",
    "Explanation": "Gia đạo loạn, tự thân cát, Cầu tài tốt, Giao dịch lợi, Hôn nhân trở, Người đi tới, Tìm người có, Điền vụ bất lợi, Lục súc hưng vượng, Kiện tụng hữu lý, Di dời an, Vật thất chậm có, Bệnh cầu khấn, Phong thủy đại cát."
  },
  {
    "ID": "36",
    "Rank": "TRUNG XĂM",
    "Original": "眼前病訟不須憂\n實地資財盡可收\n恰是猿猴金鎖脫\n自歸山洞去來遊",
    "Transliteration": "Nhãn tiền bệnh tụng bất tu ưu\nThực địa tư tài tận khả thu\nKháp thị viên hầu kim tỏa thoát\nTự qui sơn động kháp lai du",
    "Translation": "Tiền đồ bệnh tật chẳng cần lo\nMuốn thu tài vật có trời phò\nĐời khỉ xích vàng đâu khóa được\nNúi cũ quay về sống tự do",
    "Comment": "Thoát qua mọi việc, Phải tự an lòng. Đợi khi thời tới, Tìm đường thẳng ngay",
    "Divination": "Khỉ rừng thoát khóa, Mọi việc trước khó sau dể",
    "Reference": "Tương tử gặp bạn",
    "reference_translated": "Hàn Tương Tử gặp Khách (Hàn Tương Tử gặp Lữ Động Tân) (湘子遇賓（韓湘子遇到呂洞賓）)",
    "reference_detail": "Thời Đường, Hàn Tương Tử, là cháu chắt của Hàn Dũ. Tính tình phóng đãng tự do, không thích đọc sách, chỉ thích uống rượu. Bị Hàn Dũ gọi đến thư viện học tập, nhưng chàng không chịu học hành nghiêm túc, ngược lại còn đi bắt nạt bạn bè. Sau đó, Hàn Dũ sắp xếp chàng đến học ở chùa, lại bị vị sư trụ trì chùa tố cáo là cuồng ngạo.\nSau này, Lữ Động Tân đến cảm hóa chàng, cuối cùng tu đạo thành tiên. Tự xưng Nghiêu Hoa Đế Quân. Là một trong Bát Tiên. Biểu tượng là tay cầm giỏ hoa.",
    "Explanation": "Gia đạo bất an, Tự thân bình, Cầu tài đại lợi, Giao dịch chờ thời, Hôn nhân chưa thành, Người đi tới, Tim người có, Điền vụ sung túc, Lục súc bình, Kiện tụng có lý, Di dời cát, Vật thất xa, Bệnh lâu an, Phong thủy cát."
  },
  {
    "ID": "37",
    "Rank": "TRUNG XĂM",
    "Original": "欲待身安運泰時\n風中燈燭不相宜\n不如收拾深堂坐\n庶免光瑶靜處輝",
    "Transliteration": "Dục đãi thân an vận thái thời\nPhong trung đăng chúc bất tương nghi\nBất như thâu thập thâm đường tọa\nThứ miễn an nhiên tịnh xứ huy",
    "Translation": "Ngọc quỳnh nơi tối tỏa quang chi\nTựa cửa ngồi nhàn đễ nghĩ suy\nNhư đèn gặp gió lung lay động\nKhang thái an nhiên phải có thì",
    "Comment": "Ở yên an thân, Đợi ngày giờ tốt, Không gây điều xấu, Thủ cựu khỏi lo",
    "Divination": "Như đèn gặp gió, Mọi việc thủ thường mới tốt.",
    "Reference": "Lý Tịnh qui sơn",
    "reference_translated": "Lý Tịnh quy sơn (李靖歸山)",
    "reference_detail": "Lý Tịnh (571 - 649), tự Dược Sư, người Tam Nguyên, Ung Châu (nay là đông bắc huyện Tam Nguyên, Thiểm Tây). Là tướng thời mạt Tùy, đầu Đường, là quân sự gia nổi tiếng kiêm văn võ của nhà Đường. Sau được phong Vệ Quốc công, đời gọi là Lý Vệ công.\nLý Tịnh chính là cha của Na Tra Tam Thái tử trong Phong Thần Bảng, còn gọi là \"Tháp Tháp Thiên Vương\". Lý Tịnh và con trai hỗ trợ Khương Tử Nha (Thái Công) đánh bại Trụ Vương, lập ra nhà Chu, Võ Vương chính thức đăng cơ. Khương Tử Nha bèn lập Phong Thần Bảng, tiến hành nghi lễ phong thần, để an ủi linh hồn các tướng tử trận. Từ đó bốn biển thái bình, thiên hạ an ninh. Võ Vương muốn phong hầu ban thưởng, lại muốn phân phong đất đai cho công thần khai quốc. Lý Tịnh và con trai cùng bảy người khác yêu cầu quy sơn tu đạo, không ham danh lợi ở trần gian. Sau cả bảy người đều \"thân thể thành thánh\", xếp vào hàng tiên.\nCâu chuyện Phong Thần Bảng.",
    "Explanation": "Gia đạo thủ cựu, Tự thân bình, Cầu tài có, Giao dịch khó, Hôn nhân không hợp, Kiện tụng hòa, Người đi có tin, Điền vụ thu tốt, Lục súc an, Tìm người gặp, Di dời thủ cựu, Bệnh Hung, Phong thủy không nên sửa"
  },
  {
    "ID": "38",
    "Rank": "HẠ XĂM",
    "Original": "月照天書静處期\n忽遭雲霧又昏迷\n寛心祈待雲霞散\n此時更改好施為",
    "Transliteration": "Nguyệt chiếu thiên thư tịnh xứ kỳ\nHốt tao vân vụ hựu hôn mê\nKhoan tâm kỳ đãi vân hà tán\nThử thời canh cải hảo thi vi",
    "Translation": "Cảnh êm trăng rọi quyển thiên thư\nBỗng chốc mây che tối thế ư\nYên lòng chờ đợi tan mây khói\nTừ đấy đổi thay được ý như",
    "Comment": "Gia đạo buồn phiền, Nhân khẩu gặp nạn, Khấn cầu bảo hộ, Lo bị hao tài",
    "Divination": "Mây khói che trăng. Mọi việc chưa toại, Thủ cựu thì hơn.",
    "Reference": "Hà văn Tú gặp nạn",
    "reference_translated": "Hà Văn Tú gặp nạn (何文秀遇難)",
    "reference_detail": "Thời Minh Gia Tĩnh, Hà Văn Tú vì gian thần hãm hại, cả nhà gặp nạn, Hà Văn Tú được Vương Lan Anh, con gái Tướng quốc tương trợ, sau hai người bí mật đính hôn. Hà Văn Tú bị ác bá Trương Đường vu oan bỏ tù, sau đó được cứu ra, thi đỗ, được bổ nhiệm làm Tuần phủ. Văn Tú tìm kiếm tung tích Vương Lan Anh, giả trang thầy bói để thăm dò. Cuối cùng hai người đoàn tụ, Trương Đường bị xử tử.\nWikipedia",
    "Explanation": "Gia đạo bất an, Tự thân cầu bảo, Cầu tài khó, Giao dịch đợi thời, Hôn nhân khó hơp, Người đi trở, Điền vụ lục súc tổn, Tìm người gặp, Kiện tụng hòa, Di dời an, Vật thất khó tìm, Bệnh dần an, Phong thủy sữa đổi."
  },
  {
    "ID": "39",
    "Rank": "HẠ XĂM",
    "Original": "天邊消息實難思\n切莫多心望强求\n若把石頭磨作鏡\n曾知枉費己功夫",
    "Transliteration": "Thiên biên tiêu tức thực nan tư\nThiết mạc đa tâm vọng cưỡng cầu\nNhược bả thạch đầu mai tác kính\nTăng tri uổng phí kỷ công phu",
    "Translation": "Tin tới từ xa khó đoán suy\nNhọc lòng tính toán cố mà chi\nVí đem đá núi mài làm kính\nUổng phí công lao có ích gì",
    "Comment": "Trăm phương dụng kế,Uổng phí công phu, Chi bằng thủ cựu, Tìm hiểu nguyên do",
    "Divination": "Thủ thường an tịnh, Đợi thời thuận lợi mới làm",
    "Reference": "Khương Nữ tầm phu",
    "reference_translated": "Khương Nữ tìm chồng (姜女尋夫)",
    "reference_detail": "Thời Tần Thủy Hoàng, Mạnh Khương Nữ vào đêm tân hôn, chồng là Phạm Kỷ Lương (Vạn Hỉ Lương) bị bắt đi xây Vạn Lý Trường Thành. Mạnh Khương Nữ không quản đường xa mang y phục giữ ấm cho chồng, mất rất nhiều thời gian mới đến Trường Thành, nhưng cuối cùng lại được báo chồng đã chết, thi thể bị chôn vùi dưới Trường Thành. Mạnh Khương Nữ khóc lớn, Trường Thành đổ sập, lấy máu nhỏ lên đống xương cốt, tìm được hài cốt của chồng. Tần Thủy Hoàng vì vậy triệu kiến Mạnh Khương Nữ, kinh ngạc như gặp thần tiên, muốn nạp thiếp. Mạnh Khương Nữ yêu cầu Tần Thủy Hoàng phải đến Tần Hoàng Đảo để mặc tang phục cho Phạm Kỷ Lương, Tần Thủy Hoàng đồng ý; sau khi Tần Thủy Hoàng tế bái Phạm Kỷ Lương, Mạnh Khương Nữ ôm hài cốt chồng tại địa điểm được cho là Miếu Mạnh Khương Nữ ngày nay, nhảy xuống biển tự vẫn.",
    "Explanation": "Gai đạo an, Tự thân đề phòng, Cầu tài bình, Giao dịch trở, Hôn nhân không hợp, Người đi động, Điền vụ lợi, Lục súc tổn, Tìm người khó, Kiện tụng thua, Di dời bình, Vật thất không, Bệnh an, Phong thủy đại cát."
  },
  {
    "ID": "40",
    "Rank": "TRUNG XĂM",
    "Original": "红輪西墜兔東升\n百事陽消宜長陰\n若是女人才望用\n增添財祿福其心",
    "Transliteration": "Hồng luân tây trụy thố đông thăng\nBá sự dương tiêu nghi trưởng âm\nThị nhược nữ nhân tài vọng dụng\nTăng thêm tài lộc phúc kỳ tâm",
    "Translation": "Bống trời lặng dứt trăng hướng đông\nÂm thịnh dương suy phải thế không\nNếu thật nữ nhân tài giỏi vậy\nTăng thêm tài lộc phúc thêm hồng",
    "Comment": "Âm lợi nữ nhân, Chẳng hợp nam tử. Nếu có cầu mưu, Tiền hung hậu cát",
    "Divination": "Âm thịnh dương suy. Mọi việc trước khó sau dể",
    "Reference": "Võ tắc thiên đăng vị\nGia đạo bất lợi, Tự thân cầu phúc, Cầu tài đượi\nthời, Giao dịch cát, Hôn nhân bất hợp,\nĐiền vụ lục súc vượng, Người đi trở, Tìm người\nchưa gặp, Kiện tụng thua, Di dời đại cát,\nVật thất không, Bệnh lo, Phong thủy cát.",
    "reference_translated": "Võ Tắc Thiên đăng vị (武則天登位)",
    "reference_detail": "Thị là Võ Tắc Thiên, 14 tuổi được Đường Thái Tông Lý Thế Dân triệu vào cung làm Tài nhân, xưng \"Võ Mị\". Sau khi Thái Tông băng hà, Thị vào Cảm Nghiệp Tự làm ni cô.\nĐường Cao Tông đăng cơ, triệu Thị trở lại cung, phong Chiêu Nghi. Vĩnh Huy thứ sáu (655), Cao Tông lập Thị làm Hoàng hậu.\nVõ Tắc Thiên thông minh, am hiểu văn sử, mưu lược tài tình. Sau khi làm Hoàng hậu không lâu, vì Cao Tông bệnh tật ốm yếu, đôi khi ủy thác xử lý một số chính sự, nên uy thế ngày càng thịnh. Thượng Nguyên nguyên niên (674), Cao Tông xưng \"Thiên Hoàng\", Võ Hậu xưng \"Thiên Hậu\", trong cung xưng \"Nhị Thánh\".\nHoằng Đạo nguyên niên (683) Cao Tông băng hà, Thái tử Lý Hiển đăng cơ, Võ Tắc Thiên lâm triều xưng chế. Thứ Thánh nguyên niên (684) tháng hai, Võ Tắc Thiên phế Lý Hiển làm Lư Lăng Vương, lập con thứ tư Lý Đán làm Hoàng đế, tiếp tục lâm triều xưng chế. Cùng năm tháng chín, bà đổi cờ hiệu thành màu vàng, Đông Đô Lạc Dương đổi tên thành Thần Đô. Thiên Thụ nguyên niên (690) tháng chín ngày chín, Võ Tắc Thiên xưng đế, đổi quốc hiệu là Chu.",
    "Explanation": ""
  },
  {
    "ID": "41",
    "Rank": "TRUNG XĂM",
    "Original": "認賊却為作子將\n莫貪眼下有此糧\n無限好言君記取\n他年更慮遇悲傷",
    "Transliteration": "Nhận tặc khước vi tác tử tương\nMạc tham nhãn hạ hữu ta lương\nVô hạn hảo ngôn quân ký thủ\nTha niên cánh lự ngộ bi thương",
    "Translation": "Đừng có nghe chi chuyện ngọt ngào\nNhiều lời hứa ảo chớ tin mau\nKẻ cướp nếu thâu làm nghĩa tử\nSau này ắt gặp chuyện buồn đau",
    "Comment": "Chỉ một việc này, Chớ có tính sai. Khắc ghi trong lòng, Khỏi sinh u sầu",
    "Divination": "Nhận giặc làm con, Moi việc giả chân lẫn lộn",
    "Reference": "Đổng Trác thâu Lữ Bố",
    "reference_translated": "Đổng Trác thu nhận Lữ Bố (董卓收呂布)",
    "reference_detail": "Lã Bố, dũng mãnh thiện chiến, là danh tướng thời mạt Đông Hán, đầu Tam Quốc. Ông từng làm nghĩa phụ cho Kinh Châu Thứ sử Đinh Nguyên, phục vụ dưới trướng ông ta.\nSau khi Đông Hán Linh Đế băng hà, Đinh Nguyên liên kết với Đại Tướng quân Hà Tiến nắm giữ triều chính.\nĐổng Trác đánh một trận với Đinh Nguyên, kết quả nhiều tướng lĩnh đều không địch lại Lã Bố, vì vậy Đổng Trác sai thuộc hạ Lý Túc đi mua chuộc Lã Bố. Lý Túc mang theo cả đống vàng bạc châu báu và Xích Thố Mã nổi tiếng đi \"thăm Lã Bố\". Lý Túc mang theo cả đống vàng bạc châu báu và Xích Thố Mã nổi tiếng đi thăm Lã Bố. Vì vậy Lã Bố bị Đổng Trác mua chuộc, giết Đinh Nguyên, còn nói với binh lính dưới quyền rằng ai muốn theo thì theo, ai không muốn thì đi, kết quả hơn một nửa binh lính bỏ đi.\nSau khi Đổng Trác đắc thế, thu nhận Lã Bố làm nghĩa tử, và phong tước hầu.\nĐổng Trác tính tình nóng nảy, tình \"cha con\" với Lã Bố thực chất rất mỏng manh. Năm 189, dưới sự xúi giục của Tư đồ Vương Doãn, Lã Bố giết Đổng Trác.\n6 tháng sau khi Đổng Trác chết, bộ hạ của Đổng Trác tấn công kinh thành, Lã Bố cùng vợ vội vàng bỏ trốn. Sau khi ra khỏi kinh thành, Lã Bố lần lượt nương nhờ quân phiệt Viên Thuật, Viên Thiệu, Trương Dương, Trương Mạc, Lưu Bị, v.v., nhiều lần giao chiến với Tào Tháo, quân phiệt lớn khác thời bấy giờ. Lã Bố dũng mãnh thiện chiến, từng nhiều lần đánh bại Tào Tháo.\nNăm Kiến An thứ ba thời Đông Hán, quân đội của Tào Tháo tấn công căn cứ của Lã Bố - Tiểu Bái, bắt sống và giết chết ông dưới lầu Bạch Môn. Trước khi hành hình, Lã Bố cầu xin Tào Tháo giữ lại để tha mạng, Lưu Bị lại nhắc nhở Tào Tháo rằng Lã Bố nhiều lần phản bội, không đáng tin. Cuối cùng, Tào Tháo, người coi trọng tài năng mà không màng đức hạnh, vẫn xử tử Lã Bố.",
    "Explanation": "Gia đạo bất an, Tự thân bình thường, Cầu tài phải đợi, Giao dịch khó, Hôn nhân chưa hợp, Người đi tới, Tìm người có, Lục súc an, Điền vụ trung bình, Kiện tụng hòa, Di dời y cựu, Vật thất không, Bệnh giải trừ, Phong thủy an ;"
  },
  {
    "ID": "42",
    "Rank": "THƯỢNG XĂM",
    "Original": "君皇聖后總為恩\n復待祈禳無损增\nㄧ切有情皆受用\n人間天上得期亨",
    "Transliteration": "Quân hoàng thánh hậu tổng vi ân\nPhục đãi kỳ nhương vô tổn tăng\nNhất thiết hữu tình giai thụ dụng\nNhân gian thiên thượng đắc kỳ hanh",
    "Translation": "Thánh thần vua chúa với ân trời\nGiúp cho phúc lộc tỏa nơi nơi\nMọi điều lòng thiện ra làm việc\nĐất rộng trời cao mới sáng ngời",
    "Comment": "Trời vua ban phúc, Sau trước chớ quên, Sớm hôm niệm lễ, Thành tâm khấn cầu",
    "Divination": "Trời ban ân trạch, Mọi việc thành tựu đại cát",
    "Reference": "Hữu Liên gặp Mẹ",
    "reference_translated": "Mục Liên cứu mẹ (目連救母)",
    "reference_detail": "Mục Kiền Liên, hoặc gọi là Mục Liên, là một trong Mười Đại Đệ Tử của Thích Ca Mâu Ni Phật, thần thông đệ nhất.\nMẹ của ông vì đời trước keo kiết, tham lam nên sau khi chết đọa vào đường ngạ quỷ. Mục Kiền Liên dùng thần thông quan sát, biết mẹ mình sinh vào cõi ngạ quỷ, không có đường cầu thực, khổ sở cùng cực, liền dùng thần thông mang thức ăn đến cho mẹ, không ngờ mẹ ông nhận thức ăn xong, đều hóa thành tro bụi mà không thể ăn được.\nMục Liên lo buồn sự việc này bèn báo cáo Phật Đà. Phật Đà nói với Mục Liên, vào ngày rằm tháng bảy âm lịch, chuẩn bị trăm món ăn, năm loại trái cây dâng lên mười phương đại đức tăng chúng, nhờ sức mạnh này mẹ ông sẽ được ăn.\nMục Liên làm theo lời Phật, mẹ ông cuối cùng được giải thoát. Pháp hội này gọi là \"Văn Lan Hội\", ngày lễ này gọi là \"Tết Văn Lan\".\n(Ghi chú: Một loại vật chất, ở các tầng bậc thế giới khác nhau, cảm nhận sẽ khác nhau. Ví dụ: Khi thế giới này mưa, chúng ta nhìn là \"nước mưa\", chúng sinh cõi ngạ quỷ thì cảm nhận là \"máu rơi\", chúng sinh cõi địa ngục thì cảm nhận là \"kiếm rơi\", trời người thì cảm nhận là \"hoa rơi\".)",
    "Explanation": "Gia đạo cầu phúc, Tự thân đông cát, Cầu tài chưa có, Giao dịch thành, Hôn nhân cát, Người đi động, Điền vụ lục súc trung bình, Tìm người thấy, Kiện tụng thắng, Di dời y cũ, Vật thất không gặp, Bệnh dứt, Phong thủy an."
  },
  {
    "ID": "43",
    "Rank": "THƯỢNG XĂM",
    "Original": "天地變通萬物原\n自榮自养自安然\n包羅萬象皆精彩\n事事如心謝聖賢",
    "Transliteration": "Thiên địa biến thông vạn vật nguyên\nTự vinh tự dưỡng tự an nhiên\nBao la vạn tượng giai tinh thái\nSự sự như tâm tạ thánh hiền",
    "Translation": "Đất trời luân chuyễn vật còn nguyên\nTự thân vinh diệu tự an nhiên\nCác việc từ đây thêm khởi sắc\nThành tâm kính lễ tạ thần tiên",
    "Comment": "Trời sinh vạn vật, Mưu vọng điều không. Phúc đức tương trợ, Điềm lành trùng trùng",
    "Divination": "Thiên địa giao hòa, Mọi việc đại cát vô nguy",
    "Reference": "Hành giả đắc đạo",
    "reference_translated": "Hành giả đắc đạo (行者得道)",
    "reference_detail": "Câu chuyện Tây Du Ký:\nNgộ Không, chiếm núi làm vua ở Hoa Quả Sơn, sau để tìm phương pháp trường sinh bất lão, trải qua tám chín năm, vượt núi băng sông bái Bồ Đề Tổ Sư làm thầy, học được 72 phép Địa Sát biến hóa và Cân Đẩu Vân, lần đầu lấy họ là Tôn, đặt tên Ngộ Không.\nSau đó, Tôn Ngộ Không để tìm vũ khí vừa tay, náo loạn Đông Hải Long Cung, cuối cùng tìm được Như Ý Kim Cô Bổng là Thần Chân Định Hải ở dưới biển. Vì thọ đã hết mà náo loạn Địa Phủ, sửa đổi Sổ Sinh Tử, trở về nhân gian. Sau đó, Tôn Ngộ Không lần đầu được Thiên Giới chiêu an, phong làm Bật Mã Ôn. Lần thứ hai được Thiên Giới chiêu an, phong làm Tề Thiên Đại Thánh, lại ăn trộm Đào Tiên, náo loạn Thiên Cung, bị nhốt trong Lò Bát Quái luyện thành Kim Tinh Hỏa Nhãn, cuối cùng bị Như Lai Phật Tổ trấn áp dưới Ngũ Chỉ Sơn năm trăm năm, không thể cử động. Nơi bị đá bay Lò Bát Quái biến thành Hỏa Diệm Sơn.\nNăm trăm năm sau, Đường Tăng đi Tây Thiên thỉnh kinh, đi ngang Ngũ Hành Sơn, bóc phù chú, mới cứu được Tôn Ngộ Không. Tôn Ngộ Không cảm kích rơi nước mắt, được Bồ Tát Quán Âm chỉ dạy, bái Đường Tăng làm sư phụ, cùng đi Tây Thiên thỉnh kinh. Trên đường thỉnh kinh, Tôn Ngộ Không hàng yêu phục ma, lập nhiều kỳ công, nhưng hai lần ba lượt bị sư phụ Đường Tăng hiểu lầm, trục xuất. Trải qua tám mươi mốt nạn, cuối cùng hoàn thành đại công, sư đồ bốn người đến Tây Thiên Lôi Âm Tự, lấy được chân kinh. Tôn Ngộ Không tu thành chánh quả.\n(Câu chuyện này ví von, ngay cả con khỉ cũng có thể thành đạo, huống chi là người.)",
    "Explanation": "Gia đạo các, Tự thân an, Cầu tài có, Giao dịch lợi, Hôn nhân hợp, Người đi trở, Điền vụ lục súc trung bình, Tìm người gặp, Kiện tụng thắng, Di dời lợi, Vật thất đông nam, Bệnh cầu phúc, Phong thủy hướng đông, và tây cát."
  },
  {
    "ID": "44",
    "Rank": "TRUNG XĂM",
    "Original": "棋逢敵手着相宜\n黑白盤中末决時\n皆因ㄧ着知勝敗\n教須自有好推宜",
    "Transliteration": "Kỳ phùng địch thủ trước tương nghi\nHắc bạch bàn trung vị quyết thì\nGiai nhân nhất trước tri thắng bại\nGiáo tu tư hữu hảo suy nghi",
    "Translation": "Bài cờ đen trắng đễ tranh nhau\nCông thủ đôi bên bước nước vào\nKỳ phùng địch thủ cần suy tính\nThế trận đúng rồi rỏ thấp cao",
    "Comment": "Cầu chuyện trong lòng, Tỷ như chơi cờ. Rỏ rồi thắng bại, Phải dụng tâm cơ",
    "Divination": "Kỳ phùng địch thủ, Mọi việc tốn tâm cơ mới tốt",
    "Reference": "Khương Duy xem trận",
    "reference_translated": "Khương Duy Đặng Ngải đấu trận (姜維鄧艾鬥陣)",
    "reference_detail": "Thời Tam Quốc, Khương Duy (Thục) và Đặng Ngải (Ngụy). Hai quân đội hội sư ở Kỳ Sơn, đấu binh pháp trận mạc.\nHai quân Ngụy, Thục đều dùng trận hình Bát Quái nghênh địch, hai quân giao tranh, Khương Duy phất cờ ra hiệu, trận Bát Quái tức thì biến thành trận Xà Cuốn Địa, bao vây Đặng Ngải.\nSau đó được Tư Mã Vọng cứu thoát.\n(Ví von, khi gặp thời khắc quan trọng, cần dùng trí tuệ.)",
    "Explanation": "Gia đạo đại lợi, Tự thân bình ổn, Cầu tài toại ý, Giao dịch lợi, Hôn nhân chưa hợp, Người đi tìm người tới, Điền vụ bình, Lục súc tổn, Kiện tụng hòa, Di dời thủ cựu Vật thất mất, Bệnh cầu bảo, Phong thủy thủ cựu."
  },
  {
    "ID": "45",
    "Rank": "THƯỢNG XĂM",
    "Original": "温柔自古勝剛強\n積善之門大吉昌\n若是有人占此卦\n宛如正渴遇瓊漿",
    "Transliteration": "Ôn nhu tự cổ thắng cương cường\nTích thiện chi môn đại cát xương\nNhược thị hữu nhân chiêm thử quẻ\nUyển như chính khác ngộ quỳnh tương",
    "Translation": "Cửa nhà tích thiện đại phồn vinh\nCương nhu tự cổ đã phân minh\nNgười được quẻ này vui rạng rở\nKhác nước miệng khô gặp rượu quỳnh",
    "Comment": "Trời đất nhận biết, Ứng nghiệm phi thường, Thánh thần phò trợ, Được rồi chớ quên",
    "Divination": "Tích thiện ôn nhu. Mọi việc quí nhân hòa hiệp ",
    "Reference": "Nhân Tông gặp tiên",
    "reference_translated": "Nhân Tông nhận mẹ (仁宗認母)",
    "reference_detail": "Phi tần của Tống Chân Tông - Lưu Phi, vì ghen ghét Lý Phi sinh con - Triệu Trinh, đã mua chuộc bà đỡ tráo đổi con của Lý Phi thành mèo rừng bị lột da, vu tội Lý Phi sinh yêu nghiệt, khiến nàng bị giáng vào lãnh cung, Lưu Phi được lập làm Hoàng hậu.\nĐức Phi sau khi thăng làm Hoàng hậu đã đốt lãnh cung định giết Lý Phi, Lý Phi trốn thoát và lưu lạc dân gian.\nLý Phi ban đầu ném Triệu Trinh xuống sông, may mắn được thái giám cứu giúp, đưa đến phủ Bát Hiền Vương, lớn lên kế thừa đế vị làm Tống Nhân Tông.\nSau này, Bao Chửng (Bao Thanh Thiên) tình cờ gặp Lý Phi bị mù hai mắt, biết được sự thật, liền ra sức xét xử, cuối cùng sự thật được sáng tỏ, giúp Tống Nhân Tông và Lý Phi mẹ con tương nhận. Lưu Phi thì bị giáng vào lãnh cung, đón Lý Phi vào cung, câu chuyện kết thúc viên mãn.",
    "Explanation": "Gia đạo cát, Tự thân an, Cầu tài toại, Giao dịch lợi, Hôn nhân hợp, Người đi trở, Kiện tụng thắng, Điền vụ thu cát, Lục súc trung bình, Tìm người thấy, Di dời lợi, Vật thất hướng đông, Bệnh cầu phúc, Phong thủy hướng đông và tây cát lợi."
  },
  {
    "ID": "46",
    "Rank": "TRUNG XĂM",
    "Original": "勸君耐守舊生涯\n把定心腸自起歹\n直待有人輕助力\n枯枝老樹再花開",
    "Transliteration": "Khuyến quân nại thủ cựu sinh nhai\nBả định tâm trường vật khởi đài\nTrực đãi hữu nhân khinh trợ lực\nCô chi lão thụ tái hoa khai",
    "Translation": "Cuộc sống phải chờ chớ đổi thay\nGiử lòng ngay thẳng chẳng làm sai\nĐợi lúc người hiền ra nhẹ giúp\nCây già cành ít vạn hoa khai",
    "Comment": "Thủ cựu chờ thời, Việc tự thành tựu. Động tất đa tai, Ẩn yên khỏi lổi",
    "Divination": "Cây khô sinh hoa, Việc tự có thành tựu",
    "Reference": "Vị Thủy buông câu.",
    "reference_translated": "Ngụy Thủy Điếu Ngư (渭水釣魚)",
    "reference_detail": "Thời Chu, Khương Thượng, tự Tử Nha, người Ký (người Hứa Châu, Đông Hải), đạo hiệu Phi Hùng. Tổ tiên được phong ở Lã (tên đất), nên còn được gọi là Lã Vọng.\nKhương Tử Nha để tránh loạn lạc thời Thương Trụ, ẩn cư bên bờ sông Đông Hải, câu cá ở 磻溪 (Ngụy Thủy).\nCần câu là cần thẳng, thực ra chí của ông không đặt ở việc câu cá, mà là làm tể tướng.\nChu Văn Vương nghe danh ông hiền minh, bèn mời làm sư (thừa tướng). (Lúc đó Khương Tử Nha 80 tuổi).\nSau này Chu Võ Vương thảo phạt Thương Trụ, diệt nhà Thương, lập nhà Chu. Võ Vương gọi Khương Tử Nha là Thượng phụ. Phong con Khương là Đinh công làm Tề hầu.\n(Câu chuyện này ví von, kiên nhẫn chờ đợi thời cơ, đến khi gặp được cơ duyên, mới là khởi đầu cho sự phát triển.)",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài lợi, Giao dịch thành,Hôn nhân tựu, Người đi trở, Điền vụ bình, Lục súc khó, Tìm người dò, Kiện tụng cát, Di dời y cựu, Vật thất khó, Bệnh cầu phúc, Phong thủy cát"
  },
  {
    "ID": "47",
    "Rank": "THƯỢNG XĂM",
    "Original": "錦上添花色愈鮮\n運來祿馬喜双全\n時人莫恨功名晚\nㄧ舉登科四海傳",
    "Transliteration": "Cẩm thượng thiêm hoa sắc dữ tiên\nVận lai lộc mã hỷ song toàn\nThời nhân mạc hận công danh vãng\nNhất cử đăng khoa tứ hải truyền",
    "Translation": "Gấm điểm thêm hoa sắc thắm tươi\nPhúc lộc giờ đây mười vẹn mười\nĐừng giận công danh sao đến trễ\nBảng hổ danhđeề rạng khắp nơi",
    "Comment": "Giử cũ biến mới, Mẹ cha hộ giúp. Toại chí bình sinh, Đều do vân mệnh",
    "Divination": "Trên gấm thêm hoa, Mọi sự đại cát đại lợi",
    "Reference": "Lương Hiệu đăng khoa",
    "reference_translated": "Lương Hạo đăng khoa (梁灝登科)",
    "reference_detail": "Thư sinh, Lương Hạo (963-1004), tự Thái Tố, người Tuân Thành, Vận Châu (nay là Đông Bình, Sơn Đông) thời Tống.\nNiên hiệu Ung Hy, 18 tuổi đỗ Tiến sĩ. Tiếp tục ứng thí không thành.\nÔng bắt đầu tham gia kỳ thi từ năm Thiên Phúc thứ 3, trải qua Hậu Hán, Hậu Chu, năm nào cũng thi, năm nào cũng không đỗ. Ông thề, không đỗ Trạng nguyên, thề không cam tâm.\nĐến năm 82 tuổi, năm Ung Hy thứ 2 thời Tống Chân Tông, mới đỗ Trạng nguyên.",
    "Explanation": "Gia đạo cầu bảo,Tự thân an, Cầu tài lợi, Giao dịch trở, Hôn nhân hợp, Người đi trễ, Điền vụ tốt, Lục súc bình, Tìm người có, Kiện tụng hòa, Di dời cát, Vật thất tây bắc, Bệnh làm phúc, Phong thủy lợi"
  },
  {
    "ID": "48",
    "Rank": "TRUNG XĂM",
    "Original": "昆鳥秋來化作鹏\n好遊快樂喜飛騰\n翶翔萬里雲霄去\n余外諸禽總不能",
    "Transliteration": "Côn điểu thu lai hóa tác bằng\nHảo du khoái lạc hỷ phi đằng\nCao tường vạn lý vân tiêu khứ\nDư ngoại chư cầm tổng bất năng",
    "Translation": "Chim cả hóa bằng khi tới thu\nTrời xanh bay lượn cánh phiêu du\nCác loại chim kia sao sánh được\nVút cao lướt tới vượt mây mù",
    "Comment": "Chim côn hóa bằng, Chim khác sao sánh. Bẻ nhành quế thơm, Phúc lộc tự đến",
    "Divination": "Chim côn hóa đại bàng. Việc có chuyển biến",
    "Reference": "Hàn Tín treo ấn soái",
    "reference_translated": "Hàn Tín lĩnh soái (韓信掛帥)",
    "reference_detail": "Hàn Tín, người Hoài Âm.\nLúc đó Hán vương đốt cầu Vạn Lý, tướng sĩ đào ngũ rất nhiều, vốn quy phụ Hán vương là Hàn Tín cũng bỏ đi.\nTiêu Hà biết được, liền đêm ngày đuổi theo Hàn Tín.\nNgày hôm sau Hán vương biết chuyện, giận dữ nói: \"Tướng sĩ đào ngũ gần hết một nửa doanh trại, ta không nghe ngươi đuổi theo thừa tướng nào khác, sao lại chỉ đuổi một mình Hàn Tín?\"\nTiêu Hà nói: \"Đại vương nếu không có ý đông chinh Hạng Vũ thì thôi. Nếu muốn tranh thiên hạ với Sở thì không thể không có Hàn Tín.\" Hán vương bèn phong Hàn Tín làm Đại tướng.\nHàn Tín bèn phụ trợ Hán Cao Đế định thiên hạ, bắt giữ Ngụy vương, phá Triệu quốc, hàng Yên quốc, công hạ Tề quốc, diệt Sở. Lập mười công huân lớn, ban đầu phong Sở vương.",
    "Explanation": "Gia đạo lợi, Tự thân cát, Cầu tài thu vượng, Giao dịch nên trễ, Hôn nhân không hợp, Người đi trở, Điền vụ bình, Lục súc xuân lợi, Tìm người thấy, Kiện tụng thắng, Di dời thủ cựu, Vật thất hướng tây, Bệnh cầu bảo, Phong thủy an."
  },
  {
    "ID": "49",
    "Rank": "TRUNG XĂM",
    "Original": "天寒地凍水成冰\n何須貧吝取功名\n守己只宜静處坐\n待時興變自然明",
    "Transliteration": "Thiên hàn địa đống thủy thành băng\nHà tu bần tiện thủ công danh\nThủ kỷ chỉ nghi tịnh xứ tọa\nĐải thời hưng biến tự nhiên minh",
    "Translation": "Rét về sông lạnh đóng băng nhanh\nKhổ nghèo ý vọng công danh thành\nChi bằng rèn chí nơi thanh vắng\nChờ ngày biến đổi tỏ thanh danh",
    "Comment": "Nước kết thành băng, Băng tan thành nước. Nếu có mưu tính, Cũng vậy mà thôi",
    "Divination": "Nước đóng thành băng. Chuyện không được uổng cầu",
    "Reference": "Vương Tường cầu lý ngư",
    "reference_translated": "Vương Tường Cầu Lý (Nhị Thập Tứ Hiếu Cổ Sự) (王祥求鯉(廿四孝故事))",
    "reference_detail": "Đời Tấn, Vương Tường (tự Phục Trưng) sớm mồ côi mẹ. Cha ông tái hôn với bà Chu thị, một người đàn bà tâm địa hẹp hòi. Mẹ kế thường xuyên trách mắng và nói xấu Vương Tường trước mặt cha khiến ông bị ghẻ lạnh. Tuy nhiên, em trai cùng cha khác mẹ là Vương Lãm lại rất yêu quý anh, và Vương Tường vẫn giữ trọn đạo hiếu với cha mẹ.\n\nMột năm mùa đông, mẹ kế bị bệnh nặng và muốn ăn cá tươi, nhưng mặt sông lúc đó đã đóng băng dày đặc. Vương Tường không quản ngại giá rét, ra bờ sông cởi áo nằm mình trần trên băng (Ngọa băng) với hy vọng dùng hơi ấm cơ thể làm tan băng để bắt cá. Cảm động tấm lòng hiếu thảo, tảng băng bỗng nứt ra, có hai con cá chép nhảy lên. Vương Tường mang cá về cho mẹ, sau khi ăn xong bà liền khỏi bệnh và thay đổi thái độ với ông. Về sau, Vương Tường làm quan đến chức Thái Bảo, được phong công tước.",
    "Explanation": "Gia đạo bất an, Tự thân cầu bảo, Cầu tài khó, Giao dịch trở, Hôn nhân không hợp Người đi trở, Điền vụ thiệt hại, Lục súc tổn, Tìm người gặp, Kiện tụng hòa, Di dời y cựu, Vật thất khó tìm, Bệnh giảm, Phong thủy đại cát."
  },
  {
    "ID": "50",
    "Rank": "THƯỢNG XĂM",
    "Original": "五湖四海任君行\n高挂帆蓬自在撑\n若得順風隨即至\n滿船寶貝喜層層",
    "Transliteration": "Ngũ hồ tứ hải nhậm quân hành\nCao quải phàm bồng tự tại xanh\nNhược đắc thuận phong tùy tức chí\nMãn thuyền bảo bối hỷ tằng tằng",
    "Translation": "Biển hồ lồng lộng tự do đi\nRa tay lèo lái có lo gì\nThuận gió giong buồm về bến sớm\nĐầy thuyền châu báu rạng tràn mi",
    "Comment": "Tự tại ung dung, Chẳng cần ra sức, Tài lộc trùng trùng, Vô cùng hoan hỷ",
    "Divination": "Thuận gió đi thuyền, Các việc đại thuận đại cát",
    "Reference": "Đào Chu qui ngũ hồ",
    "reference_translated": "Đào Chu quy Ngũ Hồ (Phạm Lãi Quy Hồ) (陶朱歸五湖(范蠡歸湖))",
    "reference_detail": "Thời Xuân Thu, Phạm Lãi, tự Thiếu Bá, còn gọi là Úy Di Tử Bì hoặc Đào Chu Công.\nLúc đó Ngô quốc và Việt quốc xảy ra chiến tranh, Ngô quốc diệt Việt quốc. Phạm Lãi và Văn Chủng, vì Việt vương Câu Tiễn mà đề ra kế hoạch hưng thịnh Việt diệt Ngô. Phạm Lãi thân mình vượt núi băng rừng, ở núi Nhuận La, sông Hoán Sa tìm được người phụ nữ tài sắc vẹn toàn tên Tây Thi dâng cho Ngô vương, dùng \"mỹ nhân kế\", nội ứng ngoại hợp lại diệt Ngô quốc.\nĐến khi diệt Ngô công thành danh toại, Phạm Lãi biết rõ tính cách của Câu Tiễn \"cổ dài chim 喙 (nhìn hẹp hòi)\", có thể cùng hoạn nạn, khó cùng hưởng lạc, bèn cùng Tây Thi chèo thuyền sang Tề quốc, đổi tên thành Úy Di Tử Bì, dẫn con cháu và môn khách lập am ở ven biển. Cật lực khai khẩn ruộng đất, kiêm kinh doanh phụ nghiệp và buôn bán, không mấy năm, đã tích lũy được tài sản hàng chục triệu.\nÔng nghĩa khí phân phát tài sản, giúp đỡ quê hương, sự hiền minh và tài năng của Phạm Lãi được người Tề đánh giá cao, Tề vương mời ông vào kinh đô Lâm Tri, phong làm Tương quốc phụ trách chính vụ. Ông than thở: \"Làm quan đến chức Khanh tướng, trị gia có thể đạt ngàn vàng; đối với một người tay trắng xây dựng cơ nghiệp, đã đạt đến cực điểm. Lâu dài chịu tiếng tốt, e rằng không phải là điềm lành.\" Vì vậy, chỉ ba năm, ông lại \"tháo lui khẩn cấp\", trả lại ấn tương cho Tề vương, tán gia bại sản cho bạn bè thân thiết và người quê.",
    "Explanation": "Gia đạo lợi, Tự thân cát, Cầu tài tây lợi, Giao dịch chậm, Hôn nhân không hợp, Người đi trở, Điền vụ thu lợi, Lục súc xuân vượng, Tìm người có, Kiện tụng thua, Di dời thủ cựu, Vật thất hướng tây, Bệnh giải trừ, Phong thủy hướng nam cát."
  },
  {
    "ID": "51",
    "Rank": "THƯỢNG XĂM",
    "Original": "夏日炎天日最長\n人人愁熱悶非常\n也解知人天地意\n薰風拂拂自然凉",
    "Transliteration": "Hạ nhật diêm thiên nhật tối trường\nNhân nhân sầu nhiệt muộn phi thường\nDã giải tri nhân thiên địa ý\nHuân phong phất phất tự nhiên lương",
    "Translation": "Ngày hè trời nóng kéo qua đêm\nNgười người oi bức lại buồn thêm\nBỗng chốc đất trời thông hiểu ý\nGió thơm thổi nhẹ lướt qua thềm",
    "Comment": "Tiến thoái không ngờ, Tự có thời tốt. Muốn mưu dùng việc, Chẳng nên làm càng",
    "Divination": "Người người buồn nhiệt. Mọi việc tùy tâm tùy ý",
    "Reference": "Khổng Minh nhập xuyên",
    "reference_translated": "Khổng Minh nhập Xuyên (孔明入川)",
    "reference_detail": "Gia Cát Lượng (181-234), tự Khổng Minh, người Dương Đô, Lang Gia (nay là huyện Ý Nam, tỉnh Sơn Đông), Thừa tướng nhà Thục Hán (Lưu Bị) thời Tam Quốc.\nLưu Bị tuy chiếm được Kinh Châu, nhưng chưa đủ để cát cứ một phương, Gia Cát Khổng Minh định chiếm Tây Xuyên, tăng thêm địa bàn cho Lưu Bị. Lúc này, Lưu Chương ở Ích Châu, bị Trương Lỗ ở phương Bắc tấn công. Gia Cát Khổng Minh biết Lưu Chương vì muốn tự bảo vệ, muốn dâng bản đồ Tây Xuyên cho Tào Tháo. Trương Tùng (thuộc hạ Lưu Chương) khi gặp Tào Tháo, vì Tào Tháo kiêu ngạo vô lễ, Lưu Chương mang bản đồ về Tây Xuyên, trên đường đi ngang qua Kinh Châu. Khổng Minh đã sớm chờ đón ở nửa đường, mời ông vào Kinh Châu, nhưng không đề cập đến chuyện bản đồ Tây Xuyên, cho đến khi chia tay. Trương Tùng vì cảm kích sự lễ độ và tiếp đãi của Khổng Minh, bèn dâng bản đồ Tây Xuyên cho ông.\nTây Xuyên địa hình hiểm yếu có thể công có thể thủ, qua sự bố trí của Khổng Minh, Tây Xuyên đã trở thành nơi khởi nghiệp của Lưu Bị.\n(Khổng Minh lấy lễ đối đãi người, liền dễ dàng chiếm được Tây Xuyên hằng mong ước.)",
    "Explanation": "Gia đạo cầu phúc, Tự thân cản phòng, Cầu tài thu cát, Giao dịch bình, Hôn nhân hợp, Người đi động, Điền vụ tổn, Lục súc bình, Tìm người có, Kiện thụng cát, Di dời y cũ, Vật thất phương bắc, Bệnh hoàn nguyện, Phong thủy cát."
  },
  {
    "ID": "52",
    "Rank": "HẠ XĂM",
    "Original": "水中捉月費功夫\n費盡功夫却又無\n莫說閑言并亂語\n枉勞心力强身孤",
    "Transliteration": "Thủy trung tróc nguyệt phí công phu\nPhí tận công phu khước hựu vô\nMạc thuyết nhàn ngôn binh loạn ngữ\nUổng lao tâm lực cưởng thân cô",
    "Translation": "Mò trăng đáy nước để mà chi\nPhí sức tốn công chẳng được gì\nBỏ tiếng ong ve lời không đẹp\nGiử phận thân yên tránh thị phi",
    "Comment": "Lời nói khó nghỉ, phí tâm lao lực. Trong nhà ưu phiền, Đợi gặp quí nhân",
    "Divination": "Tham công phí sức, Mọi việc lao tâm phí lực",
    "Reference": "Lý Bạch say rượu mò trăng",
    "reference_translated": "Thái Bạch say rượu mò trăng (Lý Thái Bạch say rượu bắt Trăng) (太白醉撈明月（李太白醉中捉月）)",
    "reference_detail": "Lý Bạch (701–762), tự Thái Bạch, hiệu Thanh Liên Cư Sĩ. Là thi nhân đời Đường, tự gọi là Trích Tiên, được xưng tụng là Thi Tiên, không rượu không vui. Có lần Lý Bạch đến Kim Lăng, nghỉ tại tửu lâu bên cầu Văn Đức. Đêm ấy đúng rằm tháng Một, ông một mình ngồi thưởng nguyệt, vừa uống rượu vừa ngâm thơ tác phú. Lý Thái Bạch sinh thời yêu nhất là trăng, nói rằng trăng vừa thanh sạch vừa mỹ lệ. Đêm đó thấy trăng trắng ngần viên mãn, ông hoan hỷ uống thêm vài chén. Đến nửa đêm, ông thừa lúc tửu hứng xuống cầu Văn Đức, cúi đầu thấy trăng rơi xuống nước, dòng nước xao động làm bóng trăng thêm vài vệt đen. Lý Bạch lúc này say khướt, cho rằng trăng bị nước làm vấy bẩn, chẳng kịp cởi giày liền nhảy xuống vớt trăng. Nào ngờ trăng chẳng thấy mà người lại chết đuối. Hưởng thọ 62 tuổi.",
    "Explanation": "Gia đạo bất an, Tự thân thiếu cát, Cầu tài trung bình, Giao dịch khó, Hôn nhân chưa tựu, Người đi hiểm, Điền vụ bình, Lục súc suy, Tìm người tới, Kiện tụng hòa, Di dời bình thường Bệnh cầu bảo, Phong thủy cát."
  },
  {
    "ID": "53",
    "Rank": "TRUNG XĂM",
    "Original": "失意番成得意時\n龍吟虎嘯兩相宜\n青天自有通霄路\n許我功名再有期",
    "Transliteration": "Thất ý phiên thành đắc ý thời\nLong ngâm hổ khiếu lưởng tương nghi\nThanh thiên tự hữu thông tiêu lộ\nHứa ngã công danh tái hữu kỳ",
    "Translation": "Vận số từ đây đã đổi thay\nNhư cọp giởn trăng rồng cởi mây\nTrời cao mở lối ta đi tới\nThành tựu công danh đã đến ngày",
    "Comment": "Gọi tới phải tới, Nói dừng nên dừng. Tự có hanh thông, Sự tới có lợi",
    "Divination": "Long ngâm hổ khiếu, Mọi việc thuận ý, có hy vọng",
    "Reference": "Lưu Bị chiêu thân",
    "reference_translated": "Lưu Bị chiêu thân (劉備招親)",
    "reference_detail": "Sau trận Xích Bích, Tôn Quyền nóng lòng muốn đoạt lại Kinh Châu bị Lưu Bị dùng mưu lấy được, bèn dùng kế của Chu Du, giả vờ gả em gái Tôn Nhân cho Lưu Bị, thực chất là muốn bắt Lưu Bị làm con tin để đòi Kinh Châu.\nGia Cát Lượng nhìn thấu mưu kế của Chu Du, bèn giao một cái túi gấm có ghi kế sách cho Triệu Vân đang bảo vệ Lưu Bị đến Đông Ngô, Triệu Vân theo kế sách trong túi gấm cố tình làm lớn chuyện, khiến Ngô Quốc Thái (cha của Tôn Quyền) biết chuyện chiêu thân. Ngô Quốc Thái vì yêu thương con gái, không muốn tùy tiện quyết định chuyện hôn nhân của con, bèn trách mắng Tôn Quyền vô tình với em gái, và đề nghị tự mình ở Cam Lộ Tự để thẩm định Lưu Bị có xứng đáng với con gái mình hay không. Ngô Quốc Thái gặp Lưu Bị, vô cùng khen ngợi, và kiên quyết ủng hộ hôn sự giữa Lưu Bị và con gái, Lưu Bị nhờ đó mà thuận lợi kết duyên với Tôn phu nhân.\nSau này Lưu Bị cùng Tôn phu nhân chạy về Kinh Châu, sau đó Tôn Quyền muốn nhân lúc Lưu Bị công chiếm Ích Châu mà lén đánh chiếm Kinh Châu, nhưng bị Ngô Quốc Thái lo lắng cho an nguy của con gái ngăn cản.\nCó câu: \"Chu Du kế hay hơn cả trời. Mất cả vợ lẫn quân\".\n(Lưu Bị nhờ đó mà lợi.)",
    "Explanation": "Gia đạo bất an, Tự thân thiếu cát, Cầu tài trung bình, Giao dịch khó, Hôn nhân thành tựu, Người đi tới, Điền vụ bình, Lục súc tổn, Tìm người tới, Kiện tụng hòa, Di dời cát, Thất vật có, Bệnh an, Phong thủy cát."
  },
  {
    "ID": "54",
    "Rank": "HẠ XĂM",
    "Original": "夢中得寳醒來無\n移自南山只是鋤\n若問婚姻并問病\n別尋條路為相扶",
    "Transliteration": "Mộng trung đắc bảo tỉnh lai vô\nTự vị nam sơn chỉ thị sừ\nNhược vấn hôn nhân binh vấn bịnh\nBiệt tầm điều lộ vi tương phù",
    "Translation": "Nắm mơ được ngọc tỉnh tay không\nMột cuốc dời non uổng phí công\nBệnh tật hôn nhân người nếu hỏi\nTìm con đường khác đễ cầu trông",
    "Comment": "Vật ở trong nước, Hình ảnh lung linh. Đều do phân định, Không cần phân minh",
    "Divination": "Mộng trung đắc bảo, Mọi việc uổng tâm phí sức",
    "Reference": "Mã Siêu truy Tào",
    "reference_translated": "Mã Siêu truy Tào (馬超追曹)",
    "reference_detail": "Mã Siêu\n(176-222), tự\nMạnh Khởi\n, người Phù Phong, Mậu Lăng (nay là phía đông bắc Hưng Bình, tỉnh Thiểm Tây), tướng lĩnh nổi tiếng thời Hán mạt và Tam Quốc.\nThời Tam Quốc, Tào Tháo giết cha Mã Siêu. Mã Siêu báo thù tấn công Tào Tháo, Tào Tháo bại trận bỏ chạy.\nĐể không bị lính Mã Siêu nhận ra, Tào Tháo cởi bỏ chiến bào đỏ, lại cắt ngắn râu, cưỡi ngựa bỏ chạy.\nTrong lúc nguy cấp, Tào Hồng kịp thời dẫn quân đến, chặn Mã Siêu, cứu Tào Tháo thoát khỏi cửa tử.\n(Câu chuyện này ví von, khi gặp nguy hiểm, bỏ lại công danh, danh phận mà thoát hiểm.)",
    "Explanation": "Gia đạo thiếu an, Tự thân cẩn phòng, Cầu tài trở, Giao dịch khó, Hôn nhân đợi thời, Điền vụ lục súc trệ, Người đi chưa tới, Tìm người gặp, Kiên tụng thua, Di dời cát, Vật thất không, Bệnh cầu bảo hộ, Phong thủy bất an."
  },
  {
    "ID": "55",
    "Rank": "THƯỢNG XĂM",
    "Original": "父腎傳子子流傳\n衣食豐隆只靠天\n堂上樁萱人快樂\n飯饑渴飲進因眠",
    "Transliteration": "Phụ hiền truyền tử tử lưu truyền\nY thực phong lưu chỉ kháo thiên\nĐường thượng thung quyên nhân khoái lạc\nPhạn cơ khát ẫm tấn nhân miên",
    "Translation": "Gia phong phúc đức mãi truyền nhau\nĂn no mặc ấm tại trời cao\nSong thân nhìn thấy tâm vui vẻ\nCơm rượu đủ đầy giấc yên mau",
    "Comment": "Nối tre dẫn nước, Lưu truyền chẳng dứt. Quân tử mưu vọng, Vô cùng vui vẻ",
    "Divination": "Riếp trúc dẫn nước, Mọi việc điều tốt cã",
    "Reference": "Châu võ Vương đăng vị",
    "reference_translated": "Chu Võ Vương đăng vị (周武王登位)",
    "reference_detail": "Chu Võ Vương thảo phạt Trụ Vương, dẫn tám trăm chư hầu đại chiến quân Thương vương, binh lính Triều Ca (thủ đô Thương vương) cũng quay giáo chống lại, phản bội Thương vương.\nTrụ Vương tự thiêu trên Lộc Đài, nhà Thương diệt vong.\nVõ Vương nhận kim sách kim bảo, lên ngôi Thiên tử, mặt quay về Nam, hai tay buông thõng khoanh lại, ngồi thẳng thớm. Võ Vương hạ lệnh phân phát tài vật Lộc Đài, dỡ bỏ Lộc Đài, giải phóng số gạo dự trữ ở Cự Kiều.\nThả vua Kê Tử bị giam, tu sửa mộ Tỷ Can. Võ Vương ngồi xe qua cửa nhà Tần Thương Dung là bậc hiền nhân, cúi đầu đứng lại. Kính trọng bậc hiền sĩ, thả những người hầu gái trong cung.\nLại đình chỉ võ bị, đề xướng văn giáo. Chăn thả ngựa ở phía Nam núi Nam Sơn, chăn thả bò ở vùng đất có rừng đào, một cảnh tượng an lạc thái bình.",
    "Explanation": "Gia đạo kém an,Tự thân như ý,Cầu tài lợi, Giao dịch thành, Hôn nhân hợp, Người đi động, Tìm người khó, Điền vụ cát, Lục súc tổn, Kiện tụng có quí nhân, Di dời cát, Vật thất có, Bệnh cầu hộ, Phong thủy cát."
  },
  {
    "ID": "56",
    "Rank": "TRUNG XĂM",
    "Original": "灘小石溪流水方\n風清明月貴人鄉\n路須借問何方去\n管取林中花草香",
    "Transliteration": "Than tiểu thạch khê lưu thủy phương\nPhong thanh minh nguyệt quí nhân hương\nLộ tu tá vấn hà phương khứ\nQuản thủ lâm trung hoa thảo hương",
    "Translation": "Bải cạn khe sâu nước chảy quanh\nTrăng trong gió mát người vắng tanh\nĐi đường cần hỏi phương nào tới\nThơm ngát hoa rừng tới hái nhanh",
    "Comment": "Mưu tính dụng sự, Uổng phí nhọc lòng. Thủ cựu chờ thời, Việc sau đại cát",
    "Divination": "Thuyền đi sông cạn, Làm việc phải có quí nhân giúp",
    "Reference": "An lộc Sơn mưu phản",
    "reference_translated": "Lộc Sơn mưu phản (祿山謀反)",
    "reference_detail": "An Lộc Sơn (703 – 757), vốn tên họ Khang, tên húy là Nghi Lạc Sơn, người Liễu Thành, Doanh Châu (nay là Triều Dương, Liêu Ninh). Sau này mạo nhận họ An, đổi tên thành Lộc Sơn. Thời Đường Huyền Tông, An Lộc Sơn làm Tiết độ sứ. Tháng 11 năm Thiên Bảo thứ 14, An Lộc Sơn khởi binh ở Phạm Dương, lấy cớ thảo phạt Dương Quốc Trung, phát động phản loạn, mang ba trấn binh lực, thẳng tiến về Đông Đô Lạc Dương. Thái Nguyên có báo tin cấp tốc đến Lệ Sơn, khi đó Đường Huyền Tông đang ở Hoa Thanh Cung tại Lệ Sơn không tin An Lộc Sơn sẽ phản bội, nhưng tin tức phản loạn liên tục truyền đến, Huyền Tông vẫn nửa tin nửa ngờ. (Đây là hình ảnh \"Giếng nước chảy xiết có tiếng ào ào\"). Cho đến khi Thái thú Bình Nguyên quận Nhan Chân Khanh phái người truyền đến tin tức, Huyền Tông mới tỉnh mộng. Dưới chiến lược sai lầm của bản thân Đường Huyền Tông, quân đoàn thiết kỵ của An Lộc Sơn công chiếm Đông Đô Lạc Dương, sang tháng giêng năm sau liền xưng làm Đại Yến Hoàng đế tại Lạc Dương, đặt niên hiệu Thánh Vũ, tự xưng Hùng Vũ Hoàng đế, lấy Đạt Hi Du làm Tể tướng. Tháng sáu cùng năm, Đường Huyền Tông vì cấp bách muốn giải nguy cho Trường An, lại dưới nhận thức quân sự sai lầm, xử trảm hai vị danh tướng Phong Thường Thanh và Cao Tiên Chi, lệnh này làm chấn động quân Đường. (Hành động này trái ngược với \"Đường đi cần chỉ về phía trước\") Sau đó, Đường Huyền Tông gấp lệnh cho một vị tướng khác là Ca Thư Hàn, thống lĩnh quân Đường xuất quan Đông tiến. Ca Thư Hàn, vốn hiểu rõ sai lầm chiến lược của Đường Huyền Tông, đã lên kế hoạch trì hoãn để chờ thời cơ (\"Thuyền nhẹ nhàng trôi xuôi dòng nước\" là cách làm đúng đắn). Cuối cùng lại bị Đường Huyền Tông cho là nhút nhát, nên trong sự bất lực không thể kiến nghị, đành ngậm ngùi quyết chiến với An Lộc Sơn, quả nhiên đại bại. (Ứng nghiệm câu \"Lực lao động vất vả có thể gây tổn thương\"). Nhà Đường trong tình thế quân biên và quân đồn trú địa phương không kịp ứng phó, quân An Lộc Sơn áp sát, tiến vào phạm vi thủ đô. Đường Huyền Tông trong tình thế nguy cấp, dẫn quân cận vệ bỏ trốn khỏi kinh thành, Tây Kinh Trường An mất chủ, vì thế rơi vào tay giặc. (Đường Huyền Tông đã vi phạm chỉ dẫn của quẻ này, nên An Lộc Sơn mưu phản thành công).",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài trung bình, Giao dịch lợi, Hôn nhân toại ý,Người đi tới, Điền vụ thu lợi, Lục súc tổn, Tìm người có, Kiện tụng thắng lý, Di dời cát, Vật thất trễ, Bệnh dứt nhanh, Phong thủy cần sửa."
  },
  {
    "ID": "57",
    "Rank": "TRUNG XĂM",
    "Original": "說是說非過耳風\n好衣好祿自然隆\n莫將記取當年事\n汝意還如我意同",
    "Transliteration": "Thuyết thị thuyết phi quá nhĩ phong\nHảo y hảo lộc tự nhiên long\nMạc tương ký thủ đương niên sự\nNhữ ý hoàn như ngã ý đồng",
    "Translation": "Lời phàm như gió thoảng qua tai\nĐừng có giử chi chuyện quấy này\nAnh tôi nay ý đồng tương hợp\nPhúc lộc an vui đã đến ngày",
    "Comment": "Có mưu vọng gì, Đều đại hoan hỷ. Việc làm công minh, Như con gặp mẹ",
    "Divination": "Hài nhi thấy Mẹ, Mọi việc có quí nhân đại cát",
    "Reference": "Đổng Trọng tầm thân",
    "reference_translated": "Đổng Trọng tìm mẹ (董仲尋親)",
    "reference_detail": "Đổng Trọng là con trai của Đổng Vĩnh đời Hán, là tiên nữ từ trời giáng xuống kết duyên cùng Đổng Vĩnh mà sinh ra. Sau khi tiên nữ giúp Đổng Vĩnh trả nợ chuộc thân, bà đã trở về trời. Đổng Trọng lên bảy tuổi, vì không có mẹ nên thường bị người ta sỉ nhục, liền muốn đi tìm mẹ. Được một vị tiên chỉ dẫn, Đổng Trọng vào ngày mồng bảy tháng bảy lên núi Thái Bạch để tìm, tiên nữ xuất hiện cuối cùng đã gặp được mẹ. Từ Truyền thuyết Đổng Vĩnh gặp tiên.",
    "Explanation": "Gia đạo bất an, Tự thân bình, Cầu tài thuận, Giao dịch thành, Hôn nhân hợp, Người đi trở, Điền vụ tựu, Tìm người khó, Kiện tụng hòa, Di dời thủ cựu, Vật thất không có, Bệnh cầu phúc, Phong thủy cát."
  },
  {
    "ID": "58",
    "Rank": "TRUNG XĂM",
    "Original": "君須記話說直言\n別藝莫求在外村\n除是其餘都不利\n切須守舊以生存",
    "Transliteration": "Quân tu ký thoại thuyết trực ngôn\nBiệt nghệ mạc cầu tại ngoại thôn\nTrừ thị kỳ dư đô bất lợi\nThiết tu thủ cựu dĩ sinh tồn\nLời Bàn\nNên đứng thì đứng, Nên ngồi thì ngồi. Đừng\nlàm việc khác, Theo cũ thì hơn\nĐiềm quẻ ứng\nThủ thường đợi thời, Mọi việc thủ cựu mới cát\nlợi\nTích Cổ : Văn Vương hỏi quẻ\n\n\nGiải\nGia đạo bình thường, Tự thân bất lợi, Cầu tài\ncát, Giao dịch thành, Hôn nhân trở,\nNgười đi chậm tới, Điền vụ bình, Lục súc tổn,\nTìm người thấy, Kiện tụng thua,\nDi dời thủ cựu, Bệnh thiếu an, Vật thất hung,\nPhong thủy cãi đổi.",
    "Translation": "thành, Hôn nhân trở,\nNgười đi chậm tới, Điền vụ bình, Lục súc tổn,\nTìm người thấy, Kiện tụng thua,\nDi dời thủ cựu, Bệnh thiếu an, Vật thất hung,\nPhong thủy cãi đổi.",
    "Comment": "Nên đứng thì đứng, Nên ngồi thì ngồi. Đừng làm việc khác, Theo cũ thì hơn",
    "Divination": "Thủ thường đợi thời, Mọi việc thủ cựu mới cát lợi",
    "Reference": "Văn Vương hỏi quẻ",
    "reference_translated": "Văn Vương hỏi quẻ (文王問卜)",
    "reference_detail": "Chu Văn Vương giỏi về bói quẻ. Khi đó, Trụ Vương triệu kiến, Văn Vương tính toán chuyến đi này không lành, ắt có tai họa bảy năm, nên đã nghiêm dặn trưởng tử là Bá Ấp, phải theo pháp luật cai trị Kỳ (tên đất), tuyệt đối không được đi ra ngoài. Sau này, Văn Vương quả nhiên bị Trụ Vương giam lỏng ở Duyện Lý (tên đất). Lúc đó, trưởng tử của Văn Vương đi cứu cha, kết quả bị giết, chính là vì quên lời dặn của cha.",
    "Explanation": "Gia đạo bình thường, Tự thân bất lợi, Cầu tài cát, Giao dịch thành, Hôn nhân trở, Người đi chậm tới, Điền vụ bình, Lục súc tổn, Tìm người thấy, Kiện tụng thua, Di dời thủ cựu, Bệnh thiếu an, Vật thất hung, Phong thủy cãi đổi."
  },
  {
    "ID": "59",
    "Rank": "TRUNG XĂM",
    "Original": "直上重樓去藏身\n四圍荆棘繞為林\n天高君命長和短\n得ㄧ番成失二人",
    "Transliteration": "Trực thượng trùng lâu khứ tàng thân\nTứ vi kinh cức Nhiểu vi lâm\nThiên cao quân mệnh trường hòa đoản\nĐắc nhất phiên thành thất nhị nhân",
    "Translation": "Lên lầu cao ấy ẩn thân ngay\nGai nhọn thành rừng tứ phía vây\nMệnh trời đã định dài hay ngắn\nĐược chỉ một thôi mất tới hai",
    "Comment": "Như uống rượu say, Chỉ nên thủ cựu. Đời thời cát lai, mới không sai lổi",
    "Divination": "Thủ cựu tùy thời. Việc nên đợi thời mới tốt",
    "Reference": "Trương Lương ẩn núi",
    "reference_translated": "Trương Lương ẩn sơn (張良隱山)",
    "reference_detail": "Thời Hán, Trương Lương, tự Tử Phòng, người nước Hàn, tổ tiên năm đời đều làm tể tướng nước Hàn. Nước Tần diệt nước Hàn, Trương Lương đem hết tài sản phân phát, ẩn mình tích dấu, muốn báo thù cho nước Hàn, bèn sai người lực sĩ giấu rìu sắt. Tại Bác Lãng Sa (nay thuộc huyện Nguyên Dương, Hà Nam) tấn công Tần Thủy Hoàng, nhầm đánh trúng xe phó. Thủy Hoàng ra lệnh truy nã toàn quốc, tìm bắt Trương Lương, nhưng mười tháng vẫn không bắt được. Sau này, Trương Lương giúp Hán vương thống nhất thiên hạ. Công thành danh toại, ông từ chối nhận thưởng phong quan, mượn cớ học đạo với Xích Tùng Tử (thần tiên).",
    "Explanation": "Gia đạo cầu phúc, Tự thân an, Cầu tài bình, Giao dịch thành, Hôn nhân không hợp, Người đi tới, Tìm người trở, Điền vụ bình, Lục súc đại lợi, Kiện tụng thua, Di dời cát, Vật thất hung, Bệnh cầu phúc, Phong thủy cát."
  },
  {
    "ID": "60",
    "Rank": "HẠ XĂM",
    "Original": "抱薪救火大皆燃\n焼遍三天亦復然\n若問榮華并出入\n不如收拾枉勞心",
    "Transliteration": "Bảo tân cứu hỏa đại giai nhiên\nNhiểu biến tam thiên diệc phục nhiên\nNhược vấn vinh hoa bính xuất nhập\nBất như thâu thập uổng lao tâm",
    "Translation": "Củi khô cứu lửa được đâu nào\nÂm ỷ ba ngày bỗng ngút cao\nPhú quí tới lui ai nếu hỏi\nYên thân thu gọn khỏi lao đao",
    "Comment": "Ngàn phương tính kế, Một lần sai trái. Đừng có làm gì, E vướng chẳng may",
    "Divination": "Củi khô cứu hỏa, Việc chi cẩn thận đề phòng",
    "Reference": "Xích Bích hao binh",
    "reference_translated": "Xích Bích kịch chiến (赤壁鏖兵)",
    "reference_detail": "Thời Tam Quốc, Tào Tháo đại quân đóng ở bờ Xích Bích. Tôn Quyền tướng Chu Du, liên minh với Lưu Bị quân chống Tào. Khổng Minh mượn gió Đông, Hoàng Cái dùng lửa đốt liền hoàn thuyền, hai quân giao chiến. Một biển lửa, quân Tào đại bại. Sử gọi là trận Xích Bích. Chú giải: 鏖, âm 'ao', chỉ chiến đấu khổ cực, chết thương nhiều.",
    "Explanation": "Gia đạo hung, Tự thân cầu bảo, Cầu tài ít có, Giao dịch khó, Hôn nhân không hợp, Người đi trễ, Điền vụ bất lợi, Lục súc tổn, Tìm người dò, Kiện tụng thua, Vật thất phương tây, Bệnh lo, Phong thủy bình."
  },
  {
    "ID": "61",
    "Rank": "TRUNG XĂM",
    "Original": "日上吟詩月下歌\n逢場作戲笑呵呵\n相逢會過難藏避\n喝彩唱齊連哩囉",
    "Transliteration": "Nhật Thượng ngâm thi nguyệt hạ ca\nPhùng trường tác hý tếu kha kha\nTương phùng hội quá nan tàng tỵ\nKhác thái xướng tề liên lý la",
    "Translation": "Ngày mãi ngâm thơ tối hát ca\nGặp trò tuồng diễn cười ha ha\nMê ánh đèn màu sao phải tránh\nBắt nhịp đồng ca ta tí ta",
    "Comment": "Người đẹp tại nhà, Ngâm nga thi khúc, Tấm lòng hoan hỷ, Mệnh có họa phúc",
    "Divination": "Thủ cựu tùy ý. Phải đợi thời cát lợi",
    "Reference": "Tô tiểu Muội trách chồng",
    "reference_translated": "Tô Tiểu Muội thử chồng (蘇小妹難夫)",
    "reference_detail": "Thời Tống, Tô Tiểu Muội chính là em gái Tô Đông Pha, uyên bác đa tài. Đêm tân hôn, Tô Tiểu Muội ngâm thơ và ra đối câu. Chuẩn bị ba câu hỏi khó để thử chồng, cố ý làm khó tân lang Tần Thiếu Du, đến câu thứ ba Tần Thiếu Du khổ sở suy nghĩ. May mắn được Tô Đông Pha âm thầm giúp đỡ, mới có thể vào động phòng. Có lời ca ngợi rằng: \"Văn chương từ xưa nói Tam Tô, Tiểu Muội thông minh hơn phu; Ba lần thử tân lang thật kỳ sự, Một gian tài hoa trên đời không có.\"",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài thuận, Hôn nhân thành, Người đi tới, Tìm người có, Điền vụ bình, Lục súc vượng, Kiện tụng hữu lý, Di dời cát, Vật thất hung, Bệnh thuyên giảm, Phong thủy đại cát."
  },
  {
    "ID": "62",
    "Rank": "TRUNG XĂM",
    "Original": "晨昏全赖佛扶持\n須是逢危却不危\n若得貴人相引處\n那時財帛亦相隨",
    "Transliteration": "Thần hôn toàn lại Thánh phò trì\nTu thị phùng nguy khước bất nguy\nNhược đắc quí nhân tương dẫn xứ\nNa thời tài bạch diệc tương tùy",
    "Translation": "Sớm hôm nhờ được Thánh phò trì\nCó gặp chuyện nguy cũng chẳng nguy\nNếu được quí nhân ra hướng dẫn\nTiền tài tơ gấm mặc xài đi",
    "Comment": "Bình bình yên ổn, Bốn phương danh hiển. Thay cũ đổi mới, Chẳng có hung nguy",
    "Divination": "Thần Thánh hộ độ, Việc chi nhẫn nại đại cát",
    "Reference": "Tiên Nhân đắc đạo",
    "reference_translated": "Đường Tăng đắc đạo (唐僧得道)",
    "reference_detail": "Một ngày nọ, Đường Tăng đến bờ sông, nhìn thấy Linh Sơn Phật Tổ ở phía trước, trước mặt có một cây cầu độc mộc, Đường Tăng không dám đi qua. Phật Tổ hóa thân thành người lái thuyền, chống một chiếc thuyền thủng không đáy, Đường Tăng vừa lên thuyền liền ngã xuống sông, được người lái thuyền cứu lên, Đường Tăng từ đó chứng đắc Phật đạo. (Truyện Tây Du Ký). Đường Tăng thỉnh kinh. Đường Tam Tạng, tục danh Trần, tên Y. Sinh ra ở huyện Cầu Thị, Lạc Châu (nay thuộc phía nam thành phố Nghi Dương, Hà Nam). Mười ba tuổi xuất gia, pháp hiệu Huyền Trang. Để cầu lấy kinh điển Phật giáo nguyên bản, vào năm Trinh Quán thứ ba (năm 629) xuất phát từ Trường An (nay là Tây An, Thiểm Tây), mạo hiểm vượt biên giới, trải qua muôn vàn khó khăn gian khổ đến Thiên Trúc (Ấn Độ) thỉnh kinh. Ông đi khắp vùng sông Hằng và sông Ấn cũng như các vùng ven biển đông nam Ấn Độ, sau đó vượt núi Tuyết Sơn và Côn Lôn, đi về hai lần hơn năm vạn dặm, mất 16 năm, cuối cùng vào năm Trinh Quán thứ mười chín (năm 645) trở về Trường An. Mang về số lượng lớn kinh điển Phật giáo, và dịch thành tiếng Trung. (Đường Tam Tạng trải qua hành trình dài đi và về Trung - Ấn, trong đó chắc chắn phải trải qua hiểm nguy, mà có thể bình an trở về, là vì phía sau có thần hộ mệnh vô hình phù trợ).",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài hướng tây, Giao dịch toại, Hôn nhân thành, Người đi trở Điền vụ bình, Lục súc lợi, Tìm người hướng tây, Kiện tụng thua, Di dời thủ cựu, Vật thất có, Bệnh cầu phúc, Phong thủy cát."
  },
  {
    "ID": "63",
    "Rank": "TRUNG XĂM",
    "Original": "昔日行船失了針\n今朝依舊海中尋\n若然尋得原針在\n也費功夫也費心",
    "Transliteration": "Tích nhật hành thuyền thất liễu châm\nKim triêu y cựu hải trung tầm\nNhược nhiên tầm đắc nguyên châm tại\nDẫ phí công phu dã phí tâm",
    "Translation": "Hôm kia thuyền dạo đánh rơi kim\nSáng nay biển rộng biết đâu tìm\nNếu như tìm có ngay nơi cũ\nĐã phí công phu lại phí tim",
    "Comment": "Phúc từ lộc sinh, Lộc là nguồn phúc. Nói cho rỏ ràng, Chỉ nên thủ cựu",
    "Divination": "Bể cả tìm kim. Mọi việc phí hao tâm lực",
    "Reference": "Nữ Oa luyện đá",
    "reference_translated": "Hoàng hiếu tử vạn dặm tìm thân (黃孝子萬里尋親)",
    "reference_detail": "Hoàng Giác Kinh, người Kiến Xương. Năm tuổi, vì loạn lạc mà mất mẹ. Lớn hơn một chút, phát thệ với trời sẽ tụng kinh Phật, để cầu mong nơi ở của mẹ. Bèn vượt sông, đi bộ qua sông Hoài, hành khất đi, mạo hiểm mưa gió, chịu đủ gian khổ, trải qua hai mươi tám năm, đến thôn Xuân, huyện Lương, Nhữ Châu, cuối cùng tìm được mẹ mà trở về.",
    "Explanation": "Gia đạo ít lợi, Tự thân cẩn phòng, Cầu tài có, Giao dịch thành, Hôn nhân không hợp, Người đi trễ, Điền vụ cát, Lục súc đừng nuôi, Tìm người khó, Kiện tụng hòa, Di dời nên Vật thất hung, Bệnh khó, Phong thủy tạm an."
  },
  {
    "ID": "64",
    "Rank": "HẠ XĂM",
    "Original": "游魚却在碧波池\n撞遭羅網四邊圍\n思量無計翻身出\n事到頭來惹是非",
    "Transliteration": "Du ngư khước tại bích ba trì\nChàng tao la võng tứ biên vi\nTư lường vô kế phiên thân xuất\nSự đáo đầu lai nhạ thị phi",
    "Translation": "Sóng xanh ao rộng cá tung tăng\nVướng nhằm lưới cước bốn bề giăng\nNghĩ kế trăm phương sao thoát khỏi\nChuyên thêm rắc rối khó chi bằng",
    "Comment": "Yên thân trong nhà, Họa từ trời xuống. Sớm lo phòng bị, Qua khỏi tai ương",
    "Divination": "Cá bơi vướng lưới. Trăm việc phải đề phòng",
    "Reference": "Mã tiền bạt thủy",
    "reference_translated": "Nước đổ trước ngựa (Nước đã đổ khó hốt) (馬前覆水(覆水難收))",
    "reference_detail": "Thời Hán. Chu Mãi Thần, tự Ông Tử, người Ngô, Cối Kê (nay thuộc thành phố Tô Châu). Mãi Thần tuổi trẻ nhà nghèo chưa thành công, vợ chồng hai người ở trong nhà tranh vách đất nơi ngõ hẻm, chặt củi bán tiền sinh sống. Bán củi mặc cho người ta trả giá, kiếm không được bao nhiêu tiền. Vợ ra ngoài múc nước, thấy một đám trẻ con chế giễu Mãi Thần, vợ cho là đáng xấu hổ, sau đó đã bỏ đi. Chu Mãi Thần năm mươi tuổi, Hán Vũ Đế cầu hiền, phong Chu làm Thái thú Cối Kê. Vợ cũ hối hận vì không có mắt, nguyện làm thiếp, phục vụ Chu trọn đời. Mãi Thần sai vợ cũ múc một xô nước, hất xuống bậc thềm nói: \"Nếu nước có thể hốt lại, hai người chúng ta có thể hòa hợp.\" Thương xót tình nghĩa vợ chồng từng cùng nhau kết tóc, phân cho vợ cũ mảnh đất sau vườn để cày cấy tự ăn. Vợ cũ vì thế nhảy sông tự vẫn.",
    "Explanation": "Gia đạo hung, Tự thân hiểm, Cầu tài hư, Giao dịch trung bình, Hôn nhân không hợp, Người đi trở, Điền vụ tổn, Lục súc suy, Tìm người dò hỏi, Kiện thụng thua, Di dời cát, Thất vật hung, Bệnh hiểm, Phong thủy thay đổi."
  },
  {
    "ID": "65",
    "Rank": "HẠ XĂM",
    "Original": "眼前歡喜末喜歡\n亦不危時亦不安\n割肉成瘡為甚事\n不如守舊待時光",
    "Transliteration": "Nhãn tiền hoan hỷ vị hỷ hoan\nDiệc bất nguy thời diệc bất an\nCắt nhục thành thương vi thẩm sự\nBất như thủ cựu đãi thời quang",
    "Translation": "Vui mừng trước mặt chớ hân hoan\nViệc chẳng nguy tai cũng chẳng an\nCắt da thành thẹo chi đau đớn\nAn thân chờ đợi lúc vinh quang",
    "Comment": "Biết dừng thì dừng, Biết yên thì yên. Như tự cắt thịt, Đau đớn một phen",
    "Divination": "Cắt thịt thành thẹo. Mọi sự thủ cựu chờ thời",
    "Reference": "; Tôn Tẩn khổn Bàng Quyên",
    "reference_translated": "Tôn Tẫn bị Bàng Quyên vây khốn (孫臏困龐涓)",
    "reference_detail": "Thời Chiến Quốc, Tôn Tẫn người nước Tề. Bàng Quyên người nước Ngụy. Cả hai cùng theo Quỷ Cốc Tử làm thầy. Tôn Tẫn học giỏi hơn Bàng Quyên. Bàng Quyên làm tướng nước Ngụy, đấu trí với Tôn Tẫn, thua liền sinh ghen ghét Tôn Tẫn. Liền dùng kế chặt bỏ hai chân Tôn Tẫn, sau đó Tôn Tẫn giả điên, mới có thể chạy thoát. Tề Uy Vương dùng Tôn Tẫn làm quân sư. Dẫn quân tấn công nước Ngụy. Tôn Tẫn dùng kế giả vờ giảm bếp, ngầm tăng quân, lừa Bàng Quyên, Bàng Quyên đuổi đến đường Mã Lăng. Bị phục binh dùng cung tên bắn chết.",
    "Explanation": "Gia đạo không an, Tự thân khẩu thiệt, Cầu tài bất lợi, Giao dịch gặp tiểu nhân, Hôn nhân không bền, Người đi trở, Điền vụ tổn, Lục súc suy, Tìm người sai, Kiện tụng thua, Di dời y cựu, Vật thất khó, bệnh khó, Phong thủy thay đổi.眼"
  },
  {
    "ID": "66",
    "Rank": "HẠ XĂM",
    "Original": "路險馬矮人急方\n失群軍卒困相當\n灘高風浪船槕破\n日暮花殘天佭霜",
    "Transliteration": "Lộ hiểm mã nuy nhân cấp phương\nThất quân quân tốt khổn tương đương\nThan cao phong lãng thuyền trạo phá\nNhật mộ hoa tàn thiên giáng sương",
    "Translation": "Lộ hiểm người đi ngựa lại gầy\nQuân kia lạc ngủ địch bao vây\nBải cạn sóng cao thuyền chạm vỡ\nChiều dần sương phủ hoa tàn bay",
    "Comment": "Giử y thủ cựu, Yên tịnh không lổi. Chẳng cầu mưu sự, Tự có tin vui",
    "Divination": "Vướng cạn bể thuyền. Mọi việc hiểm nên đề phòng",
    "Reference": "Bá Vương bị vây",
    "reference_translated": "Sở Bá Vương lạc đường ở Âm Lăng (楚霸王陰陵失道)",
    "reference_detail": "Đầu năm 202 TCN, quân Hán với tổng cộng bốn mươi vạn quân đã bao vây quân của Hạng Võ, vốn đang thiếu lương thực, tại Cái Hạ. Quân Hán còn cho binh lính hát bằng giọng địa phương của Sở, khiến quân Hạng Võ lầm tưởng quê hương của họ đã bị quân Hán chiếm đóng. Chiến thuật tâm lý 'Tứ diện Sở ca' này đã khiến quân đội của Hạng Võ tan rã tinh thần.\nThế là Hạng Võ dẫn theo hơn tám trăm kỵ binh tinh nhuệ quyết định đột phá vòng vây, còn quân Hán thì Doanh Yêu dẫn năm ngàn kỵ binh truy đuổi gắt gao. Sau khi vượt sông Hoài, kỵ binh của Hạng Võ chỉ còn lại hơn một trăm người.\nHạng Võ trên đường đến Âm Lăng thì bị lạc đường, ông hỏi đường ra sông bên đường từ một người nông dân. Không ngờ, đi theo hướng lão nhân chỉ, ông lại rơi vào đầm lầy khó di chuyển, suýt bị quân Lưu Bang đuổi kịp. Cuối cùng, Hạng Võ đến Ô Giang, biết đại thế đã mất, vì không còn mặt mũi nào gặp lại người Giang Đông, ông bèn tự sát.",
    "Explanation": "Gia đạo sầu nghi, Tự thân tai hao, Cầu tài thất, Giao dịch bại, Hôn nhân không bền, Người đi trở, Điền vụ lục súc tổn, Tìm người dò, Kiện tụng thua, Di dời chớ động, Bệnh giảm, Phong thủy bất lợi."
  },
  {
    "ID": "67",
    "Rank": "THƯỢNG XĂM",
    "Original": "ㄧ條金線秤君心\n無減無增無重輕\n為人心正平生日\n文章全具藝光明",
    "Transliteration": "Nhất điều kim tuyến xứng quân tâm\nVô giảm vô tăng vô trọng khinh\nVi nhân tâm chính bình sinh trực\nVăn chương toàn cụ nghệ quang minh",
    "Translation": "Tơ vàng một sợi thử lòng chàng\nBớt thêm nặng nhẹ vẫn bằng ngang\nLàm người chính trực cần phải giử\nTron bộ văn chương ngời ánh quang",
    "Comment": "Bình tâm chính trực, Sau được thanh bình. Nên dựa chính mình, Thiên hạ an vui",
    "Divination": "Tâm bình chính trực, Mọi việc bình ổn vô hung",
    "Reference": "Kim Tinh độ Đậu Nhi",
    "reference_translated": "Kim Tinh thử Đậu Nhi (金精試竇兒)",
    "reference_detail": "Đậu Nhan Sơn hành thiện tích đức, sau sinh năm con trai, đều thành đạt. Thượng thiên muốn thử một trong những người con của ông là Đậu Nghi, phái Kim Tinh giả làm thiếu nữ để dụ dỗ Đậu Nghi, nhưng Đậu Nghi không hề lay động. Sau này, Đậu Nghi thấy thiếu nữ hóa thành ánh vàng bay vào lòng đất, ông đào đất lên và phát hiện một thỏi vàng.\n(Câu chuyện này ca ngợi phẩm hạnh của Đậu Nghi, không bị sắc đẹp cám dỗ.)",
    "Explanation": "Gia đạo an, Tự thân bình, Cầu tài thận trọng, Giao dịch ổn, Hôn nhân hợp, Người đi có tin, Điền vụ ổn, Lục súc an, Tim người thấy, Kiện tụng hòa, Di dời thủ cựu, Vật thất có, Bệnh cầu phúc,Phong thủy bình."
  },
  {
    "ID": "68",
    "Rank": "THƯỢNG XĂM",
    "Original": "門延吉慶喜非常\n積善之家大吉昌\n田蠶諸事婚姻遂\n病逢妙藥即安康",
    "Transliteration": "Môn diên cát khánh hỷ phi thường\nTích thiện chi gia đại cát xương\nĐiền tàm chư sự hôn nhân toại\nBệnh phùng diệu dược tức an khương",
    "Translation": "Cửa nhà tích thiện đại phồn vinh\nMừng vui nối tiếp sắc thêm xinh\nĐiền vụ hôn nhân đều toại ý\nThuốc hay đuổi bệnh chóng khương ninh",
    "Comment": "Mùa xuân nắng ấm, Trăm hoa đua nở. Việc đừng để chậm, Theo người hiển đạt ",
    "Divination": "Trăm hoa xuân thơ mộng. Phàm việc gì gặp được quý nhân đều may mắn, tốt lành.",
    "Reference": "Quách Tử Nghi chúc thọ",
    "reference_translated": "Quách Tử nghi chúc chọ (郭汾陽祝壽)",
    "reference_detail": "Đại tướng quân nhà Đường, Phấn Dương Vương - Quách Tử Nghi, tổ chức sinh nhật lớn (làm tiệc mừng thọ). Họ hàng thân thích đến chúc mừng, không khí vui vẻ, tràn ngập hỷ khí.",
    "Explanation": "Gia đạo vượng, Tự thân an, Cầu tài xuân vượng, Giao dịch toại, Hôn nhân thành, Người đi tới, Điền vụ lợi, Lục súc vượng, Tìm người có, Kiện tụng thắng, Di dời như ý, Vật thất gấp tìm, Bệnh an, Phong thủy cát."
  },
  {
    "ID": "69",
    "Rank": "TRUNG XĂM",
    "Original": "冬來嶺上ㄧ枝梅\n葉落枝枯總不嶊\n但得陽春帩急至\n依然還我作花魁",
    "Transliteration": "Đông lai lãnh thượng nhất chi mai\nDiệp lạc chi khô tổng bất thôi\nĐản đắc dương xuân tiêu cấp chí\nY nhiên hoàn ngã tác hoa khôi",
    "Translation": "Đông về đỉnh núi một cành mai\nCành khô lá rụng chẳng lung lay\nNắng ấm gió xuân rồi sẽ tới\nTrả ngay danh hiệu hoa khôi này",
    "Comment": "Tên bắn lên không, Thấy không chẳng không. Đợi mùa xuân tới, Xinh tươi sắc màu",
    "Divination": "Hoa mai chiếm khôi. Việc phải chờ mới đại cát",
    "Reference": "Mai khai nhị độ",
    "reference_translated": "Mai Khai Nhị Độ (梅開二度)",
    "reference_detail": "Trong thời gian vua Đường Đức Tông trị vì, trung thần Mai Bá Cao cùng gia đình bị gian thần Lư Kỷ hãm hại, cả nhà bị xử tử, chỉ có con trai là Mai Lương Ngọc may mắn trốn thoát. Sau này, anh ta đổi tên thành Vương Hỉ Đồng để che mắt. Anh ta lang thang một mình trên đường phố, đói rét cùng cực, may mắn được Trần Nhật Thăng (Trần Đông Sơ) thu nhận. Trần Nhật Thăng không biết thân phận của anh ta, nhờ anh ta giúp trông coi vườn mai của phủ Trần, mới không chết đói trên đường.\nTrần Nhật Thăng là bạn học cũ của Mai Bá Cao. Khi Mai Bá Cao bị Lư Kỷ bức hại, chính Trần Nhật Thăng đã cứu Mai Bá Cao, cũng vì thế mà Mai Bá Cao và Lư Kỷ kết thù, cuối cùng cả gia đình bị xử tử. Trần Nhật Thăng vì vậy mà bi phẫn xen lẫn, từ quan, dắt cả gia đình về ẩn cư ở Dương Châu.\nTrần Nhật Thăng có con gái tên Trần Hạnh Nguyên, có nhan sắc quốc sắc thiên hương. Sau khi Mai Lương Ngọc đến nhà họ Trần, hai người yêu nhau ngay từ cái nhìn đầu tiên. Vào một ngày mai nở rộ, cũng là ngày giỗ của Mai Bá Cao, Trần Nhật Thăng cùng gia đình tại vườn mai của nhà mình lập đàn tưởng nhớ người bạn quá cố kiêm ân nhân. Không ngờ, trời bỗng nhiên thay đổi, gió lớn tuyết rơi, phá hủy hết tất cả hoa mai. Trần Nhật Thăng cảm khái bản thân có thể an toàn thoát ra, nhưng lại không cứu được hậu nhân của nhà họ Mai, cho rằng đây là lời cảnh báo của Thượng thiên, vì vậy ông thề, trừ khi hoa mai nở lại, chứng minh hậu nhân nhà họ Mai còn sống trên đời, nếu không ông sẽ xuất gia, cạo đầu làm tăng.\nCon gái ông là Hạnh Nguyên nghe thấy, lập tức dâng hương thành tâm cầu nguyện Thượng thiên cho hoa mai nở lại. Sự chân thành của họ đã cảm động Thượng thiên, tất cả cây mai trong vườn mai đều nở hoa trở lại. Sau này, Trần Nhật Thăng biết được Hỉ Đồng chính là Lương Ngọc, bèn gả con gái Hạnh Nguyên cho anh.",
    "Explanation": "Gia đạo thiếu lợi, Tự thân làm phúc, Cầu tài cẩn thận, Giao dịch đợi thời, Hôn nhân trễ, Người đi lâu tới, Tìm người có, Điền vụ lục súc vượng, Kiện tụng thua, Vật thất hướng đông, Bệnh lo, Phong thủy cải sửa."
  },
  {
    "ID": "70",
    "Rank": "HẠ XĂM",
    "Original": "朝朝恰是采花蜂\n飛出西南又走東\n春盡花殘無覓處\n此心不變舊行踪",
    "Transliteration": "Triêu triêu kháp tự thái hoa phong\nPhi xuất tây nam hựu tẩu đông\nXuân tận hoa tàn vô mịch xứ\nThử tâm bất biến cựu hành tung",
    "Translation": "Như ong tìm mật ngọt hàng ngày\nVượt qua nam bắc lại đông tây\nXuân tàn hoa rụng nơi nào kiếm\nĐôi cánh mỏng ngày bay vẫn bay",
    "Comment": "Cuối cùng xuân đến, mưa lâu không tạnh. Muốn mưu việc gì, chẳng bằng yên tịnh",
    "Divination": "Ong tìm mật hoa, Mọi việc lao tâm phí lực",
    "Reference": "Lý Mật phản Đường",
    "reference_translated": "Lý Mật phản Đường (李密反唐)",
    "reference_detail": "Lý Mật (582-619), lãnh đạo cuối thời quân khởi nghĩa nông dân cuối đời Tùy Trung Quốc, quân Ngõa Cương. Biệt danh Pháp Chủ. Quê ở Trường An, Kinh Triệu, tổ tịch Liêu Đông Tương Bình (nay là phía nam Liêu Dương, Liêu Ninh).\nNăm Đại Nghiệp thứ chín (613), ông tham gia cuộc khởi nghĩa phản Tùy của Dương Huyền Cảm tại Lịch Dương (nay là đông bắc Tuấn Huyện, Hà Nam). Sau khi Huyền Cảm thất bại, Lý Mật bỏ trốn. Năm Đại Nghiệp thứ mười hai, ông gia nhập quân Ngõa Cương.\nLý Mật giỏi mưu lược. Tháng Mười năm Đại Nghiệp thứ mười hai, Lý Mật khuyên Trạch Nhượng tấn công tướng hung hãn của quân Tùy là Thứ sử Dĩnh Dương là Trương Tu Đà, đại phá quân Tùy và giết chết Trương Tu Đà. Sau đó, ông đề nghị tấn công kho Hưng Lạc (sau đổi là Lạc Khẩu), mở kho cứu tế, chiêu mộ quân lính, quân Ngõa Cương nhanh chóng lớn mạnh. Từ năm Đại Nghiệp thứ mười ba, dưới sự lãnh đạo của Lý Mật, quân Ngõa Cương xảy ra xung đột với Trạch Nhượng về vấn đề xử lý quan lại Tùy đầu hàng và phân chia quân lương, Lý Mật đã giết Trạch Nhượng cùng hàng trăm người đi theo.\nTháng Ba năm Đại Nghiệp thứ mười bốn, Vũ Văn Hóa Cập giết Tùy Dương Đế, dẫn hơn mười vạn quân về phía tây. Lý Mật được lệnh thảo phạt Hóa Cập. Tuy Hóa Cập bị đánh bại, nhưng binh lực của Lý Mật cũng tổn thất nặng nề. Sau đó, ông bị Vương Thế Sung truy kích, quân đội Lý Mật đại bại, bản doanh bị tiêu diệt, các tướng thân cận như Tần Thúc Bảo, Trình Tri Tiết (tên ban đầu là Trình Diêu Kim), Ngưu Tiến Đạt bị bắt, Đơn Hùng Tín đầu hàng.\nLý Mật không còn đường lui, bèn tháng Chín vượt sông đến Hà Dương đầu hàng nhà Đường. Tháng Mười một, Đường Cao Tổ phái Lý Mật cùng những người khác đến Sơn Đông chiêu mộ bộ hạ cũ. Ông cảm thấy bị nghi ngờ nên đã phản lại nhà Đường. Quan quân nhà Đường là Thịnh Ngạn Sư phục kích, chém Lý Mật tại Hình Công Tiệm.",
    "Explanation": "Gia đạo khẩu thiệt, Tự thân tiểu nhân, Cầu tài hao, Giao dịch phản phúc, Hôn nhân không bền, Người đi tra dò, Điền vụ lục súc tổn, Tìm người không, Kiện tụng thua, Vật thất không ; Bệnh trở, Di dời thủ cựu, Phong thủy sửa đổi."
  },
  {
    "ID": "71",
    "Rank": "TRUNG XĂM",
    "Original": "誰曉蒼龍十九衝\n女子當年嫁二夫\n自是ㄧ弓架兩箭\n馬龍切恐上安居",
    "Transliteration": "Thùy hiểu thương long thập bát xung\nNữ tử đương niên giá nhị phu\nTự thị nhất cung giá lưỡng tiễn\nMã long thiết khủng thượng an cư",
    "Translation": "Rồng xanh ai rỏ vượt ngàn trùng\nGái hai lần gã nhất niên trung\nNgựa phi nước đại đâu yên ổn\nVí tựa hai tên lắp một cung",
    "Comment": "Trùng trùng chẳng khỏi, Mọi sự do trời.Khéo lựa lời hay, Thư cựu cẩn phòng",
    "Divination": "Một cung lắp hai tên. Mọi việc tái hợp mới tốt.",
    "Reference": "Văn Quân thăm Tương Như",
    "reference_translated": "Văn Quân thăm Tương Như (文君訪相如)",
    "reference_detail": "Trác Văn Quân là con gái của Trác Vô Tôn, một thương gia giàu có ở Lâm邛 (Thục, nay thuộc tỉnh Tứ Xuyên), Trung Quốc. Bà tinh thông âm luật, có tiếng tăm về văn chương. Năm mười sáu tuổi, bà kết hôn, vài năm sau chồng qua đời, bà trở về nhà mẹ sống góa bụa.\nMột ngày nọ, Tư Mã Tương Như đến nhà Trác Vô Tôn dự tiệc, biết Trác Văn Quân mới góa chồng, ông đã đánh một khúc 'Phượng cầu hoàng', bày tỏ tình yêu. Trác Văn Quân từ lâu đã nghe danh Tư Mã Tương Như, và buổi tiệc này càng khiến bà rung động trước ông. Mặt khác, sau khi buổi tiệc kết thúc, Tư Mã Tương Như đã dùng nhiều tiền mua chuộc người hầu gái thân cận của Trác Văn Quân, để cô này truyền đạt tình yêu của Tư Mã Tương Như đối với Trác Văn Quân. Trác Văn Quân biết Tư Mã Tương Như yêu mình qua người hầu gái, bà lập tức đến trạm dịch nơi Tư Mã Tương Như ở, Tư Mã Tương Như thấy Trác Văn Quân đến, cũng lập tức cùng bà đêm đó bỏ trốn về quê nhà Thành Đô.\nỞ Thành Đô, vợ chồng lâm vào cảnh nghèo khó, đành quay về Lâm邛 mở quán rượu nhỏ để sinh sống. Trác Văn Quân bán rượu, Tư Mã Tương Như rửa bát, cuộc sống vất vả. Cha của Trác Văn Quân là Trác Vô Tôn biết chuyện, dưới sự khuyên can của bạn bè, ông đồng ý cấp tiền cho họ, nhờ vậy Tư Mã Tương Như mới có thể trở về Thành Đô sinh sống cùng Trác Văn Quân, sau này trở nên giàu có.",
    "Explanation": "Gia đạo tổn, Tự thân thị phi, Tài hao lực, Giao dịch cẩn phòng, Hôn nhân tái hợp, Người đi trở, Điền vụ trễ thu, Lục súc tổn, Tim người có, Kiện tụng thua, Bệnh cầu phúc, Di dời sửa, Phong thủy sửa đổi."
  },
  {
    "ID": "72",
    "Rank": "TRUNG XĂM",
    "Original": "養蜂須用求他蜜\n只怕觸遭毛上針\n須是眼前有异路\n暗里染如荊棘林",
    "Transliteration": "Dưỡng phong tu dụng cầu tha mật\nChỉ phá súc tao mao thượng châm\nTu thị nhãn tiền hữu dị lộ\nÁm lý nhiễm như kinh cức lâm",
    "Translation": "Nuôi ong dùng sáp mật ngọt ngào\nE rằng kim độc chạm vào đau\nTrước mặt đường đi năm bảy nẻo\nKia kìa gai nhọn ẩn trong sâu",
    "Comment": "Chuyện nên tỉ mĩ, Không được cưỡng cầu. Nuôi ong lấy mật, Có nhiều lại lo",
    "Divination": "Nuôi ong lấy mật, mọi việc lao tâm",
    "Reference": "Vương Mãng cầu hiền",
    "reference_translated": "Vương Mãng cầu hiền (王莽求賢)",
    "reference_detail": "Thời Tây Hán, gia tộc Vương Mãng có thể nói là một gia tộc danh giá. Mặc dù cha ông mất sớm, nhưng các chú bác của ông trong thời Hán Thành Đế đều lần lượt làm tướng, làm quan, được phong hầu ban thưởng, gia tộc họ Vương cực kỳ hiển hách.\nNhưng bản thân Vương Mãng lại có một gia đình nhỏ rất khốn khó; cha mất sớm, ông chỉ nương tựa vào mẹ, sống nhờ vào sự giúp đỡ của họ hàng. Chính vì vậy, Vương Mãng từ nhỏ đã rèn luyện được một bộ kỹ năng đối nhân xử thế. Bất kể trong lòng có buồn bã hay tức giận đến đâu, trước mặt họ hàng trưởng bối hay người ngoài, ông đều tỏ ra vô cùng vui vẻ, hòa nhã, vì vậy rất được người trong tộc yêu quý.\nCó một lần, người chú cả của ông bị bệnh nặng, ông nghe tin liền đến bên giường bệnh chăm sóc, dâng thuốc đưa nước, canh giữ suốt đêm, mấy tháng liền không rời đi, tóc tai bù xù, tiều tụy, thậm chí còn 'bệnh' hơn cả người bệnh, còn 'hiếu thảo' hơn cả con ruột.\nVì vậy, cả tộc đều khen ngợi, dâng thư lên xin triều đình ban thưởng cho ông.\nThế là Hán Thành Đế phong cho ông tước hiệu Tân Đô Hầu, mệnh ông làm thị vệ trong cung, trở thành một cận thần bên cạnh Hoàng đế.\nĐịa vị cao, quyền lực lớn, nhưng Vương Mãng không bao giờ tỏ ra kiêu ngạo hay lơ là, ngược lại càng thêm khiêm cung lễ phép, một mặt rộng kết giao với các công khanh tướng lĩnh, danh sĩ đại nho, mặt khác lại cứu tế người nghèo, khinh tài trọng nghĩa. Còn bản thân thì sống vô cùng giản dị, thường chỉ ăn rau dưa, không mặc lễ phục áo rộng tay dài, chỉ mặc trang phục ngắn. Vì vậy, mọi người trong triều đình và ngoài xã hội đều dùng một chữ 'hiền' để ca ngợi ông.\nSau này, chú của ông, Đại Tư Mã Vương Căn mất, lúc lâm chung tiến cử ông thay thế. Hoàng đế và các đại thần đều cho rằng ông là người thích hợp nhất. Thế là, chỉ mới ba mươi tám tuổi, Vương Mãng đã trở thành Đại Tư Mã, nắm giữ quyền quân sự cao nhất toàn quốc.\n(Câu chuyện này ví von, giỏi đối nhân xử thế, có thể giúp bạn thoát khỏi 'khó khăn như bị ong chích', và đạt được điều mong muốn.)",
    "Explanation": "Gia đạo thiếu lợi, Tự thân cần phòng, Cầu tài trở, Giao dịch chậm, Hôn nhân cách trở, Điền vụ lục súc thâu ít, Người đi trễ, Tìm người khó, Kiện tụng thua, Di dời chớ động, Vật thất hung, Bệnh thuyên giảm, Phong thủy đại cát."
  },
  {
    "ID": "73",
    "Rank": "THƯỢNG XĂM",
    "Original": "春來雷震百蟲鳴\n翻身ㄧ轉離泥中\n始知出入還來往\nㄧ朝變化便成龍",
    "Transliteration": "Xuân lai lôi chấn bá trùng minh\nPhiên thân nhất chuyển ly nê trung\nThủy tri xuất nhập hoàn lai vãng\nNhất triêu biến hóa tiện thành long",
    "Translation": "Xuân đến sấm rền rộ tiếng kêu\nChuyễn mình trời đất dạo tiêu diêu\nCôn trùng bay lượn nào ai hiểu\nHóa rồng ngày tới vượt vân tiêu",
    "Comment": "Sấm vang chuyển mùa, Ra vào đều sống. Có ngày biến hóa, Lên tới thiên môn",
    "Divination": "Sấm phát bá trùng, Mọi việc gặp quí nhân đại cát.",
    "Reference": "Trần kiều binh biến",
    "reference_translated": "Trần Kiều binh biến (陳橋兵變)",
    "reference_detail": "Năm Công Nguyên 959, Chu Thế Tông Sài Vinh chết, Vua Cung 7 tuổi lên ngôi. Lúc đó, Triệu Khuông Dận, người giữ chức Điện Tiền Đô Kiểm điểm, Tiết độ sứ Tống Châu Quy Đức quân, nắm thực quyền.\nNăm Công Nguyên 960 mùa xuân, Trấn Châu (nay là Chính Định, Hà Bắc) và Định Châu (nay là Định Huyện, Hà Bắc) báo cáo rằng quân Bắc Hán và quân Khiết Đan liên minh nam tiến, tấn công Hậu Chu, thế mạnh, xin phái quân đến viện trợ. Triều đình Hậu Chu bèn hạ lệnh cho Triệu Khuông Dận dẫn quân bắc tiến chống địch. Triệu Khuông Dận dưới sự chỉ đạo bí mật của em trai Triệu Quang Nghĩa và Triệu Phổ, Thạch Thủ Tín, đã bí mật hành động.\nNgày 3 tháng 2, quân đội đến Trần Kiều Dịch (nay là đông nam Trần Kiều Trấn, huyện Phì Châu, Hà Nam) thì phát động binh biến, sai người mặc hoàng bào lên người ông, phản lại Hậu Chu, tôn Triệu Khuông Dận làm Hoàng đế. Sau đó, Triệu dẫn quân quay về kinh đô Khai Phong, không đốt phá, không cướp bóc, 'Thái Tổ Trần Kiều binh biến, cùng chúng lập lời thề không được kinh động dân chúng; ngày vào thành, chợ không thay đổi hoạt động'.\nNgày mùng ba Triệu Khuông Dận Trần Kiều binh biến trở về kinh, Phạm Chất cùng Vương Phổ, Nguỵ Nhân Phổ chất vấn Triệu Khuông Dận, La Ngạn Hoàn trước trướng rút kiếm quát: 'Tam quân không chủ, chúng tướng bàn lập Kiểm điểm làm Thiên tử, có lời dị nghị nữa thì chém!'. Vương Phổ mặt như đất, bước xuống bái, Phạm Chất cũng bái, Khuông Dận đích thân đỡ dậy, dùng lễ nghi ưu đãi.\nSau cuộc kháng cự không quá kịch liệt, Hậu Chu Cung Đế nhường ngôi, Triệu Khuông Dận lên ngôi Hoàng đế, 'Thái Tổ sắp nhận thiện vị, chưa có văn thư thiện vị, Học sĩ Hàn lâm Thừa chỉ Đào Cốc ở bên cạnh, lấy ra từ trong tay mà tiến dâng, nói: 'Đã thành rồi'.\nTriệu Khuông Dận lên ngôi, đổi quốc hiệu là Tống, đổi niên hiệu là Kiến Long, định đô ở Khai Phong. Thạch Thủ Tín, Cao Hoài Đức, Trương Lệnh Đạc, Vương Thẩm Kỳ, Trương Quang Hàn, Triệu Ngạn Huy đều được ban chức Tiết độ sứ. Sử gọi là 'Trần Kiều binh biến'.\nWikipedia\n(Câu chuyện này đại diện cho sự khởi đầu của Triệu Khuông Dận.)",
    "Explanation": "Gia đạo cầu phúc, Tự thân bình, Cầu tài xuân lợi, Giao dịch quí nhân, Hôn nhân thành, Người đi tới, Điền vụ sớm thu, Lục súc xuân lợi, Tìm người thấy, Kiện tụng thắng, Di dời cát, Bệnh âm trở, Phong thủy cát."
  },
  {
    "ID": "74",
    "Rank": "HẠ XĂM",
    "Original": "自鵠飛來自入籠\n欲得翻身却不通\n東西南北都難出\n此卦恨成恐困窮",
    "Transliteration": "Tự hộc phi lai tự nhập lung\nDục đắc phiên thân khước bất thông\nĐông tây nam bắc đô nan xuất\nThử quẻ hận thành khủng khốn cùng",
    "Translation": "Thiên nga bay tới tự vào lồng\nBốn hướng trở mình thoát chẳng xong\nQuer này nếu có người xin được\nLo sợ âu sầu cũng như không",
    "Comment": "Tiến thân thời được, Thối lui là khó. Chẳng cần lo nghĩ, Biết việc ở trong",
    "Divination": "Chim hộc vào lồng, Mọi việc đa hư thiếu thật",
    "Reference": "Tần bại cầm tam soái",
    "reference_translated": "Tần Bại cầm tam soái (秦敗擒三帥)",
    "reference_detail": "Tần Mục Công không nghe lời khuyên của lão thần Tiễn Công, sai quân đội tấn công Trịnh Quốc, và đại chiến với quân Tấn tại Diêu (nay ở giữa huyện Lạc Ninh và huyện Thiểm, tỉnh Hà Nam, Trung Quốc).\nQuân đội nhà Tấn dụ quân đội Tần vào thung lũng nguy hiểm, đường phía trước bị chặn. Hai bên sườn quân Tấn ném mồi lửa, lưu huỳnh, diêm sinh, phía sau quân Tấn hô vang trời. Quân Tần tự giẫm đạp lẫn nhau, chết và bị thương vô số.\nKhông địch nổi và bị đại bại, ba đại nguyên soái đều bị bắt sống.",
    "Explanation": "Gia đạo bất an, Tự thân khó, Cầu tài tiểu nhân, Giao dịch hao, Hôn nhân quan hình, Người đi trở, Kiện tụng họa, Điền vụ thất, Lục súc ôn dịch, Tìm người dò, Di dời bất lợi, Vật thất hung, Bệnh thuyên an, Phong thủy tuyệt lộ."
  },
  {
    "ID": "75",
    "Rank": "TRUNG XĂM",
    "Original": "恰如抱虎過高山\n戰戰兢兢膽碎寒\n不覺忽然徙好事\n切須保守ㄧ安身",
    "Transliteration": "Kháp như bảo hổ quá cao san\nChiến chiến căn căn đảm toái hàn\nBất giác hốt nhiên đồ hảo sự\nThiết tu bảo thủ nhất an thân",
    "Translation": "Ví như ôm cọp vượt qua đèo\nSợ nát tim gan mật lạnh teo\nBỗng ý muốn mưu làm việc lớn\nThủ phận an thân thoát hiểm nghèo",
    "Comment": "Nguy nguy hiểm hiểm, Phía trước có trở. Ca viện mưu sự, Sau càn thêm khổ",
    "Divination": "Ôm cọp qua núi, Mọi việc hung hiểm lo sợ",
    "Reference": "Ngũ Viên đêm xuất Chiêu Quan",
    "reference_translated": "Ngô Viên đêm xuất Chiêu Quan (Ngô Tử Tư Vượt Chiêu Quan) (伍員夜出昭關（伍子胥過)",
    "reference_detail": "Ngô Tử Tư, người nước Sở thời Xuân Thu. Lúc đó Sở Bình Vương muốn truy sát ông. Sở Bình Vương treo thưởng bắt Ngô Tử Tư, vẽ chân dung ông và dán ở cửa thành khắp nước Sở, dặn dò quan lại kiểm tra gắt gao. Ngô Tử Tư chạy đến Chiêu Quan, biên giới hai nước Ngô và Sở, quan chức ở Chiêu Quan kiểm tra rất nghiêm ngặt. Ông lo lắng đến mấy đêm không ngủ được, tóc cũng bạc trắng. May mắn gặp được một người tên Đông Cao Công, rất cảm thông cho hoàn cảnh của ông, đưa ông về nhà ẩn náu. Đông Cao Công có một người bạn có chút giống Ngô Tử Tư, Đông Cao Công cho người bạn đó giả làm Ngô Tử Tư vượt quan. Quan giữ cửa bắt được Ngô Tử Tư giả, còn Ngô Tử Tư thật vì tóc đã bạc trắng, quan chức giữ cửa nhận không ra, nên đã cho ông vượt qua.\nSau này, ông an toàn chạy sang nước Ngô.\n(Dùng bạn bè có ngoại hình giống thay thế Ngô Tử Tư, còn bản thân thì tóc bạc trắng, là 'bàn tay khéo léo' của câu chuyện này.)",
    "Explanation": "Giao đạo cầu khấn, Tự thân đề phòng, Cầu tài cẩn thận, Giao dịch trễ, Hôn nhân khó thuận, Người đi trở, Điền vụ bình,Lục súc tổn, Tìm người dò, Kiện tụng thua, Vật thất khó, Bệnh tế hổ, Di dời thủ cựu, Phong thủy hung."
  },
  {
    "ID": "76",
    "Rank": "TRUNG XĂM",
    "Original": "魚龍混雜意相同\n耐守深潭待運通\n不覺ㄧ朝頭聳出\n禹門ㄧ跳過龍宮",
    "Transliteration": "Ngư long hỗn tạp ý tương đồng\nNại thủ thân đàm đãi vận thông\nBất giác nhất triêu đầu tủng xuất\nVũ môn nhất khiếu quá long môn",
    "Translation": "Rồng cá đầm sâu nương náo chung\nĐợi thời đôi ý hợp vô cùng\nMột sớm non cao đây vượt khỏi\nCửa vũ qua rồi tới long cung",
    "Comment": "Tuy là cơ bản, Cũng phải chờ thời. Tính mưu do mình, Chớ có làm sai",
    "Divination": "Ngư long vị biến. Mọi việc chờ thời tới",
    "Reference": "Hồng Võ xem ngựa",
    "reference_translated": "Hồng Võ chăn trâu (洪武看牛)",
    "reference_detail": "Chu Nguyên Chương, người Phượng Dương, huyện Hoài Viễn, tỉnh An Huy, thời nhà Nguyên. Ông sinh ra trong một gia đình nông dân nghèo khổ, vì quá nghèo nên không thể đi học, từng làm người chăn trâu cho địa chủ. Đến năm thứ tư niên hiệu Chí Chính (1344), đại hạn hán ở Hoài Bắc, cha mẹ và anh trai của Chu Nguyên Chương lần lượt qua đời, ông không còn cách nào khác đành phải vào chùa Hoàng Giác làm tiểu hòa thượng. Chưa đầy hai tháng sau khi vào chùa, vì năm mất mùa khó thu thuế chùa, chủ chùa đóng cửa kho đuổi chúng tăng, Chu Nguyên Chương đành phải rời quê hương làm tăng lữ (hòa thượng sống bằng nghề ăn xin). Sau này, Chu Nguyên Chương trở thành Minh Thái Tổ, là \"Hoàng đế bình dân\" trong lịch sử Trung Quốc, niên hiệu \"Hồng Võ\". (Câu chuyện này ẩn dụ rằng sự bình thường nhất thời không có nghĩa là tương lai cũng vậy, đó là do thời cơ chưa đến.)",
    "Explanation": "Gia đạo bình an, Tự thân khang thái, Cầu tài có, Giao dịch chờ thời, Hôn nhân trễ hợp, Người đi trở, Điền vụ muộn, Tìm người không gặp, Kiện tụng kéo dài, Di dời thủ cựu, Bệnh trở, Phong thủy phát."
  },
  {
    "ID": "77",
    "Rank": "TRUNG XĂM",
    "Original": "夢中説得是多財\n聲名雲外總虚來\n水遠山遥難信實\n貴人點指笑顏開",
    "Transliteration": "Mộng trung thuyết đắc thị đa tài\nThanh danh vân ngoại tổng hư lai\nThủy viễn sơn dao nan tín thật\nQúi nhân điểm chỉ tếu nhan khai",
    "Translation": "Nằm mơ thấy được bạc vàng nhiều\nTuổi tên như gió mây phiêu diêu\nNước non xa thẵm đâu tin thật\nQúi nhân chỉ giúp sắc vui nhiều",
    "Comment": "Chỉ là mộng mơ, chớ trông thanh danh. Nhớ chờ thời tốt, Qúi nhân chỉ cho",
    "Divination": "Mộng trung được bảo. Mọi việc thật ít hư nhiều",
    "Reference": "Ngọc bích về Triệu",
    "reference_translated": "Vớ Ngọc về Triệu (Hoàn bích quy Triệu) (捧璧歸趙(完璧歸趙))",
    "reference_detail": "Năm 283 TCN, Triệu Huệ Văn Vương có được Hòa Thị Bích của nước Sở. Tần Chiêu Tương Vương nghe tin, sai người gửi thư cho Triệu Vương, nói rằng sẵn sàng đổi mười lăm tòa thành lấy Hòa Thị Bích. Lận Tương Như phân tích với Triệu Vương rằng Tần mạnh Triệu yếu, không thể không đổi. Triệu Vương bèn sai Lận Tương Như mang Hòa Thị Bích sang Tần. Tần Vương tiếp Lận Tương Như tại Chương Đài, Lận Tương Như dâng ngọc cho Tần Vương. Tần Vương mừng rỡ, truyền ngọc cho các mỹ nhân và tùy tùng xem. Lúc này mọi người đều hô vạn tuế. Lận Tương Như nhận thấy Tần Vương không có ý định trao đổi thành trì cho Triệu quốc, bèn nói với Tần Vương rằng ngọc có tì vết, muốn chỉ ra cho Tần Vương xem, nhân cơ hội lấy lại ngọc. Sau khi lấy lại Hòa Thị Bích, Lận Tương Như đứng cạnh cột lớn, tỏ thái độ muốn cùng ngọc chết. Lúc này Lận Tương Như nói với Tần Vương: \"Triệu Vương trong chúng thần dị nghị vẫn bác bỏ ý kiến của mọi người, chấp nhận đề nghị của thần, dù giao du với dân thường cũng không lừa dối, huống chi Tần quốc là một nước lớn! Triệu Vương vì muốn gìn giữ tình hữu nghị Tần-Triệu, sau khi trai giới năm ngày đã phái thần mang ngọc sang Tần. Tiếc rằng Tần Vương không những không có ý định trao đổi thành trì cho Triệu quốc, mà còn truyền ngọc cho các mỹ nhân, thật là chế giễu thần.\" Nói xong, Lận Tương Như làm bộ dáng muốn đập ngọc vào cột, Tần Vương sợ ngọc bị hủy hoại, bèn giả vờ đồng ý trao cho Triệu quốc mười lăm tòa thành. Lận Tương Như nhìn thấu âm mưu của Tần Vương, bèn lấy cớ yêu cầu Tần Vương trai giới năm ngày mới dâng ngọc, để kéo dài thời gian. Trong mấy ngày này, Lận Tương Như sai tùy tùng mang ngọc về Triệu quốc, còn mình ở lại ứng phó với Tần Vương. (Câu chuyện này ví von phàm nhân bị danh vọng làm mờ mắt.)",
    "Explanation": "Gia đạo cầu phúc, Tự thân trở, Cầu tài hư ảo, Giao dịch khó thành, Hôn nhân bất hợp, Người đi trễ, Điền vụ thất thu, Lục súc tổn, Tìm người dò, Kiện tụng hòa, Di dời đợi thời, Vật thất xa, Bệnh thuyên giảm, Phong thủy cải sửa."
  },
  {
    "ID": "78",
    "Rank": "THƯỢNG XĂM",
    "Original": "冷水末燒白涕湯\n不寒不熱有温凉\n要行天下無他事\n為有身中百藝強",
    "Transliteration": "Lảnh thủy vị thiêu bạch thế thang\nBất hàn bất hữu ôn lương\nYếu hành thiên hạ vô tha sự\nVi hữu thân trung bá nghệ cường",
    "Translation": "Nước chưa đem nấu nóng được không\nChẳng lạnh chẳng sôi chỉ ấm nồng\nTrăm nghề khéo léo ta có được\nRa đời làm việc lộ hanh thông",
    "Comment": "Tù nhân được tha, Bệnh gặp thuốc tài. Cầu tài mưu tính, Qúi nhân chỉ dùm",
    "Divination": "Bình thiện dụng sự. Mọi việc bình ổn đại cát",
    "Reference": "Lâm Xung cứu giá",
    "reference_translated": "Lâm Đồng cứu giá (臨潼救駕)",
    "reference_detail": "Cuối thời Tùy. Đường Vương Lý Uyên đi ngang qua khu vực Trồng Cây Cương dưới chân núi Lâm Đồng, bỗng nhiên có vô số kẻ cướp từ trong rừng lao ra, cầm giáo và rìu lớn, chặn đường, muốn giết ông. Lý Uyên bị vây khốn, vô cùng nguy cấp. Lúc này, Thúc Bảo đang ở trong miếu Ngũ Viên chuẩn bị đi ngủ, đột nhiên nghe thấy tiếng người ngựa hò hét bên ngoài, lấy làm lạ. Lập tức phi ngựa, chạy đến nửa núi, dưới chân núi khói bụi mù mịt, hò hét vang trời. Thúc Bảo như tia chớp, xông vào vòng vây, đánh chết mười mấy người, quân địch tan chạy tứ tán. Cứu được cả gia đình Lý Uyên. Ngay lập tức được Đường Vương trọng dụng, trở thành công thần khai quốc của nhà Đường.",
    "Explanation": "Gia đạo an, Tự thân cát, Cầu tài toại, Giao dịch thành, Hôn nhân hợp, Người đi tới, Tim người trễ, Điền vụ thất, Lục súc vượng, Kiện tụng tan, Di dời đại cát, Vật thất có, Bệnh an, Phong thủy đại cát lợi."
  },
  {
    "ID": "79",
    "Rank": "TRUNG XĂM",
    "Original": "虛空結願保平安\n保得身安願不還\n莫忘神聖宜還了\n豈知神語莫輕漫",
    "Transliteration": "Hư không kết nguyện bảo bình an\nBảo đắc thân an nguyện bất hoàn\nMạc vong thần thành nghi hoàn liễu\nKhỉ tri thần ngữ mạc khinh man",
    "Translation": "Thinh không khấn vái được an khương\nÝ nguyện đạt rồi không thắp hương\nĐừng ngở thánh thần là chẳng có\nKhuyên ai thần ngữ chớ khinh thường",
    "Comment": "Người chỉ biết mình, Tâm kia không gấp, Quan âm chỉ rỏ, Chớ có coi thường",
    "Divination": "Tin thật đừng tin hư. Việc giử cũ đợi điềm lành",
    "Reference": "Ám phò đảo Đồng kỳ",
    "reference_translated": "Ngầm giúp đổ cờ đồng (暗扶倒銅旗)",
    "reference_detail": "Vị danh tướng khai quốc nhà Đường, Tần Quỳnh (tức Tần Thúc Bảo) được phong làm Túngy Đô đại nguyên soái, dẫn quân tấn công ải Tứ Thủy (hoặc nói là Ải Phàm Thủy, Ải Đông Lĩnh, truyền thuyết không đồng nhất). Thủ tướng ải Tứ Thủy là Dương Lâm (Dương Nghĩa Thành) theo lệnh của Tùy Dạng Đế bày trận cờ đồng. Tần Thúc Bảo công phá không thành. Sau khi biết tướng giữ trận là La Thành, cháu họ mình, bèn liên lạc với cô ruột. La Thành trước khi ra trận đã nói với mẹ: \"Người phá cờ là anh họ Tần Quỳnh\". Mẹ dặn anh ta ngầm giúp đỡ. Ngày quyết chiến, La Thành canh giữ cờ đồng bỗng nhiên quay giáo, cùng Tần Quỳnh đánh từ trong ra ngoài, cuối cùng phá tan trận cờ đồng. La Thành chiếm giữ ải Đông Lĩnh, thắng lợi trở về, La Thành từ đó quy phục nhà Đường. (Câu chuyện này ví von việc làm đôi khi cần dựa vào lý trí, chứ không dựa vào tình cảm hay tín niệm.)",
    "Explanation": "Gia đạo hoàn nguyện, Tự thân lo, Cầu tài thủ phận, Giao dịch cẩn thận, Hôn nhân hư ảo, Người đi trễ, Điền vụ bình, Lục súc tổn, Tim người dò, Kiện tụng hòa, Di dời thủ cựu, Vật thất hướng tây, Bệnh giải trừ, Phong thủy hướng tây."
  },
  {
    "ID": "80",
    "Rank": "THƯỢNG XĂM",
    "Original": "直上仙岩要學仙\n豈知ㄧ旦帝王宣\n青天日月常明照\n心正聲名四海傳",
    "Transliteration": "Trực thượng tiên nham yếu học tiên\nKhỉ tri nhất đản đế vương tuyên\nThanh thiên nhật nguyệt thường minh chiếu\nTâm chính thanh danh tứ hải truyền",
    "Translation": "Lên thẳng non cao định học tiên\nNay vua ban chiếu triệu tài hiền\nLồng lộng trời cao soi sáng tỏ\nNgay thẳng tuổi tên bốn bễ truyền",
    "Comment": "Trước sau đều có, Chớ ngó đông tây. Trong lòng mưu sự, Qúi nhân trùng trùng",
    "Divination": "Qúi nhân tiếp dẫn. Mọi việc hòa hợp đại cát",
    "Reference": "Trí Viễn đầu quân",
    "reference_translated": "Lưu Trí Viễn tòng quân (劉智遠投軍)",
    "reference_detail": "Lưu Trí Viễn (hay Lưu Tri Viễn), người Sa Đà (người Sa Đát). Lưu Trí Viễn cùng vợ là Lý Tam Nương sống ở nhà cậu. Cậu ghét Lưu Trí Viễn nghèo khó, lừa ông đến vườn dưa, muốn hại ông bị hai yêu tinh dưa ăn thịt. Trí Viễn đêm cầm giáo, đại chiến yêu tinh dưa chui xuống đất, đào lên được kiếm báu và binh thư. Nhặt được kiếm và binh thư, ông từ biệt vợ đi tòng quân, quy phục Nhạc Huân, làm quan đến An phủ sứ. Khi quân Khiết Đan diệt nhà Tấn, trung nguyên không chủ, Trí Viễn lên ngôi hoàng đế ở Tấn Dương. Đổi quốc hiệu là Hậu Hán. Vẫn dùng niên hiệu Thiên Phúc mà không đổi kỷ nguyên.",
    "Explanation": "Gia đạo bình an, Tự thân cát lợi, Cầu tài lợi, Giao dịch toại ý, Hôn nhân song phối, Người đi tới, Điền vụ bình, Lục súc Thắng, Tìm người gặp, Kiện tụng thắng, Di dời cát, Vật thất Hướng nam, Bệnh an, Phong thủy cát."
  },
  {
    "ID": "81",
    "Rank": "THƯỢNG XĂM",
    "Original": "梧桐葉落秋當暮\n行客歸程去似雲\n謝得天公高助力\n顺風船載寳珍歸",
    "Transliteration": "Ngô đồng diệp lạc thu đương mộ\nHành khách quy trình khứ tự vân\nTạ đắc thiên công cao trợ lực\nThuận phong thuyền tải bảo trân quy",
    "Translation": "Ngô đồng rụng lá biết thu về\nLữ khách nhanh chân trở lại quê\nCảm tạ trời cao ra sức giúp\nThuận thuyền châu báu chở ê hề",
    "Comment": "Trong lòng tính việc, Trời cũng chìu theo. Doanh mưu dụng sự, Tất cả làm nên",
    "Divination": "Ngô đồng rụng lá. Mọi việc tiên hung hậu cát",
    "Reference": "Phong tống Đằng vương các",
    "reference_translated": "Gió đưa lầu Tằng Vương (風送滕王閣)",
    "reference_detail": "Vương Bột, tự Tử An, thi sĩ đầu thời Đường, sinh năm Vĩnh Huy thứ nhất thời Đường Cao Tông. Vương Bột từ nhỏ đã đọc nhiều kinh sách, có danh hiệu \"thần đồng\". Năm mười tuổi, có lần ông cùng cha đi ngang qua một miếu Quan Đế, thấy tượng Quan Đế uy phong lẫm liệt, đang cầm cuốn \"Xuân Thu\" đọc. Cha ông thấy vậy chợt nảy cảm hứng, đối diện Quan Đế ngâm rằng: \"Cầm râu xanh ba sợi, đối đèn xanh đọc lịch xanh lưu danh xanh, tay nắm Thanh Long Yển Nguyệt\". Năm đó mùa thu, Vương Bột từ Sơn Tây đi đảo Hải Nam, thăm cha bị giáng chức làm huyện lệnh Giao Chỉ, trên đường đi trải qua ngàn non vạn dặm. Đến năm hai mươi bảy tuổi mùa thu, Vương Bột từ Sơn Tây đi đảo Hải Nam, thăm cha bị giáng chức làm huyện lệnh Giao Chỉ, trên đường đi trải qua ngàn non vạn dặm. Ngày đó đến núi Mã Đương, mọi người lên bờ nghỉ ngơi. Vương Bột đi một mình qua một ngôi miếu cổ, đột nhiên thấy một ông già ngồi trên tảng đá bên cạnh miếu, ông lão trông có dung nhan trẻ trung, tóc bạc trắng, như thần tiên. Ông ta nói với Vương Bột: \"Ngươi không phải là Vương Bột sao?\" Vương Bột giật mình nói: \"Chính là ta! Xin hỏi ngài sao lại biết?\" Ông lão nói: \"Ta nghe nói ngươi có lòng tốt cứu người, thơ phú ý tứ sâu xa. Ngày mai ở Lầu Tằng Vương có đại hội, nếu ngươi đến dự tiệc làm văn, sẽ lưu danh thiên cổ và có tiền lộ phí.\" Vương Bột nói: \"Nơi này cách Lầu Tằng Vương sáu, bảy trăm dặm, ngày mai làm sao kịp đến?\" Ông lão nói: \"Ta sẽ dùng thần phong Mã Đương giúp ngươi thuận buồm xuôi gió, ngày mai nhất định đến kịp.\" Vương Bột bái tạ nói: \"Xin hỏi lão trượng, ngài là tiên hay thần?\" Ông lão cười nói: \"Ta chính là Trung Nguyên Thủy Quân cai quản vùng nước này!\" Rồi ông lão thúc giục Vương Bột mau lên thuyền. Tức thì mây lành bao phủ, trên đường thuận buồm xuôi gió, trong chốc lát đã đi được hàng trăm dặm. Vương Bột quả nhiên đến Lầu Tằng Vương vào buổi sáng ngày đại hội. Và tại chỗ, ông viết một mạch, sáng tác \"Đằng Vương Các Tự\" được Đường Cao Tông ca ngợi là tuyệt tác thiên cổ. Có bài thơ rằng: \"Từ xưa tài tử là thần tiên, gió đưa Nam Xương há ngẫu nhiên; Làm xong câu thơ Lầu Tằng Vương, liền theo tiên trượng bầu Trung Nguyên.\"",
    "Explanation": "Gia đạo cầu khẩn, Tự thân lo, Cầu tài toại ý, Giao dịch thành, Hôn nhân hòa hợp, Người đi động, Điền vụ hậu cát, Lục súc ổn, Tìm người có, Kiện tụng thắng, Di dời tùy ý, Bệnh tin vui, Phong thủy chọn đất."
  },
  {
    "ID": "82",
    "Rank": "TRUNG XĂM",
    "Original": "炎炎烈火焰連天\n焰里還生ㄧ朵蓮\n到底得成終不害\n依然生葉長根枝",
    "Transliteration": "Diêm diêm liệt hỏa diệm liên thiên\nDiệm lý hoàn sinh nhất đóa liên\nĐáo để đắc thành chung thất bại\nY nhiên sinh diệp trưởng căn chi",
    "Translation": "Rừng rực lửa cao ngất ngất trời\nTrong kia còn mọc đóa sen tươi\nNay đã đã thành chi hại được\nHoa thắm xinh tươi sống giữa đời",
    "Comment": "Có gặp nguy hiểm, Chẳng hại đến mình. Tính toan làm việc, Đều gặp quí nhân",
    "Divination": "Sen mọc trong lửa, Việc thấy hiểm mà không hiểm",
    "Reference": "Hỏa thiêu Hồ lô cốc",
    "reference_translated": "Hỏa thiêu hồ lô cốc (火燒葫蘆谷)",
    "reference_detail": "Thời Tam Quốc, Lưu Bị và Chu Du liên minh tấn công Tào Tháo. Khổng Minh lập đàn Thất Tinh tế gió đông, giúp Chu Du hỏa thiêu Xích Bích. Quân Tào bị thiêu rụi, tháo chạy tán loạn. Tào Tháo cũng dẫn một đội quân tàn tạ bỏ chạy. Khổng Minh phái đại tướng mai phục các nơi. Tào Tháo đến cửa cốc Hồ Lô nghỉ ngơi, đốt cơm. Thấy địa thế hiểm yếu lại không có quân mai phục mà cười ha hả. Bỗng nghe tiếng pháo, Trương Phi giết tới. Trong cốc lửa cháy khắp nơi, quân Tào vùng vẫy một hồi. Tào Tháo vội lên ngựa, trong lửa chạy trốn thảm hại. Bại binh chạy đường Hoa Dung. (Dù gặp nguy hiểm, vẫn bảo toàn được tính mạng.)",
    "Explanation": "Gia đạo an, Tự thân cần phòng, Cầu tài hao lực, Giao dịch phòng tiểu nhân, Hôn nhân trở, Điền vụ lục súc bình ổn, Tìm người khó, Kiện tụng hòa, Di dời thủ cựu, Vật thất hướng nam, Bệnh thuyên khỏi, Phong thủy sửa đổi."
  },
  {
    "ID": "83",
    "Rank": "TRUNG XĂM",
    "Original": "譬如初三四五缺\n半無半有未圓全\n等待良宵十五夜\n到處光明到處圓",
    "Transliteration": "Tỷ như sơ tam tứ ngũ khuyết\nBán vô bán hữu vị vi toàn\nĐẳng đãi lương tiêu thập ngũ dạ\nĐáo xứ quang minh đáo xứ viên",
    "Translation": "Mồng bốn mồng năm trăng lưỡi liềm\nLúc không lúc hiện lướt qua đêm\nĐến rằm tròn tỏ nơi cao ấy\nSáng soi khắp xứ cảnh vui thêm",
    "Comment": "Thủ cựu đợi thời, Như trăng đầu tháng. Đợi lúc trăng tròn, mọi việc đều tốt",
    "Divination": "Trăng khuyết chưa tròn, Mọi việc chờ thời mới tốt",
    "Reference": "Lý Uyên đăng vị",
    "reference_translated": "Lý Uyên đăng vị (李淵登位)",
    "reference_detail": "Cuối thời Tùy, Tùy Dạng Đế hoang dâm vô độ, khắp nơi ăn chơi, dân oán than, quần hùng chia cắt. Năm 618 Công nguyên, Vũ Văn Hóa, Tư Mã Đức Gián và Bùi Khiêm Thông cùng những người khác phát động binh biến, giết Tùy Dạng Đế, lập Dương Hạo làm vua. Không lâu sau Vũ Văn Hóa lại giết Tần Vương Hạo tự phong là Hứa Đế, lập quốc hiệu Hứa. Năm sau bị Đường tướng Lý Thần Thông và Hạ Vương Đậu Kiến Đức liên hợp diệt. Trung nguyên hay tin Dạng Đế chết, thủ tướng Lạc Dương là Vương Thế Sung lập Việt Vương Đổng làm vua, tức Tùy Ai Đế. Lúc này, Lý Uyên phế truất Dương Hựu, tự mình lên ngôi hoàng đế ở Thái Nguyên, đổi quốc hiệu là Đường. Đây là Đường Cao Tổ.",
    "Explanation": "Gia đạo như nguyện, Tự thân hạ thu cát, Cầu tài cẩn thận, Giao dịch đợi thời, Hôn nhân trễ, Người đi trở, Điền vụ lục súc bình ổn, Tìm người khó, Kiện tụng hòa, Di dời thủ cựu, Vật thất khó tìm, Bệnh mau khỏi, Phong thủy cải sửa."
  },
  {
    "ID": "84",
    "Rank": "HẠ XĂM",
    "Original": "因名喪德如何事\n切恐吉中變化凶\n洒醉不知何處去\n青松影里夢朦朧",
    "Transliteration": "Nhân danh tang đức như hà sự\nThiết khủng các trung biến hóa hung\nSái túy bất tri hàn xứ khứ\nThanh tùng ảnh lý mộng mông lung",
    "Translation": "Danh vị việc làm thất đức chi\nChuyện lành hóa dữ đến liền khi\nMờ mịt tùng xanh trăng khuyết chiếu\nSay khước tìm đâu nẻo bước đi",
    "Comment": "Cá ra khỏi nước. đẹp chưa trọn vẹn. Nếu hỏi mưu sự, Chẳng nên làm gì",
    "Divination": "Hàn ngư ly thủy. Việc chi không nên động",
    "Reference": "Trang Tử thử vợ",
    "reference_translated": "Trang Tử thử vợ (莊子試妻)",
    "reference_detail": "Trang Tử, người thời Chu, họ Trang tên Chu, tự Tử Hưu, người Tống, huyện Mông. Ông làm quan Ổn Lý Vườn Tẩm thời Chu. Một ngày nọ, Trang Tử gặp một người phụ nữ trên núi, đang ngồi trước một ngôi mộ mới, điên cuồng quạt, như muốn làm khô lớp đất ẩm trên mộ. Trang Tử không hiểu ý bà ta, bèn hỏi. Bà ta nói, trong mộ là chồng bà, lúc lâm chung dặn bà phải đợi đất trên mộ khô mới được tái giá. Bà ta không đợi được, bèn quay cuồng quạt đất mộ cho nhanh khô, để tìm kiếm mối tình thứ hai. Trang Tử nghĩ trên đời lại có người phụ nữ bạc tình như vậy, cảm thán không thôi. Tiếp đó, ông nghĩ vợ mình có thể cũng như vậy không? Nghi ngờ nổi lên, ông muốn thử thách. Vợ Trang Tử họ Điền, hai vợ chồng vốn tình cảm sâu đậm, Trang Tử để kiểm tra lòng trung trinh của vợ, quyết định giả chết để thử. Nghe tin Trang Tử đột ngột qua đời, bao gồm thân hữu và mọi người từ bốn phương, nhiều người đến viếng. Trong đó có một công tử nước Sở, tuấn tú lịch lãm, địa vị cao sang, tiền bạc dồi dào. Ông ta thấy bà Điền quả phụ, trông đáng thương, bèn theo đuổi. Bà Điền không chịu nổi cám dỗ, yêu công tử nước Sở, mới hai mươi ngày đã thành hôn. Tối hôm đó, khi rượu say mặt đỏ bừng, công tử nước Sở đột nhiên lên cơn đau tim, tính mạng nguy cấp. Bà Điền sợ hãi hoảng loạn, vội hỏi công tử nước Sở phải làm sao? Công tử nước Sở nén đau, nói với bà Điền, cần dùng não của người chết mới có thể cứu sống. Thi thể ở đâu mà tìm? Bà Điền chợt nảy ra ý nghĩ, chồng mình chẳng phải mới chết sao? Bà Điền quên đi tình nghĩa vợ chồng xưa, lấy rìu bổ quan tài chồng, chuẩn bị lấy não làm thuốc. Không ngờ bổ quan tài ra, Trang Tử lại sống lại. Bà Điền xấu hổ không biết chui vào đâu, treo cổ tự tử. (Câu chuyện này ví von vì tư lợi mà trái với tình nghĩa, không thể đồng tình.)",
    "Explanation": "Mọi sự đều bất lợi. Cần khẩn cầu bảo hộ bình an."
  },
  {
    "ID": "85",
    "Rank": "TRUNG XĂM",
    "Original": "雲開霧散山前路\n萬物圓中月再圓\n若得詩書沉夢醒\n貴人指引歩天臺",
    "Transliteration": "Vân khai vụ tán sơn tiền lộ\nVạn vật viên trung nguyệt tái viên\nNhược đắc thi thư trầm mộng tỉnh\nQúi nhân chỉ dẫn bộ thiên đài",
    "Translation": "Mây khói tan rồi lộ thẳng ngay\nTrăng tròn vạn vật cảnh vui thay\nHọc thuộc thi thơ như tỉnh mộng\nQúi nhân dẫn giúp tới thiên đài",
    "Comment": "Người già muốn cầu, Xuân tàn nở hoa. Nếu cầu danh lợi, Muộn được hoạnh tài",
    "Divination": "Xuân tàn hoa nở. Việc sau sẽ biến đổi",
    "Reference": "Hàn công nộ tuyết",
    "reference_translated": "Hàn Văn Công gặp tuyết (韓文公遇雪)",
    "reference_detail": "Hàn Dũ, tự Thôi Chi, người Xương Lê. Đỗ tiến sĩ năm Trinh Nguyên thứ tám thời Đường Đức Tông, thụy hiệu Văn Công. Thời Đường Hiến Tông, Hàn Dũ vì can gián đón Phật cốt, chọc giận Hiến Tông, giáng chức Hàn Dũ làm Tri phủ Triều Châu, hạn ngày phải đi. Hàn Dũ chia ly vợ con, đi Triều Châu. Đi chưa đầy mấy ngày, gió lạnh nổi lên dữ dội, tuyết rơi trắng xóa. Hàn Dũ đi đến một nơi, tuyết dày mấy thước, ngựa khó tiến lên, xung quanh không thấy một nhà dân nào, không biết đường đi lối nào. Muốn quay lui cũng không còn đường về. Gió thổi mạnh, tuyết rơi nhanh, Hàn Dũ người ướt đẫm, chịu không nổi cái lạnh đói, muôn vàn khổ sở không biết kêu ai. Hàn Dũ than thở nói: \"Hoàng thượng không giết ta, trời xanh lại muốn diệt ta.\" Đúng lúc Hàn Dũ tuyệt vọng, chỉ thấy một người đội giá rét, quét tuyết mà đến, nhìn kỹ thì ra là Hàn Tương Tử (cháu họ Hàn Dũ). Trước đó Hàn Tương Tử từng nói với Hàn Dũ: \"Mây che núi Tần gia ở đâu? Tuyết phủ lam quan ngựa không tiến.\" Lúc ấy Hàn Dũ không hiểu ý Hàn Tương Tử, mà lúc này cuối cùng cũng hiểu ra. Thế là Hàn Dũ cùng Hàn Tương Tử đến Lam Quan phó xá mượn chỗ nghỉ. Bàn luận chuyện cũ, đạo tu chân, Hàn Dũ tâm phục khẩu phục. Sau này Hàn Dũ bỏ quan, tài sản đều quyên góp cho địa phương, vào núi tu đạo thành tiên. Hàn Tương Tử độ hóa Hàn Dũ.",
    "Explanation": "Gia đạo thiếu an, Tự thân cẩn thận, Cầu tài trọa lực, Giao dịch bình, Hôn nhân trễ, Điền vụ lục súc tốt, Người đi trở, Tìm người khó, Kiện tụng phản phúc, Di dời canh tân, Vật thất hung, Bệnh kéo dài, Phong thủy sữa đổi."
  },
  {
    "ID": "86",
    "Rank": "THƯỢNG XĂM",
    "Original": "春來花發映陽臺\n萬里車來進寶財\n若得禹門三級浪\n恰如平地ㄧ聲雷",
    "Transliteration": "Xuân lai hoa phát ánh dương đài\nVạn lý xa lai tấn bảo tài\nNhược đắc vũ môn tam cấp lãng\nKháp như bình địa nhất thanh lôi",
    "Translation": "Khoe sắc muôn hoa đón nắng xuân\nXe chở từ xa tới bảo trân\nVượt được vũ môn ba cấp sóng\nMột tiếng sấm rền vang thế nhân",
    "Comment": "Chầu vua nhậm chức, Như nghèo được ngọc. Mưu sự tùy tâm, Quer này bật nhất",
    "Divination": "Thượng triêu kiến đế. Vạn sự đại cát đại lợi",
    "Reference": "Thượng lộ trúng tam nguyên",
    "reference_translated": "Thương Lộ trúng tam nguyên (商輅中三元)",
    "reference_detail": "Thương Lộ (1414–1486), tự Hoằng Tái, hiệu Tố Đình, thụy Văn Nghị, người Thuần An, Chiết Giang, Trung Quốc. Sinh ngày 25 tháng 2 năm Vĩnh Lạc thứ 12 triều Minh.\nCha và ông nội đều không làm quan, thuở sớm đã được Học dụ Vương Thụy trọng dụng. Năm Tuyên Đức thứ 10 đời Minh (1435), ông đỗ đầu kỳ thi Hương (Giải nguyên), sau đó nhiều lần thi không đỗ, bèn ở Thái học dốc lòng đọc sách, được Quốc tử giám Tế tửu Lý Thời Miễn tán thưởng. Năm Chính Thống thứ 10 (1445), ông đỗ đầu kỳ thi Hội (Hội nguyên), tiếp đó đỗ đầu kỳ thi Đình (Trạng nguyên). Vinh quang Tam nguyên cập đệ, trong triều Minh chỉ có Hoàng Quan (người bị Chu Đệ xóa tên) và ông là có được vinh dự này.",
    "Explanation": "Tùy tâm cầu muốn. Vạn sự cát lợi"
  },
  {
    "ID": "87",
    "Rank": "TRUNG XĂM",
    "Original": "人行半嶺日銜山\n峻嶺崖岩末可安\n仰望上天為護佑\n此身猶在太平間",
    "Transliteration": "Nhân hành bán lảnh nhật hàm san\nTuấn lảnh nhai nham vị khả an\nNgưỡng vọng thượng thiên vi hộ sự\nThử thân do tại thái bình gian",
    "Translation": "Nắng trời che chở bống người đi\nĐèo cao núi cả có yên gì\nNgước vái trời cao xin hộ độ\nThân đây đang tại thái bình kỳ",
    "Comment": "Đẻo đá thấy ngọc, Đải cát thấy vàng. Chỉ phải ra sức, Lao tâm ắt thông",
    "Divination": "Đải cát thấy vàng. Mọi việc có quí nhân giúp",
    "Reference": "Giảo Kim thám địa huyệt.",
    "reference_translated": "Giảo Kim Thám Địa Huyệt (咬金探地穴)",
    "reference_detail": "Để mừng chiến công, Trình Giảo Kim mở tiệc ở Võ Dương. Bỗng nhiên mặt đất nứt ra một cái hố, sâu không lường được. Mọi người rút thăm, Ngõa Kim bốc được. Dùng dây buộc mình xuống hố. Thấy cửa làm bằng đá, bàn ghế, cầu thang, trên bàn còn có long bào, đai ngọc. Ngõa Kim mặc vào rồi ra khỏi hố. Giảo Kim mang theo nhiều rương lớn nhỏ ra khỏi hố, mở hộp gỗ lấy ra ngọc ấn, mở hộp lớn lấy ra đại kỳ, mũ, áo, giày dép, đai đặt lên bàn. Mọi người xem xét. Chỉ thấy ấn ngọc khắc tám chữ triện là 'Hỗn Thế Ma Vương, Đại Đức Thiên Tử'. Mọi người tôn ông làm 'Hoàng đế', Giảo Kim cứ thế làm Hỗn Thế Ma Vương ba năm. (Thực ra, đây chỉ là tự phong, Trình Giảo Kim chỉ là tù trưởng lúc đó). (Câu chuyện này ví von, việc tốt đẹp cũng như một màn kịch, đây chính là ý cảnh 'thân này còn ở cõi thái hư'). Toàn bộ câu chuyện: Trình Giảo Kim mạo hiểm thám địa huyệt.",
    "Explanation": "Gia đạo cầu phúc, Tự thân thiếu lợi, Cầu tài lao tâm, Giao dịch cẩn thận, Hôn nhân trở, Người đi trễ, Điền vụ lục súc bình ổn, Tìm người chưa thấy, Kiện tụng thua. Di dời thủ cựu, Vật thất hung, Bệnh trở ngại, Phong thủy tốt."
  },
  {
    "ID": "88",
    "Rank": "TRUNG XĂM",
    "Original": "木為ㄧ虎在當門\n須是有成不害人\n分明說是無妨事\n憂惱遲疑恐懼心",
    "Transliteration": "Mộc vi nhất hổ tại đương môn\n\n\nTu thị hữu uy bất hại nhân\nPhân minh thuyết thị vô phương sự\nƯu não trì nghi khủng hoảng tâm",
    "Translation": "Đứng trước cửa nhà một cọp cây\nOai thi oai vậy có vồ ai\nĐã rỏ việc này không trở ngại\nBuồn phiền do dự vẫn lo đây",
    "Comment": "Trên lò đóng tuyết, Gió thổi qua tai. Chỉ nên làm phúc, Hậu cát tiền hung.",
    "Divination": "Cọp cây có uy. Mọi việc thật ít lo nhiều",
    "Reference": "Bàng Hồng sợ Bao Công",
    "reference_translated": "Bàng Hồng sợ Bao Công (龐洪畏包公)",
    "reference_detail": "Thời Tống Nhân Tông. Bao Công làm Phủ Doãn Phủ Khai Phong (quan chức, tương đương thái thú). Bàng Hồng là quốc trượng (con rể của hoàng đế), hãm hại tướng quân Địch Thanh vào ngục. Bao Công xin thẩm tra vụ án, Bàng Hồng kinh sợ vô cùng, tìm đủ cách ngăn cản. Sau vụ án được làm sáng tỏ, chứng thực Bàng Hồng vu oan. Dâng lên Tống Nhân Tông phê chuẩn, lại vì là hoàng tộc nên được tha.",
    "Explanation": "Gia đạo bất an, Tự thân khẩu thiệt, Cầu tài tiểu nhân,Giao dịch bất lợi, Hôn nhân bất hợp, Người đi trở, Kiện tụng thua, Điền vụ lục súc tổn, Tìm người dò tra, Di dời thủ cựu, Vật thất hung, Bệnh tế hổ, Phong thủy hung."
  },
  {
    "ID": "89",
    "Rank": "THƯỢNG XĂM",
    "Original": "出入營謀大吉昌\n似玉無瑕石里藏\n若得貴人來指引\n斯時得寶喜風光",
    "Transliteration": "Xuất nhập doanh mưu đại cát xương\nTự ngọc vô hà thạch lý tàng\nNhược đắc quí nhân lai chỉ dẫn\nTư thời đắc bảo hỷ phong quang",
    "Translation": "Ra vào mưu sự đại phồn vinh\nNgọc lành ẩn đá ấy sao nhìn\nNếu được quí nhân ra chỉ giúp\nLúc này được ngọc miệng cười xinh",
    "Comment": "Ngọc ẩn trong đá, Qúi nhân chỉ giúp. Được bảo ngọc rồi, Vui mừng đắc ý Điêm quẻ ứng Đá ẩn ngọc quí. Mọi việc như ý đại cát Tích Cổ : Đại khán Quỳnh hoa Giải Gia đạo cát lợi, Tự thân an thái, Cầu tài toại ý, Giao dịch thành, Hôn nhân thành tựu, Người đi động, Điền vụ trợ lực, Lục súc cần lo, Tìm người thấy, Kiện tụng thắng, Di dời cát, Vật thất có, Bệnh an, Phong thủy cát.",
    "Divination": "",
    "Reference": "Đại khán Quỳnh hoa",
    "reference_translated": "Dương Đế đại khán Quỳnh hoa (煬帝大看瓊花)",
    "reference_detail": "Quỳnh hoa mỗi năm nở một lần, lại vào ban đêm. Tùy Dương Đế nghe người ta nói, ở Dương Châu có Quỳnh hoa đẹp vô song, trắng như ngọc, phong thái yêu kiều, thanh tú tao nhã. Cưỡi long chu mang theo cung phi đến Dương Châu thưởng hoa, nghi thức rất đầy đủ, thanh thế rất lớn, cờ xí phất phới. (Câu chuyện này ví von, sự vật quý giá như 'Quỳnh hoa' này. Không hiện ra thì thôi, đã hiện ra thì kỳ lạ).",
    "Explanation": "Gia đạo cát lợi, Tự thân an thái, Cầu tài toại ý, Giao dịch thành, Hôn nhân thành tựu, Người đi động, Điền vụ trợ lực, Lục súc cần lo, Tìm người thấy, Kiện tụng thắng, Di dời cát, Vật thất có, Bệnh an, Phong thủy cát."
  },
  {
    "ID": "90",
    "Rank": "THƯỢNG XĂM",
    "Original": "忽言ㄧ信向天飛\n泰山寶貝滿船歸\n若問路途成好事\n前頭仍有貴人推",
    "Transliteration": "Hốt ngôn nhất tín hướng thiên phi\nThái sơn bảo bối mãn thuyền qui\nNhược vấn lộ đồ thành hảo sự\nTiền đầu nãi hữu quí nhân suy",
    "Translation": "Chữ tín ngàn vàng đã thốt ra\nBảo ngọc đầy thuyền ấy cũa ta\nĐường lộ thênh thang ta cứ hỏi\nQúi nhân đưa giúp tới quê nhà",
    "Comment": "Muốn tìm công danh, Trước có quí nhân. Tăng thêm vui vẻ, Tài lộc phong hanh",
    "Divination": "Công thành danh toại, Mọi việc tiến hành đại cát",
    "Reference": "Vi Phối gặp tiên",
    "reference_translated": "Vi Bội gặp tiên (葦佩遇仙(韋佩遇仙))",
    "reference_detail": "Học trò nghèo Vi Bội gần bốn mươi tuổi. Dắt lừa qua cầu Lạc Dương, trên cầu có một ngư dân đang định giết một con rùa lớn để bán. Vi Bội thấy không đành lòng. Nhưng thiếu tiền, bèn đem con lừa mình dắt đổi lấy con rùa, thả dưới cầu. Từ đó Vi Bội đỗ đạt, được thăng quan tiến chức. (Câu chuyện này dùng ý cảnh 'rùa lớn gặp Vi Bội mà được cứu' để ví von quẻ này. Mà Vi Bội vì thế mà huy hoàng, bởi vì gặp được 'rùa lớn' này).",
    "Explanation": "Mọi sự tốt lành. Cầu xin toại ý."
  },
  {
    "ID": "91",
    "Rank": "THƯỢNG XĂM",
    "Original": "好展愁眉出衆來\n前途改變喜多財\nㄧ條大路如天闊\n凡有施財盡暢懷",
    "Transliteration": "Hảo triển sầu mi xuất chúng lai\nTiên đề cãi biến hỷ đa tài\nNhất điều đại lộ như thiên hoạt\nPhàm hữu thi tài tận sướng hoài",
    "Translation": "Sầu mi bày rỏ chúng coi chi\nTừ đây giàu có đã đến thì\nMột con đường lớn như trời rộng\nTay xách tiền tài vui bước đi",
    "Comment": "Biển lớn mênh mông, Có thể đi tới. Nếu có ý nguyện, Tiến về phía trước",
    "Divination": "Tiền đồ hiển đạt. Mọi sự thông thái đại cát",
    "Reference": "Tam chiến Lữ Bố",
    "reference_translated": "Tam Anh chiến Lữ Bố (三英戰呂布)",
    "reference_detail": "Đổng Trác biết Hoa Hùng bị chém, lại phái Phi Tướng quân Lữ Bố ra trận. Lữ Bố vừa ra trận, liên tục chém đại tướng Phương Duệ, Mục Thuận, giết và làm bị thương Võ An Quốc, Công Tôn Toản. Trương Phi thấy Công Tôn Toản đánh không lại Lữ Bố, vội tiếp ứng Công Tôn Toản, lớn tiếng: 'Ba họ nô tài đừng chạy! Yên nhân Trương Phi đây rồi!'. Sau đó giao đấu hơn năm mươi hiệp, không phân thắng bại. Quan Vũ thấy vậy, cùng Trương Phi hợp công Lữ Bố, lại đánh hơn ba mươi hiệp. Lưu Bị cũng cầm song kiếm, thúc ngựa tiến lên giúp Trương Phi, Quan Vũ. Cứ thế ba người bao vây Lữ Bố không ngừng chiến đấu, tám lộ quân đều xem đến ngây người. Không lâu, Lữ Bố bắt đầu suy yếu, Lữ Bố phi ngựa rút lui, nhưng ba người truy đuổi Lữ Bố không bỏ, cho đến khi gặp quân của Lữ Bố mới rút lui. (Tam Quốc Diễn Nghĩa) (Câu chuyện này ví von, Lữ Bố anh dũng thiện chiến, một người địch ba người).",
    "Explanation": "Vạn sự như tâm. Thuân lợi cát xương"
  },
  {
    "ID": "92",
    "Rank": "THƯỢNG XĂM",
    "Original": "自幼為商任設謀\n財祿豐盈不用求\n若是只身謀望事\n秀才出去狀元回",
    "Transliteration": "Tự ấu vi thương nhậm thiết mưu\nTài lộc phong dinh bất dụng cầu\nNhược thị chỉ thân mưu dụng sự\nTú tài xuất khứ Trạng nguyên hồi",
    "Translation": "Tự nhỏ king doanh khắp bốn bề\nTràn đầy tài lộc lãi đến mê\nNếu có tự thân mưu tính việc\nTú tài ứng thí Trạng nguyên về",
    "Comment": "Từ nhỏ đến lớn, Không chi trở ngại. Mưu tính việc chi, Công danh sẽ tới",
    "Divination": "Tự tiểu vi thương, Mọi việc cần kiệm, thì khỏi ưu phiền",
    "Reference": "Thái Khanh báo ân",
    "reference_translated": "Thái Khanh báo ân (蔡卿報恩(蔡邕))",
    "reference_detail": "Thái Ung, tự Bá Giai, người Trần Lưu Ngữ (nay phía nam huyện Kỳ, Hà Nam). Là một người đọc sách, cũng là chồng của Triệu Ngũ Nương. Năm năm trước triều đình chiêu hiền, quận tiến cử ông vào kinh ứng thí, từ đó biệt vô âm tín. Sau khi Thái Bá Giai đi, năm đầu còn dễ đối phó, trong nhà còn chút tích lũy, cuộc sống còn duy trì được. Năm thứ hai Trần Lưu liên tục đại hạn, phải dựa vào Triệu Ngũ Nương cầm đồ trang sức để qua cơn đói rét; Thái Bá Giai biệt vô âm tín, càng làm gia đình thêm lo lắng. Hạn hán kéo dài ba năm, trong khoảng thời gian này. Hàng xóm Trương Quảng Tài không ngừng giúp đỡ bà. Sau đó Thái Bá Giai trúng Trạng nguyên, về nhà biết vợ được Trương Quảng Tài giúp đỡ. Vợ chồng đến nhà họ Trương bái tạ, và tặng bạc cho Trương Quảng Tài.",
    "Explanation": "Gia đạo an, Tự thân khang thái, Cầu tài thuận toại, Giao dịch thắng, Hôn nhân hợp, Người đi động, Điền vụ bình, Lục súc vượng, Tìm người thấy, Kiện tụng thắng, Di dời như ý, Vật thất có, Bệnh mau khỏi, Phong thủy đại cát."
  },
  {
    "ID": "93",
    "Rank": "TRUNG XĂM",
    "Original": "鸞鳯翔毛雨淋灕\n當時却被雀兒欺\n終到雲開ㄧ日逹\n依舊還君整羽衣",
    "Transliteration": "Loan phụng tường mao vũ lâm ly\nĐương thời khước bị tước nhi khi\nChung đáo vân khai nhất nhật đạt\nYcựu hoàn quân chỉnh vũ y",
    "Translation": "Loan phượng ướt mưa cánh chẳng bay\nChim sẻ nhạo cười nhảy múa say\nCó ngày mây dứt trời quang tạnh\nChỉnh trang đôi cánh vượt Đường dài",
    "Comment": "Tiểu nhân đương thời, Ta nên chờ đợi. Phải biết an phận, Đợi lúc hành động",
    "Divination": "Loan phụng bị mưa, Việc trước đợi thời sau đại lợi",
    "Reference": "Cao quân Bảo cầu thân",
    "reference_translated": "Cao Quân Bảo chiêu thân (高君保招親)",
    "reference_detail": "Đầu thời Tống, Triệu Khuông Dận thống nhất phương Bắc, thiên hạ quy phục, chỉ còn Nam Đường Lý Ngự chiếm giữ Giang Nam, dùng kế sách dâng thành giả đầu hàng, vây khốn Triệu Khuông Dận ở Thọ Châu, tình thế nguy cấp. Cháu của Triệu Khuông Dận, thiếu niên Kim Thương Cao Quân Bảo vì giải vây Thọ Châu, xuất phát từ Biện Kinh, đi qua Song Tỏa Sơn, đập vỡ bảng chiêu phu quân của Lưu Kim Định lập ra. Hai người so tài, kết quả Lưu Kim Định với võ nghệ cao siêu đã khuất phục Cao Quân Bảo, hai người trao đổi kim giản, ngân linh đính ước. Cháu của Triệu Khuông Dận là Cao Quân Bảo, để đến Thọ Châu giải cứu Triệu Khuông Dận đang bị vây khốn, xuất phát từ Biện Kinh, đi qua Song Tỏa Sơn, đập vỡ bảng chiêu phu quân của Lưu Kim Định lập ra. Hai người so tài, kết quả Lưu Kim Định với võ nghệ cao siêu đã buộc Cao Quân Bảo phải thành thân. Vợ chồng dẫn quân giết vào vòng vây, cứu Triệu Khuông Dận. (Câu chuyện này ví von, hai người không hòa thuận (bị bắt nạt), sau đó lại hòa thuận trở lại).",
    "Explanation": "Gia đạo kém lợi, Tự thân cẩn phòng, Cầu tài trở ít, Giao dịch đợi thời, Hôn nhân trì trệ, Người đi chưa về, Điền vụ trễ thu, Lục súc tổn, Tìm người khó gặp, Kiện tụng thua, Di dời thủ cựu. Vật thất hung, Bệnh lâu khỏi, Phong thủy cải đổi."
  },
  {
    "ID": "94",
    "Rank": "HẠ XĂM",
    "Original": "君子莫如小人為\n事若差遲各是非\n琴鳴須用知音聽\n守常安静得依然",
    "Transliteration": "Quân tử mạc như tiểu nhân vi\nSự nhược sai trì các thị phi\nCầm minh tri dụng tri âm thính\nThủ thường an tịnh đắc y hy",
    "Translation": "Tiểu nhân quân tử sánh sao đây\n\n\nMọi việc khác nhau cách đúng sai\nĐàn cao cần có tri âm hiểu\nThủ thường an phận phút giây này",
    "Comment": "Tri âm thì tới, Chẳng sợ thị phi. Đợi có quí nhân, Mọi chuyện vui vẻ",
    "Divination": "Ý gặp tri kỷ. Mọi chuyện thủ thường đại cát",
    "Reference": "Bá Nha thăm bạn",
    "reference_translated": "Bá Nha thăm bạn (伯牙訪友(伯牙碎琴))",
    "reference_detail": "Bá Nha, họ Dư, tên Thụy, tự Bá Nha, thời Xuân Thu Chiến Quốc, người Dĩnh Đô, nước Sở. Chung Tử Kỳ, ở nội địa nước Sở làm tiều phu. Một ngày gặp Dư Bá Nha ở sông Hán đàn cầm, Chung Tử Kỳ nghe tiếng nói: 'Cao vợi thay như núi cao, rộng lớn thay như nước chảy.' Hai người kết nghĩa huynh đệ, hẹn năm sau Trung thu gặp lại. Năm sau, Dư Bá Nha đúng hẹn đến, nhưng Chung Tử Kỳ đã qua đời. Dư Bá Nha biết Chung Tử Kỳ chết, cho rằng trên đời không còn tri âm, suốt đời không gảy đàn nữa. Nói: 'Đập nát cầm ngọc, đuôi phượng lạnh. Tử Kỳ không còn, đàn cho ai nghe. Gió xuân đầy mặt đều là bạn. Muốn tìm tri âm khó thay.' (Bá Nha Tán Cầm)",
    "Explanation": "Gia đạo thận trọng, Tự thân tiểu nhân, Cầu tài đợi thời, Giao dịch cẩn thận, Hôn nhân trễ, Người đi động, Điền vụ thiếu lợi, Lục súc tổn, Tìm người khó, Kiện tụng hòa, Vật thất tìm gặp, Bệnh trở ngại, Phong thủy bất lợi."
  },
  {
    "ID": "95",
    "Rank": "TRUNG XĂM",
    "Original": "業功志氣在朝朝\n酒色今將不勝饒\n金鷄若見通君語\n錢財福祿與君招",
    "Transliteration": "Ngiệp công chí khí tại triêu triêu\nTửu sắc tương kim bất thắng như\nKim kê nhược kiến thông quân ngử\nTiền tài phúc lộc dử quân chiêu",
    "Translation": "Tửu sắc sao mà thắng nổi đây\nSự nghiệp công danh tiến mỗi ngày\nMột sớm tin vui tươi báo đến\nPhúc lộc lâu đài mặc ý xây",
    "Comment": "Chí khí chuyên cần, An thân an phận. Có ngày tin báo, Vô cùng hoan hỷ",
    "Divination": "Chí khí công danh, Mọi việc thủ thường đại cát",
    "Reference": "Tào Phi xưng đế",
    "reference_translated": "Tào Phi xưng đế (曹丕稱帝)",
    "reference_detail": "Tào Phi, tự Tử Hoán, người Tiêu, Bái Quốc (nay là huyện Hào, An Huy). Chính trị gia, nhà văn học nổi tiếng thời Kiến An. Tào Phi là con thứ hai của Tào Tháo, từ nhỏ sống trong quân ngũ cùng cha, dưới ảnh hưởng của cha, Tào Phi sáu tuổi học bắn cung, tám tuổi học cưỡi ngựa, luyện được thân thủ giỏi. Lại uyên bác kinh truyện cổ kim, chư tử bách gia. Đến mười tám tuổi, Tào Tháo đánh bại Viên Thiệu, Tào Phi mới sống cuộc sống tương đối ổn định tại trung tâm cai trị của Tào Tháo là Nghiệp Thành. Sau đó, dù thỉnh thoảng cùng cha xuất chinh, nhưng phần lớn thời gian sống cuộc sống của công tử, vẫn ngày ngày luyện tập, không ngừng nghỉ. Ông thường bắn bách bộ xuyên dương trên lưng ngựa, kỹ thuật điêu luyện, vì thường xuyên luyện tập nên thân thể nhẹ nhàng khỏe mạnh. Tào Ngang, con trưởng của Tào Tháo, trong một lần tác chiến đã tử trận. Con trưởng đã mất, Tào Phi trở thành người được chọn làm Thái tử. Ông năm ba mươi mốt tuổi được Tào Tháo lập làm Thái tử. Tào Phi ba mươi ba tuổi, Tào Tháo bệnh mất, Tào Phi kế vị làm Thừa tướng, Ngụy Vương. Ông nói, mình thường bắn bách bộ xuyên dương trên lưng ngựa, kỹ thuật điêu luyện, vì thường xuyên luyện tập nên thân thể nhẹ nhàng khỏe mạnh.",
    "Explanation": "Gia đạo cầu bảo,Tự thân trung bình, Cầu tài lao tâm, Giao dịch sớm dứt, Hôn nhân thành, Điền vụ trễ tốt m Lục súc thành, Tìm người khó, Kiện tụng mau kết thúc, Di dời thủ cựu, Vật thất xa, Bệnh mau khỏi, Phong thủy cát."
  },
  {
    "ID": "96",
    "Rank": "THƯỢNG XĂM",
    "Original": "巍巍寳塔不尋常\n八面瓏玲照萬方\n勸君立志勤頂禮\n作善蒼天降福祥",
    "Transliteration": "Nguy nguy bảo tháp bất tầm thường\nBát diện lung linh chiếu vạn phương\nKhuyến quân lập chí cần đỉnh lể\nTác thiện thương thiên giáng phúc tường",
    "Translation": "Nguy nga bảo tháo tại nơi cao\nTám mặt lung linh tỏa sắc màu\nKhuyên người lập chí cần thành lễ\nTrời cao phúc lộc sẽ ban mau",
    "Comment": "Đây phúc phận này, Mọi người điều thấy. Đợi thời chớ gấp, Phúc đức tiền định",
    "Divination": "Phúc đức hiện thân, Mọi việc đại cát đại lợi",
    "Reference": "Đậu yến Sơn tích thiện",
    "reference_translated": "Đậu Yến Sơn tích thiện (竇燕山積善)",
    "reference_detail": "Đậu Vũ Quân là người U Châu thời Hậu Tấn đời Ngũ Đại. Do U Châu thuộc đất Yên nên ông có tên là Yến Sơn. Đậu Yến Sơn xuất thân từ gia đình giàu có, là một phú hộ nổi tiếng trong vùng. Tương truyền ông tính tình không tốt, cậy thế ép người nghèo. Khi họ vay lương thực, ông dùng đấu nhỏ đong ra, đấu lớn thu vào; công khai lừa dối, làm việc trái lương tâm. Do thất đức, đến năm 40 tuổi ông vẫn chưa có con cái. Một đêm, ông nằm mơ thấy cha quá cố căn dặn: 'Tâm thuật con không tốt, nếu không hối cải làm lại cuộc đời, thì chẳng những không có con mà mạng cũng ngắn ngủi'. Từ đó, Đậu Yến Sơn triệt để sửa sai, mở tư thục mời danh sư dạy học, miễn phí cho trẻ em nghèo, chu cấp cho người khó khăn. Sau khi bỏ ác theo thiện, ông liên tiếp sinh được năm người con trai đều lần lượt đỗ đạt. Thị lang Phùng Đạo tặng thơ khen ngợi: 'Yến Sơn Đậu thập lang, dạy con có phương pháp nghĩa lý, một gốc cây thung già cỗi sinh ra năm nhành quế đỏ tỏa hương thơm'.",
    "Explanation": "Gia đạo như nguyện, Tự thân lo, Cầu tài chính thắng, Giao dịch đại cát, Hôn nhân hảo hiệp, Người đi động, Điền vụ bình ổn, Lục súc kém lợi, Tìm người gặp, Kiện tụng hòa, Di dời cát, Bệnh cầu phúc, Phong thủy bình."
  },
  {
    "ID": "97",
    "Rank": "TRUNG XĂM",
    "Original": "當風點燭空疎影\n恍惚鋪成楊里花\n累被竟兒求牧拾\n怎知只是自浮槎",
    "Transliteration": "Đương phong điểm chúc không sơ ảnh\nHoảng hốt phố thành đương lý hoa\nLủy bị cảnh nhi cầu mục thập\nThậm tri chỉ thị tự phù tra",
    "Translation": "Gió lùa đèn thắp bống lơ thơ\nPhố hóa vườn hoa dạ ngẩn ngơ\nDành nuôi con nhỏ mục đồng cắp\nNhư mãng bè trôi dạt lững lờ",
    "Comment": "Phú quí do trời, Bần cùng tại mệnh, Chẳng cầu vọng chi, Đều do thiên định",
    "Divination": "Đốt đèn trước gió. Mọi việc hư danh tiểu lợi",
    "Reference": "Lục xuất kỳ sơn",
    "reference_translated": "Khổng Minh lục xuất Kỳ Sơn (孔明六出祁山)",
    "reference_detail": "Thời Tam Quốc, Kỳ Sơn nằm giữa Ngụy - Thục, Khổng Minh nhiều lần xuất Kỳ Sơn đánh Ngụy đều không thành công. Lần thứ sáu xuất Kỳ Sơn, Khổng Minh viết \"Xuất Sư Biểu\", cuối cùng không thể thắng. Cuối cùng, Gia Cát Lượng vì quá lao tâm, bệnh mất tại Ngũ Trượng Nguyên, hưởng thọ 54 tuổi. (Câu chuyện này ví von \"Trí tuệ không địch lại nghiệp lực\")",
    "Explanation": "Gia đạo cầu phúc, Tự thân cẫn thận, Cầu tài đắc lợi, Giao dịch thận trọng. Hôn nhân trung bình, Người đi dò hỏi, Điền vụ lục súc tổn, Tìm người khó gặp, Kiện thụng thua, Di dời thủ cựu, Vật thất hung, Bệnh lo, Phong thủy cải sửa."
  },
  {
    "ID": "98",
    "Rank": "HẠ XĂM",
    "Original": "出入求謀事宜遲\n只恐閑愁若是非\n如鳥飛中羅網里\n相逢能有幾多時",
    "Transliteration": "Xuất nhập cầu mưu sự nghi trì\n\n\nChỉ khủng nhàn sầu nhạ thị phi\nNhư điểu phi trung la võng lý\nTương phùng năng hữu kỷ đa thi",
    "Translation": "Đừng có ra vào tính việc chi\nChỉ sợ âu sầu lại thị phi\nNhư chim bay tới nhằm vào lưới\nGặp gở sum vầy có mấy khi",
    "Comment": "Thủ cựu tùy thời, Đợi quí nhân tới. Nếu hỏi mọi chuyện, Tất thảy phải trì",
    "Divination": "Thủ cựu tùy thời. Việc chẳng được như ý",
    "Reference": "Các Bình ngộ nạn",
    "reference_translated": "Cát Bình gặp nạn (吉平遇難)",
    "reference_detail": "Cát Bình, tên thật là Cát Thái, tự xưng Bình, là thái y nhà Hán. Kiến An năm thứ năm (năm 200 sau Công nguyên) Tào Tháo làm Thừa tướng, càng không coi Hoàng đế ra gì, Quốc cữu Đổng Thừa từ khi xem được chiếu thư Hoàng đế viết trên đai áo, lại không có cách nào trừ khử Tào Tháo, trong lòng phẫn uất, lo lắng, liền đổ bệnh. Hiến Đế sai thái y Cát Bình đến chữa bệnh cho Tào Tháo. Cát Bình xem mật chiếu của Hoàng đế, quyết tâm trừ khử Tào Tháo, hai người bèn bàn bạc bày ra mưu kế. Không ngờ vách tường có tai, gia nô của Đổng Thừa là Tần Khánh Đồng vì có quan hệ mờ ám với thiếp của Đổng Thừa, bị Đổng Thừa đánh 40 trượng, vì vậy ôm hận trong lòng, hắn nghe được chuyện này, liền tố cáo Đổng Thừa, Cát Bình với Tào Tháo. Cát Bình thừa cơ Tào Tháo lên cơn đau đầu, lén bỏ thuốc độc. Tào Tháo nhận được mật báo, dụ bắt Cát Bình, tra tấn bằng cực hình, truy cứu kẻ chủ mưu. Cát Bình chết không khai, đập đầu vào bậc thềm mà chết.",
    "Explanation": "Gia đạo ưu nghi, Tự thân tiểu nhân, Cầu tài không, Giao dịch tổn thất, Hôn nhân không bền, Người đi khó, Điền vụ lục súc tổn, Tìm người dò hỏi, Kiện tụng thua, Di dời chớ động, Vật thất hung, Bệnh phạm la võng, Phong thủy tuyệt lộ."
  },
  {
    "ID": "99",
    "Rank": "HẠ XĂM",
    "Original": "勒馬持鞭直過來\n半有憂危半有灾\n恰似火遭焚燒屋\n天時降雨蕩成灰",
    "Transliteration": "Lặc mã trì tiên trực quá lai\nBán hữu ưu nguy bán hữu tai\nKháp tự hỏa tao phần thiêu ốc\nThiên thời giáng vũ đãng thành hôi",
    "Translation": "Buộc ngựa tay roi bước thẳng vo\nNữa sầu tai nạn nữa âu lo\nĐang lúc cháy nhà hừng hực lửa\nTrời ban mưa muộn đã thành tro",
    "Comment": "Cả đời lao lực, Chớ lo thị phi. Gông cùm tới mình, Óan hờn đem đến",
    "Divination": "Nữa lo nữa mừng. Mọi sự nên hành thiện làm phúc",
    "Reference": "Đào tam Xuân làm soái",
    "reference_translated": "Đào Tam Xuân đả Trịnh Ân tại vườn dưa(陶三春瓜園打鄭恩)",
    "reference_detail": "“Thần xin bẩm tấu Vạn Tuế,” Triệu Khuông Dận lại đứng dậy, “Bắc Bình Vương Trịnh Ân năm xưa từng có một mối hôn sự, nay thiên hạ thái bình, thần mong Vạn Tuế ban ơn, chọn một ngày lành, để hoàn tất hôn lễ cho người.” “Ồ, Tam đệ từng có hôn ước, việc này ta sao lại không biết?” Sài Vinh rất ngạc nhiên, ông ta vẫy tay ra hiệu cho Triệu Khuông Dận ngồi xuống nói chuyện. “Chuyện này nói ra dài lắm, thứ nhất là lúc đó hai chúng ta còn lang thang giang hồ, chưa đầu quân dưới trướng Ngài, sau đó lại liên miên chiến trận, không có thời gian quan tâm. Thứ hai là, Tam đệ cũng có chút xấu hổ không muốn nhắc tới, nên bệ hạ không biết.” “Hải, nam nhi lớn là phải cưới vợ, có gì mà phải ngại, Tam đệ từng chinh chiến sa trường, cũng coi là anh hùng cái thế, sao đến chuyện này lại trở nên tiểu nhân như vậy.” “Nói ra cũng không trách Tam đệ sợ xấu hổ, chỉ vì mối nhân duyên này là đánh mà có được.” “Đánh mà có được? Hắc, thú vị, ngươi mau nói xem, là chuyện gì.” “Vâng, nhớ năm đó, hai chúng ta đang muốn đầu quân cho Ngài, đi ngang qua huyện Bạc Thành, đúng là tháng sáu, trời rất nóng, Tam đệ ở trong quán trọ không yên, một mình ra ngoài đi dạo. Đi ngang qua một vườn dưa, liền vào hái dưa giải khát, lúc này dưa chín sớm không nhiều, Tam đệ lại không biết chọn, làm vỡ không ít quả dưa. Người trông dưa đó là một cô gái, tiến lên chỉ trích Tam đệ, hai người lời qua tiếng lại, liền động thủ với nhau. May mà ta lo lắng, kịp thời chạy đến cứu giúp, nếu không…” “Cái tên Trịnh Tử Minh này, vốn là lỗi của hắn, đáng lẽ phải xin lỗi, sao lại đánh người ta. Hơn nữa, người ta là một cô gái, sao chịu nổi nắm đấm của một hán tử mạnh mẽ như vậy! Ngươi mau nói, có đánh hỏng người ta không?” “Cô gái hoàn toàn không bị thương...” “Vậy thì tốt, vậy thì tốt... Ứ, không phải đã động thủ rồi sao? Ồ, chắc là do ngươi cứu giúp kịp thời.” “...Không phải, thần cứu giúp là... Tam đệ.” “Á?!” “Tam đệ bị cô gái đó lật ngã xuống đất, đánh cho một trận, may mà thần chạy đến khuyên can, mới không bị thương nặng. ...Bệ hạ... Bệ hạ!...” “Á? ...Ồ, người con gái đó là thân phận gì vậy!?” “Sau này mới biết, cô gái đó tên là Đào Tam Xuân, cha nàng là Đào Hồng, là một lão anh hùng không gặp thời. Đào Tam Xuân từ nhỏ theo cha học được một thân võ nghệ. Thần cùng gia đình nàng quen biết, thấy cô Tam Xuân phẩm hạnh xuất chúng, khoan thai đại lượng, hoàn toàn không có chút khí chất tiểu nữ nhi, liền có ý muốn tác hợp. Cha con họ Đào cũng rất yêu thích tính cách thẳng thắn của Tam đệ, hai bên nhanh chóng hợp ý, định ra mối hôn sự này cho hai người. Bệ hạ nói xem, đây chẳng phải là mối nhân duyên trời sinh sao?” (Câu chuyện này ví von: vì một chuyện xấu, ngược lại thành tựu một chuyện tốt.)",
    "Explanation": "Gia đạo cầu bảo, Tự thân thủ phận, Cầu tài phá, Giao dịch trở, Hôn nhân quan tụng, Điền vụ lục súc tổn, Người đi khó, Tìm người rắc rối, Kiện tụng thua, Vật thất hung Bệnh sầu nguy, Phong thủy bại."
  },
  {
    "ID": "100",
    "Rank": "HẠ XĂM",
    "Original": "佛神靈變與君知\n痴人說事轉昏迷\n老人求得靈簽去\n不知守舊待時來",
    "Transliteration": "Thánh thần linh biến dử quân tri\nSi nhân thuyết sự chuyển hôn mê\nLão nhân cầu đắc linh ăm khứ\nBất tri thủ cựu đãi thời lai",
    "Translation": "Thánh thần linh hiển mọi người hay\nKẻ đần nói bậy khác người say\nCầm được quẻ này nên khắc nhớ\nAn thân thủ cựu đợi tương lai",
    "Comment": "Linh xăm đã dứt, Báo với người hay, Y cựu chớ động, Đợi thời cơ tới",
    "Divination": "Thủ thường chớ động. Cố gắng chờ thời",
    "Reference": "Tiên Nhân đàm đạo",
    "reference_translated": "Tam Giáo đàm đạo (三教談道)",
    "reference_detail": "Thời Bắc Chu Vũ Đế, Tam Giáo (Nho, Thích, Đạo) bài xích lẫn nhau. Vua triệu tập đại hội, cho Tam Giáo tranh luận, trải qua ba lần tranh cãi, không có kết luận. Câu chuyện này ví von: Tam Giáo là một giáo, người ngu không hiểu đạo lý, cố chấp tranh cãi, hành vi của kẻ si mê.",
    "Explanation": "Mọi sự bất lợi, Cần nên làm phúc, Mới được bình an."
  }
]